[
  {"id":"Agrawal","abstract":"The Celestial Mapping System (CMS) is a software platform to generate virtual 3D globes for celestial bodies within our solar system. Various layers are built on top of the virtal globe to provide visualization of high resolution imagery, enable precise measurements, build analytical capabilities and a broad range of functionalities to assist planetary scientists and mission planners.","accessed":{"date-parts":[[2023,8,12]]},"author":[{"family":"Agrawal","given":"Parul"}],"citation-key":"Agrawal","contributor":[{"family":"Peterson","given":"Mark"},{"family":"Del Castillo","given":"Miguel"}],"event-place":"Mountain View, CA","publisher":"NASA Ames Research Center","publisher-place":"Mountain View, CA","title":"The Celestial Mapping System","type":"software","URL":"https://celestial.arc.nasa.gov/"},
  {"id":"Al-EkabiRobinson2021","abstract":"This paper serves as a background summary of recent lunar exploration activity in the context of relevant stakeholder interests.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Al-Ekabi","given":"Cenan"},{"family":"Robinson","given":"Chelsea"}],"citation-key":"Al-EkabiRobinson2021","issued":{"date-parts":[[2021,5,19]]},"publisher":"Open Lunar Foundation","title":"Recent Lunar Activity, Stakeholders and Incentives – A Backgrounder","type":"report","URL":"https://www.openlunar.org/library/recent-lunar-activity-stakeholders-and-incentives-a-backgrounder"},
  {"id":"Araki2021","abstract":"A new era of manned lunar exploration is dawning. Optical communication technology is expected to become indispensable for high-speed data transmission from lunar explorers to the Earth. This paper describes the expectations for contents from the Moon and the estimated amount of information. Then, two types of Lunar-Earth optical communication systems are discussed, including a comparison between direct communication with an optical ground station (OGS) and communication through a data relay satellite in geostationary orbit (GEO) around the Earth.","accessed":{"date-parts":[[2023,3,27]]},"author":[{"family":"Araki","given":"Tomohiro"}],"citation-key":"Araki2021","container-title":"International Conference on Space Optics — ICSO 2020","DOI":"10.1117/12.2599331","event-title":"International Conference on Space Optics — ICSO 2020","issued":{"date-parts":[[2021,6,11]]},"page":"811-819","publisher":"SPIE","source":"www.spiedigitallibrary.org","title":"A trade-off study of lunar-earth optical communication links","type":"paper-conference","URL":"https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11852/118521X/A-trade-off-study-of-lunar-earth-optical-communication-links/10.1117/12.2599331.full","volume":"11852"},
  {"id":"BasarEtAl2019","accessed":{"date-parts":[[2023,8,27]]},"author":[{"family":"Basar","given":"Ertugrul"},{"family":"Di Renzo","given":"Marco"},{"family":"De Rosny","given":"Julien"},{"family":"Debbah","given":"Merouane"},{"family":"Alouini","given":"Mohamed-Slim"},{"family":"Zhang","given":"Rui"}],"citation-key":"BasarEtAl2019","container-title":"IEEE Access","container-title-short":"IEEE Access","DOI":"10.1109/ACCESS.2019.2935192","ISSN":"2169-3536","issued":{"date-parts":[[2019]]},"page":"116753-116773","source":"DOI.org (Crossref)","title":"Wireless Communications Through Reconfigurable Intelligent Surfaces","type":"article-journal","URL":"https://ieeexplore.ieee.org/document/8796365/","volume":"7"},
  {"id":"BirraneMcKeever2022","abstract":"This document defines a security protocol providing data integrity and confidentiality services for the Bundle Protocol (BP).","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Birrane","given":"Edward J."},{"family":"McKeever","given":"Kenneth"}],"citation-key":"BirraneMcKeever2022","DOI":"10.17487/RFC9172","genre":"Request for Comments","issued":{"date-parts":[[2022,1]]},"number":"RFC 9172","number-of-pages":"35","publisher":"Internet Engineering Task Force","source":"IETF","title":"Bundle Protocol Security (BPSec)","type":"report","URL":"https://datatracker.ietf.org/doc/rfc9172"},
  {"id":"BiswasEtAl2021","abstract":"In the coming decade, a multitude of small, carry-on payloads in the form of miniature rovers, scientific instruments and surface deployed stand-alone systems will provide many new and exciting possibilities for lunar exploration. For these system, the survival of and operation in the extreme cold of the lunar night will be the biggest challenge, as most will be purely battery driven and unable to rely on radioisotope heaters. Maximizing battery lifetime in these conditions requires a trade-off between energy density, low-temperature performance and insulation, but comparable temperature and current dependent discharge capacities of batteries and other energy storage devices are often not reported in datasheets or literature. For this reason, a selection of energy storage devices was chosen and tested to determine their low-temperature performance in a representative environment. Based on this data, the theoretical lifetime per battery weight and optimal operational temperature for varying degrees of insulation was determined. It was shown that the selection of the optimal energy storage device and operational temperature depends on the insulation, emphasizing the need for multi-disciplinary design optimization.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Biswas","given":"János"},{"family":"Malzone","given":"Pietro Queiroga"},{"family":"Rößler","given":"Felix"}],"citation-key":"BiswasEtAl2021","container-title":"Acta Astronautica","container-title-short":"Acta Astronautica","DOI":"10.1016/j.actaastro.2021.04.042","ISSN":"0094-5765","issued":{"date-parts":[[2021,8,1]]},"language":"en","page":"308-318","source":"ScienceDirect","title":"Energy storage selection and operation for night-time survival of small lunar surface systems","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0094576521002101","volume":"185"},
  {"id":"Brown2020","abstract":"NASA has selected 14 American companies, including several small businesses, as partners to develop a range of technologies that will help forge a path to sustainable Artemis operations on the Moon by the end of the decade.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Brown","given":"Katherine"}],"citation-key":"Brown2020","container-title":"NASA","genre":"Text","issued":{"date-parts":[[2020,10,14]]},"language":"und","title":"NASA Announces Partners to Advance 2020 ‘Tipping Point’ Technologies","type":"webpage","URL":"http://www.nasa.gov/press-release/nasa-announces-partners-to-advance-tipping-point-technologies-for-the-moon-mars"},
  {"id":"BurleighEtAl2022","abstract":"This document presents a specification for the Bundle Protocol, adapted from the experimental Bundle Protocol specification developed by the Delay-Tolerant Networking Research Group of the Internet Research Task Force and documented in RFC 5050.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Burleigh","given":"Scott"},{"family":"Fall","given":"Kevin"},{"family":"Birrane","given":"Edward J."}],"citation-key":"BurleighEtAl2022","DOI":"10.17487/RFC9171","genre":"Request for Comments","issued":{"date-parts":[[2022,1]]},"number":"RFC 9171","number-of-pages":"53","publisher":"Internet Engineering Task Force","source":"IETF","title":"Bundle Protocol Version 7","type":"report","URL":"https://datatracker.ietf.org/doc/rfc9171"},
  {"id":"Byagowi","author":[{"family":"Byagowi","given":"Ahmad"}],"citation-key":"Byagowi","language":"en","source":"Zotero","title":"Open Time Server and Time Card 2","type":"article-journal"},
  {"id":"Byagowi2022","abstract":"The journey to Precision Time Protocol (PTP) has been a long one. We're sharing a deep technical dive into our PTP migration","accessed":{"date-parts":[[2023,7,12]]},"author":[{"family":"Byagowi","given":"Oleg Obleukhov","suffix":"Ahmad"}],"citation-key":"Byagowi2022","container-title":"Engineering at Meta","issued":{"date-parts":[[2022,11,21]]},"language":"en-US","title":"How Precision Time Protocol is being deployed at Meta","type":"post-weblog","URL":"https://engineering.fb.com/2022/11/21/production-engineering/precision-time-protocol-at-meta/"},
  {"id":"Byagowi2022a","accessed":{"date-parts":[[2023,5,6]]},"author":[{"family":"Byagowi","given":"Ahmad"}],"authority":"IEEE Standards Association","citation-key":"Byagowi2022a","issued":{"date-parts":[[2022,12,3]]},"language":"en","number":"P3335","section":"IM/ST - TC9 - Sensor Technology","status":"Active PAR","title":"Standard for Architecture and Interfaces for Time Card","type":"standard","URL":"https://standards.ieee.org"},
  {"id":"ByagowiEtAl2022","abstract":"The Open Time Server has been originally conceived as a reference design by the OCP-TAP (Open-Compute-Project Time Appliance Project). It intends to provide the time synchronization service to data centers, by supporting, among others, the under-development DC PTP profile, GNSS reception, enhanced holdover capabilities, etc.Time Card is an open-source Peripheral Component Interconnect express (PCIe) card that provides time accuracy for the open time server. The Open Time Server is based on the Time Card and consists of open-source software (drivers and protocol stacks) as well as other necessary peripherals like Network Interface Controller (NIC). The entire design is open-source and available for the public. Therefore, it offers unparalleled opportunities for adapting and extending the design in a cost-effective manner. This publication explores some of the capabilities and advantages of the Time Card and the Open Time Server and concludes with the future work and the vision of the project.","author":[{"family":"Byagowi","given":"Ahmad"},{"family":"Meier","given":"Sven"},{"family":"Schaub","given":"Thomas"},{"family":"Sotiropoulos","given":"Ioannis"}],"citation-key":"ByagowiEtAl2022","container-title":"2022 IEEE International Symposium on Precision Clock Synchronization for Measurement, Control, and Communication (ISPCS)","DOI":"10.1109/ISPCS55791.2022.9918379","event-title":"2022 IEEE International Symposium on Precision Clock Synchronization for Measurement, Control, and Communication (ISPCS)","ISSN":"1949-0313","issued":{"date-parts":[[2022,10]]},"page":"1-6","source":"IEEE Xplore","title":"Time Card and Open Time Server","type":"paper-conference"},
  {"id":"CainiFiore2012","abstract":"Although Delay-/Disruption- Tolerant Networking, which originated from research on an Interplanetary Internet, has enlarged its scope to encompass all challenged networks, space applications are still one of its most important application fields. This paper deals with DTN communication from Moon to Earth, based on the use of a lunar satellite acting as a “data-mule” to collect data from a Lander located on the far side of the Moon. To make the scenario more interesting and complex from the point of view of possible security threats, we assume that data must be transferred to a non-institutional user connected to the Space Agency Control Centre via Internet. In particular, the paper investigates the state-of-the-art ability of ION, the NASA implementation of the DTN Bundle Protocol (BP), to cope with the many challenges of the space scenario under investigation, such as intermittent links, low bandwidth, relatively high delays, network partitioning, DTN routing, interoperability between LTP and TCP BP Convergence layers and security threats. To this end, the first part of the paper contains three brief overviews of the DTN architecture, the Bundle Security Protocol and the ION implementation. These facilitate comprehension of the following sections, dedicated to a detailed description of the experiment scenario and, most essentially, to the in depth discussion of the numerical results obtained with the latest ION version (3.0).","author":[{"family":"Caini","given":"Carlo"},{"family":"Fiore","given":"Vincenzo"}],"citation-key":"CainiFiore2012","container-title":"2012 6th Advanced Satellite Multimedia Systems Conference (ASMS) and 12th Signal Processing for Space Communications Workshop (SPSC)","DOI":"10.1109/ASMS-SPSC.2012.6333112","event-title":"2012 6th Advanced Satellite Multimedia Systems Conference (ASMS) and 12th Signal Processing for Space Communications Workshop (SPSC)","ISSN":"2326-5949","issued":{"date-parts":[[2012,9]]},"page":"89-95","source":"IEEE Xplore","title":"Moon to earth DTN communications through lunar relay satellites","type":"paper-conference"},
  {"id":"CarruthEtAl2010","abstract":"A number of factors are driving the improvement of NASA’s communications network\nscheduling, including reducing cost, scaling to support a larger number of increasingly\ncomplex missions, and maintaining round the clock availability and reliability. This paper\ndescribes the Deep Space Network (DSN) Service Scheduling Software (S3\n), an innovative\ndesign to provide a unified scheduling framework for DSN scheduling services. Among the\nchallenges addressed by the S3\n design are user-managed workspace schedules for scenario\nand contingency schedule development, automated change proposals for mutual peer-to-peer\nconcurrence of schedule changes, and tight integration with a high performance scheduling\nengine that checks for conflicts and scheduling requirement violations, and performs\nautomated conflict resolution. S3\n is architected as a web application that accesses a database\nand that can be run by any DSN scheduling user via a standard web browser. It makes\nextensive use of modern web technologies to provide a rich client user experience,\ncomparable to popular social networking applications. Among the features provided by the\nweb framework are the online status of other users, instant unobtrusive notification of\nevents of interest, peer-to-peer and multi-user chat, document sharing, and integration with\na wiki for a persistent running record of scheduling-related textual information. This\napproach is appropriate for DSN scheduling due to its highly collaborative nature: the DSN\nschedule is developed not by a central scheduling authority, but by individual DSN users\nworking together to fit requests into the schedule, making tradeoffs and compromises where\nappropriate. S3\n is scheduled for operational deployment in 2010. This paper presents an\noverview of the innovative features of the S3\n design and implementation, and describes its\nusage as the next generation DSN scheduling system.","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Carruth","given":"Butch"},{"family":"Johnston","given":"Mark"},{"family":"Coffman","given":"Adam"},{"family":"Wallace","given":"Mike"},{"family":"Arroyo","given":"Belinda"},{"family":"Malhotra","given":"Shan"}],"citation-key":"CarruthEtAl2010","container-title":"SpaceOps 2010 Conference","DOI":"10.2514/6.2010-2284","event-place":"Huntsville, Alabama","event-title":"SpaceOps 2010 Conference: Delivering on the Dream (Hosted by NASA Marshall Space Flight Center and Organized by AIAA)","ISBN":"978-1-62410-164-9","issued":{"date-parts":[[2010,4,25]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Huntsville, Alabama","source":"DOI.org (Crossref)","title":"A Collaborative Scheduling Environment for NASA's Deep Space Network","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2010-2284"},
  {"id":"Cheetham2021","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Cheetham","given":"Bradley"}],"citation-key":"Cheetham2021","container-title":"ASCEND 2021","DOI":"10.2514/6.2021-4128","event-place":"Las Vegas, Nevada & Virtual","event-title":"ASCEND 2021","ISBN":"978-1-62410-612-5","issued":{"date-parts":[[2021,11,15]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Las Vegas, Nevada & Virtual","source":"DOI.org (Crossref)","title":"Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE)","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2021-4128"},
  {"id":"CheungLee2018","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Cheung","given":"Kar-Ming"},{"family":"Lee","given":"Charles"}],"citation-key":"CheungLee2018","container-title":"2018 SpaceOps Conference","DOI":"10.2514/6.2018-2612","event-place":"Marseille, France","event-title":"2018 SpaceOps Conference","ISBN":"978-1-62410-562-3","issued":{"date-parts":[[2018,5,28]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Marseille, France","source":"DOI.org (Crossref)","title":"Lunar Relay Coverage Analysis for RF and Optical Links","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2018-2612"},
  {"id":"ChinEtAl2008","abstract":"The initial creation of the P-POD was driven by the need for consistency and increased frequency in both pico-satellite development and access to space. The PPOD protects the launch vehicle and the primary payload as well as the CubeSats, and is compatible with many launch vehicles, making integration repeatable and cost-efficient. The P-POD can accommodate picosatellites that meet the 1kg mass and 10 centimeter cubic dimensional CubeSat standard. Mass producing a stock deployment device creates reliability in flight heritage and decreases design, manufacturing and testing costs. The P-POD provides a framework for developers to design around, and enforces adherence to the CubeSat specification. In turn, the P-POD is designed with the capability to integrate onto multiple launch vehicles. The advantages of this system are most evident in creating flexibility for CubeSat developers to launch on multiple rockets as secondary payloads. Since most satellite manufacturers must coordinate directly with the launch vehicle provider, secondary and tertiary payloads find it difficult to acquire launches. The P-POD can group multiple CubeSats to provide a competitive basis for launch as a viable secondary payload. This has allowed CubeSat developers to develop their system without a preset launch. A review of the P-POD flights over the past 5 years, and an outline of future launches consistently show the value of a standard and the benefits of flexibility.","author":[{"family":"Chin","given":"Alexander"},{"family":"Coelho","given":"Roland"},{"family":"Brooks","given":"Lori"},{"family":"Nugent","given":"Ryan"}],"citation-key":"ChinEtAl2008","event-place":"Los Angeles, CA","event-title":"6th Responsive Space Conference","issued":{"date-parts":[[2008]]},"language":"en","publisher":"AIAA","publisher-place":"Los Angeles, CA","source":"Zotero","title":"Standardization Promotes Flexibility: A Review of CubeSats’ Success","type":"paper-conference"},
  {"id":"Christou2022","accessed":{"date-parts":[[2023,8,27]]},"author":[{"family":"Christou","given":"Filippos"}],"citation-key":"Christou2022","container-title":"2022 18th International Conference on Network and Service Management (CNSM)","DOI":"10.23919/CNSM55787.2022.9964606","event-place":"Thessaloniki, Greece","event-title":"2022 18th International Conference on Network and Service Management (CNSM)","ISBN":"978-3-903176-51-5","issued":{"date-parts":[[2022,10,31]]},"page":"359-363","publisher":"IEEE","publisher-place":"Thessaloniki, Greece","source":"DOI.org (Crossref)","title":"Decentralized Intent-driven Coordination of Multi-Domain IP-Optical Networks","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/9964606/"},
  {"id":"ClementJohnston","abstract":"We describe the Deep Space Network’s scheduling problem based on a user requirement language. The problem is difficult to encode by almost all existing planning and scheduling systems. We describe how it can be mapped into a system that supports metric resources, durative action, simple temporal network constraints, and task hierarchy among other language features. We also describe how we adapted a local search scheduler to generate schedules. However, we argue that the application will best serve the users if local search is combined with systematic search. We describe how an implemented systematic search can be effectively applied to rescheduling.","author":[{"family":"Clement","given":"Bradley J"},{"family":"Johnston","given":"Mark D"}],"citation-key":"ClementJohnston","language":"en","source":"Zotero","title":"The Deep Space Network Scheduling Problem","type":"article-journal"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2008","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2008","event-place":"Washington, DC, USA","genre":"Recommended Practice","issued":{"date-parts":[[2008]]},"language":"en","number":"CCSDS 311.0-M-1","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Reference Architecture for Space Data Systems","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2010","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2010","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2010]]},"language":"en","number":"CCSDS 301.0-B-4","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Time Code Formats","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2012","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2012","genre":"Recommended Practice","issued":{"date-parts":[[2012]]},"language":"en","number":"CCSDS 650.0-M-2","source":"Zotero","title":"Reference Model for an Open Archival Information System (OAIS)","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2014","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2014","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2014]]},"language":"en","number":"CCSDS 702.1-B-1","publisher-place":"Washington, DC, USA","source":"Zotero","title":"IP over CCSDS Space Links","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2015","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2015","event-place":"Washington, DC, USA","genre":"Informational Report","issued":{"date-parts":[[2015]]},"language":"en","number":"CCSDS 130.2-G-3","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Space Data Link Protocols—Summary of Concept and Rationale","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2015a","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2015a","event-place":"Washington, DC, USA","genre":"Recommended Practice","issued":{"date-parts":[[2015]]},"language":"en","number":"CCSDS 901.1-M-1","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Space Communications Cross Support—Architecture Requirements Document","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2020","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2020","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2020]]},"language":"en","number":"CCSDS 133.1-B-3","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Encapsulation Packet Protocol","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2020a","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2020a","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2020]]},"language":"en","number":"CCSDS 133.0-B-2","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Space Packet Protocol","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2022","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2022","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2022]]},"language":"en","number":"CCSDS 883.0-B-1","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Spacecraft Onboard Interface Services—High Data Rate 3GPP and Wi-Fi Local Area Communications","type":"report"},
  {"id":"CosbyTai2022","author":[{"family":"Cosby","given":"Matthew"},{"family":"Tai","given":"Wallace"}],"citation-key":"CosbyTai2022","container-title":"Lunar Communications Architecture Working Group","issued":{"date-parts":[[2022,1,31]]},"language":"en","source":"Zotero","title":"Report of the Interagency Operations Advisory Group Lunar Communications Architecture Working Group","type":"article-journal"},
  {"id":"CrescentSpace2023","abstract":"The next avenue for continuing human presence in space comes down to one place—the Moon.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"literal":"Crescent Space"}],"citation-key":"CrescentSpace2023","container-title":"Lockheed Martin","issued":{"date-parts":[[2023,3,28]]},"language":"en","title":"Parsec™ Service from Lockheed Martin","type":"webpage","URL":"https://www.lockheedmartin.com/en-us/news/features/2021/lunar-communication-and-navigation-network.html"},
  {"id":"DivsalarEtAl2019","abstract":"In this paper we design and analyze an end-to-end communication system between a lander/rover on the surface of the lunar South Pole and an Earth station. The acquisition and tracking system is discussed in detail. The communication system on the lander or rover could be used for the Earth-to-Moon communication. To communicate to and from the lander/rover on the lunar South Pole, low and/or medium directional antennas onboard the lander/rover will have to be pointed at low elevation angles between 2 to 10 degrees, thus causing multipath fading effects due to reflection of a portion of the transmitted electromagnetic waves from the surface of the Moon that are not commonly encountered in traditional deep space communications between a spacecraft and a ground station. To design and analyze such a communication system, and in particular the acquisition and tracking system, in the presence of multipath fading, first we model the fading channel based on existing and simulated data. In addition to multipath fading, the channel also introduces Doppler frequency up to 11.5 KHz, and Doppler rate up to 0.735 Hz/sec. For coherent reception the Doppler frequency, which is time varying, should be acquired and the incoming carrier phase, which includes the fading phase, should be tracked in the presence of multipath fading. For this communication system in addition to estimating the received carrier phase, the amplitude of the fading signal should also be estimated, in particular to be used in the decoder. In addition to acquisition and tracking, we consider simple modulation and coding schemes. Space diversity using two antennas on Earth to mitigate the effects of fading could also be used. We design phase-locked loops and frequency sweeping schemes robust to the attenuations due to fading. After designing various components of the communication system, we use Simulink models to obtain the end-to-end performance of the communication link under investigation. Based on the available data, the fading channel can be accurately modeled as a Rician fading channel with Rician parameter of 10 dB, and Doppler spread that depends on the Doppler frequency and the transmit/receive antenna patterns. The challenge is how to make such a communication system robust in the presence of the multipath fading where the Doppler spread changes in time and thus produces fading with time-varying durations (short and very long fades). In summary, this paper covers communication system design, performance analysis, and simulations for performance of Doppler frequency acquisition, tracking, uncoded system, and coded system under ideal interleaving assumption with hard decision over communication link between a lander/rover at the Lunar south pole and a DSN Earth station in presence of Rician fading.","author":[{"family":"Divsalar","given":"Dariush"},{"family":"Net","given":"Marc Sanchez"},{"family":"Cheung","given":"Kar-Ming"}],"citation-key":"DivsalarEtAl2019","container-title":"2019 IEEE Aerospace Conference","DOI":"10.1109/AERO.2019.8742112","event-title":"2019 IEEE Aerospace Conference","ISSN":"1095-323X","issued":{"date-parts":[[2019,3]]},"page":"1-14","source":"IEEE Xplore","title":"Acquisition and tracking for communications between Lunar South Pole and Earth","type":"paper-conference"},
  {"id":"FlaneganEtAl2008","abstract":"America's Vision for Space Exploration envisions the permanent return of humans to the\nmoon and the expansion of human presence across the solar system. A major NASA effort to\ndevelop architectures for lunar exploration and science, called the Lunar Architecture Team\n(LAT), completed a multi-center, year long study in September 2007. The concepts of\noperations, analyses, requirements, and conceptual designs developed during the LAT study\nform the basis of the current effort to decide on the basic elements of the overall space\ntransportation and lunar surface systems architecture. The elements of the Lunar\nArchitecture include descent and ascent transportation, habitation, mobility, power\ngeneration and distribution, resource extraction and storage, Extra-Vehicular Activity\n(EVA), and communications and navigation. In this paper, an overview of the LAT\nCommunication and Navigation (C&N) results will be described. This includes the\narchitecture of the Lunar Network (LN), concepts of operations, spectrum utilization, traffic\nmodel, element design concepts (including lunar relay satellites, surface communication\nterminals, and user radios), and requisite technology improvements.","accessed":{"date-parts":[[2023,8,12]]},"author":[{"family":"Flanegan","given":"Mark"},{"family":"Gal-Edd","given":"Jonathon"},{"family":"Anderson","given":"Lynn"},{"family":"Warner","given":"Joseph"},{"family":"Ely","given":"Todd"},{"family":"Lee","given":"Charles"},{"family":"Shah","given":"Biren"},{"family":"Vaisnys","given":"Arvydas"},{"family":"Schier","given":"James"}],"citation-key":"FlaneganEtAl2008","collection-title":"SpaceOps Conferences","container-title":"SpaceOps 2008 Conference","DOI":"10.2514/6.2008-3589","issued":{"date-parts":[[2008,5,12]]},"publisher":"American Institute of Aeronautics and Astronautics","source":"arc.aiaa.org (Atypon)","title":"NASA Lunar Communication and Navigation Architecture","type":"chapter","URL":"https://arc.aiaa.org/doi/10.2514/6.2008-3589"},
  {"id":"Foust2022","abstract":"Quantum Space has raised $15 million to further development of the first in a constellation of satellites intended to provide services in cislunar space.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Foust","given":"Jeff"}],"citation-key":"Foust2022","container-title":"SpaceNews","issued":{"date-parts":[[2022,12,13]]},"language":"en-US","title":"Quantum Space raises $15 million for cislunar spacecraft","type":"post-weblog","URL":"https://spacenews.com/quantum-space-raises-15-million-for-cislunar-spacecraft/"},
  {"id":"GiordanoEtAl2022","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Giordano","given":"Pietro"},{"family":"Malman","given":"Floor"},{"family":"Swinden","given":"Richard"},{"family":"Zoccarato","given":"Paolo"},{"family":"Ventura-Traveset","given":"Javier"}],"citation-key":"GiordanoEtAl2022","DOI":"10.33012/2022.18225","event-place":"Long Beach, California","event-title":"2022 International Technical Meeting of The Institute of Navigation","ISSN":"2330-3646","issued":{"date-parts":[[2022,2,14]]},"page":"632-642","publisher-place":"Long Beach, California","source":"DOI.org (Crossref)","title":"The Lunar Pathfinder PNT Experiment and Moonlight Navigation Service: The Future of Lunar Position, Navigation and Timing","title-short":"The Lunar Pathfinder PNT Experiment and Moonlight Navigation Service","type":"paper-conference","URL":"https://www.ion.org/publications/abstract.cfm?articleID=18225"},
  {"id":"HarleEtAl","abstract":"View Video Presentation: https://doi.org/10.2514/6.2021-4132.vidLunar comms and nav infrastructure – first data relay orbiter Lunar Pathfinder, operational in 2024, paves the way for full constellation by 2030s A key to sustainable lunar exploration is access to permanent, low-cost and high performance service infrastructure. Easy access to support services such as communication and navigation will rapidly become essential for lunar missions, for technical and economic reasons. A similar trend has already been observed in the transportation domain in the USA, where 14 CLPS (Commercial Lunar Payload Services) compete regularly to provide transportation to the Moon as a service. To an emerging space nation with a low-budget science mission on the far-side, this infrastructure will be an enabler by removing the need for a relay spacecraft. To a commercial endeavour looking to invest in ISRU (In-Situ Resource Utilization), it will help close the business case for investment and grow the demand. Early 2021, in partnership with the European Space Agency (ESA), Surrey Satellite Technology Ltd (SSTL) started the clock on the development of Lunar Pathfinder, the first data-relay lunar orbiter to commercially offer communication services to missions on the surface and in orbit around the Moon. From 2024 onwards, lunar missions of all types (orbiters, rovers, landers, stationary instruments) will be able to access the service and dramatically enhance the value of their mission by lifting the multiple constraints of transferring data back to Earth. Transmitting Direct to Earth (DTE) presents several limitations that can be lifted by the use of a comms relay infrastructure. DTE relies on direct line of sight, which makes it impossible for far-side missions, and a risk for mobile missions likely to encounter obstructing terrain. It also limits the achievable data-rate and contact time with the often oversubscribed deep space ground stations, therefore constraining the overall volume of data that can be retrieved by the end user. With a store and forward capability, a proximity link, two simultaneous channels in S-band and UHF, Lunar Pathfinder data-relay spacecraft is designed to lift these constraints, allowing longer upload durations at higher data-rates with each of the lunar assets, and bulk-sending data, at high speed, back to an Earth Ground Station, ready for distribution to the end users. In addition to its main mission, Lunar Pathfinder will also carry a hosted payload, an ESA GNSS receiver, with the objective of running a GNSS weak signal detection experiment from lunar orbit, a significant step towards navigation service provision for lunar assets. The decision to proceed with building the Lunar Pathfinder infrastructure and services, in the frame of a commercial partnership between SSTL and ESA, was the result of a successful study phase realized for ESA in collaboration with Goonhilly Earth Station (GES). It was also enabled by NASA’s interest in using the communication services for their own robotic assets. Several customer missions are now actively working with SSTL Lunar (a new brand of SSTL, dedicated to the provision of lunar services) to prepare their communication service package. And we are not stopping there… As lunar missions evolve and move from mainly science and exploration towards in-situ resource utilization and purely commercial endeavours, such as tourism, they will increasingly rely on a lunar infrastructure that can provide permanent, low-cost and high performance key support services. Building upon the Lunar Pathfinder experience and the commercialisation of its services, an SSTL-led consortium, including established telecom operators, as well as space and ground segment integrators, is already working on the next generation infrastructure. With a space segment based on a constellation of data-relay orbiters and strong interoperability requirements with other infrastructure elements such as Gateway, the overall system will integrate into the backbone infrastructure.","accessed":{"date-parts":[[2023,3,27]]},"author":[{"family":"Harle","given":"Nelly Offord"},{"family":"Oates","given":"Clive"},{"family":"Bywater","given":"Sophie"},{"family":"Cranstoun","given":"Charles"},{"family":"Friend","given":"Jonathan"},{"family":"Lay","given":"Gary"},{"family":"Schwarz","given":"Ben"},{"family":"Stevens","given":"Paul"},{"family":"Hufenbach","given":"Bernhard"},{"family":"Liuicci","given":"Francesco"},{"family":"Cosby","given":"Matthew"},{"family":"Saunders","given":"Chris"}],"citation-key":"HarleEtAl","container-title":"ASCEND 2021","DOI":"10.2514/6.2021-4132","publisher":"American Institute of Aeronautics and Astronautics","source":"American Institute of Aeronautics and Astronautics","title":"Lunar comms and nav infrastructure – first data relay orbiter Lunar Pathfinder, operational in 2024, paves the way for full constellation by 2030s","type":"chapter","URL":"https://arc.aiaa.org/doi/abs/10.2514/6.2021-4132"},
  {"id":"IsraelEtAl2020","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Israel","given":"David J."},{"family":"Mauldin","given":"Kendall D."},{"family":"Roberts","given":"Christopher J."},{"family":"Mitchell","given":"Jason W."},{"family":"Pulkkinen","given":"Antti A."},{"family":"Cooper","given":"La Vida D."},{"family":"Johnson","given":"Michael A."},{"family":"Christe","given":"Steven D."},{"family":"Gramling","given":"Cheryl J."}],"citation-key":"IsraelEtAl2020","container-title":"2020 IEEE Aerospace Conference","DOI":"10.1109/AERO47225.2020.9172509","event-place":"Big Sky, MT, USA","event-title":"2020 IEEE Aerospace Conference","ISBN":"978-1-72812-734-7","issued":{"date-parts":[[2020,3]]},"page":"1-14","publisher":"IEEE","publisher-place":"Big Sky, MT, USA","source":"DOI.org (Crossref)","title":"LunaNet: a Flexible and Extensible Lunar Exploration Communications and Navigation Infrastructure","title-short":"LunaNet","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/9172509/"},
  {"id":"Jardine2022","abstract":"Normative behaviours are integral to fostering a coherent community of actors and promoting peace and stability for existing treaties and aspirational goals. The author aims to explain why normative behaviours are needed for Lunar activity.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Jardine","given":"Samuel"}],"citation-key":"Jardine2022","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,12,14]]},"title":"Building Lunar Security and Cooperation Through an Astropolitical Lens- Why Normative Behaviours are Needed for Lunar Activity","type":"post-weblog","URL":"https://www.openlunar.org/library/open-lunar-registry-blog-post-series-blog-3"},
  {"id":"Jardine2022a","abstract":"This blog posts series will analyse the political backdrop for an independent multi-stakeholder Lunar activity registry, highlighting why it’s needed and how it might help. These are the precursors to a more comprehensive White Paper which we’ll be working on over the coming months.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Jardine","given":"Samuel"}],"citation-key":"Jardine2022a","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,11,10]]},"title":"Building Lunar Security and Cooperation Through an Astropolitical Lens- the role of normative behaviours in creating stability","type":"post-weblog","URL":"https://www.openlunar.org/library/open-lunar-registry-project-blog-post-series-blog-1"},
  {"id":"Jardine2022b","abstract":"Norms, particularly transparency, are needed to stabilise competition and promote cooperation on the Moon. However, these are not created in a vacuum but require their own tools and frameworks to develop, champion, and facilitate the adoption of the norm among the intended community of actors.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Jardine","given":"Samuel"}],"citation-key":"Jardine2022b","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,12,16]]},"title":"Building Lunar Security and Cooperation Through an Astropolitcal Lens- how to construct normative behaviours on the moon- enter the registry","type":"post-weblog","URL":"https://www.openlunar.org/library/open-lunar-registry-project-blog-post-series-blog-4"},
  {"id":"KellerEtAl2016","abstract":"Since entering lunar orbit on June 23, 2009 the Lunar Reconnaissance Orbiter (LRO) has made comprehensive measurements of the Moon and its environment. The seven LRO instruments use a variety of primarily remote sensing techniques to obtain a unique set of observations. These measurements provide new information regarding the physical properties of the lunar surface, the lunar environment, and the location of volatiles and other resources. Scientific interpretation of these observations improves our understanding of the geologic history of the Moon, its current state, and what its history can tell us about the evolution of the Solar System. Scientific results from LRO observations overturned existing paradigms and deepened our appreciation of the complex nature of our nearest neighbor. This paper summarizes the capabilities, measurements, and some of the science and exploration results of the first six years of the LRO mission.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Keller","given":"J. W."},{"family":"Petro","given":"N. E."},{"family":"Vondrak","given":"R. R."}],"citation-key":"KellerEtAl2016","container-title":"Icarus","container-title-short":"Icarus","DOI":"10.1016/j.icarus.2015.11.024","ISSN":"0019-1035","issued":{"date-parts":[[2016,7,15]]},"language":"en","page":"2-24","source":"ScienceDirect","title":"The Lunar Reconnaissance Orbiter Mission – Six years of science and exploration at the Moon","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0019103515005412","volume":"273"},
  {"id":"KongsbergSatelliteServices","abstract":"To meet the rapidly increasing demand for lunar comms, KSAT will invest in a purpose- built lunar ground network. The Lunar Team at KSAT has been preparing the service and is currently engaging with antenna providers and selecting optimal locations for the antennas.","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Kongsberg Satellite Services","given":""}],"citation-key":"KongsbergSatelliteServices","title":"KSAT to invest in a dedicated antenna network for lunar missions","type":"post-weblog","URL":"https://www.ksat.no/news/news-archive/2022/ksat-to-invest-in-antenna-network-for-lunar-missions/"},
  {"id":"LawEtAl2021","abstract":"The Line of Sight (LoS) is one of the latest tools to join the analytics suite of tools for the Solar System Treks (https://trek.nasa.gov) portals.  The LoS tool provides a way to compute visibility between the entities in our solar system. More concretely, this utility searches for windows of communication or a “line of sight” between any two entities. Entities include orbiters, rovers, planetary bodies, ground stations, and other topographical locations. In addition to establishing communications between the two entities, the tool also takes into account local terrains of the entities in question.\n\nThe software seeks to answer questions about establishing communications between a rover and an orbiter, or an orbiter to a ground station. In mission planning, LoS can be used to determine possible traverses for a rover that must maintain communications with a lander, or find time intervals of communication to an orbiter when a rover or lander are near an obstructing surface feature such as a crater rim or mound. Computations can be even more granular and lines of sight can be computed between mission instruments, thus allowing to ask questions such as “Is the High Gain Antenna on a rover visible from an orbiter?”\n\nThe initial release of the software focuses on the lunar surface and the LRO spacecraft. Users can ask whether a topographical location on the moon is visible from the orbiter or a discrete set of ground stations on Earth. The tool uses NAIF SPICE and various mission kernels for computing planetary geometries. LoS also uses high resolution Digital Elevation Model (DEM) to model the terrain surrounding the points of interest. In-house software is used to convert high resolution DEMs into a format compatible with the tool. Users can provide their own DEMs to model the terrain on different topographical locations to use for their own computations.","accessed":{"date-parts":[[2023,8,12]]},"author":[{"family":"Law","given":"Emily"},{"family":"Gallegos","given":"Natalie"},{"family":"Malhotra","given":"Shan"}],"citation-key":"LawEtAl2021","DOI":"10.5194/epsc2021-150","issued":{"date-parts":[[2021,6,28]]},"language":"en","number":"EPSC2021-150","publisher":"Copernicus Meetings","source":"meetingorganizer.copernicus.org","title":"Line of Sight Analysis","type":"report","URL":"https://meetingorganizer.copernicus.org/EPSC2021/EPSC2021-150.html"},
  {"id":"LindenEtAl2023","abstract":"The establishment of a local lunar time standard or a shared and openly accessible reference timing signal can greatly enhance the positioning, navigation, and timing (PNT) capabilities of lunar missions without the need for direct links to Earth or precision instruments to be a requirement for every mission to the Moon. This paper proposes the concept of a local lunar time standard that can be accessed using technology that is likely to be included in most lunar missions for nominal activities. Even if the local lunar time standard exhibits drift or variations from terrestrial time, its existence would be a significant step towards lunar coordination. Unlike terrestrial synchronized time, a fully usable lunar reference time can be implemented proactively before the activity that necessitates it occurs. This paper discusses the potential benefits and challenges of establishing a local lunar time standard and its implications for lunar missions, including its compatibility with existing lunar initiatives such as LunaNet, Moonlight, and upcoming lunar missions. The proposal highlights the opportunities and considerations for stakeholders in the cislunar ecosystem, including options for missions to ignore, participate in seeding, or consume the proposed timekeeping protocol. The proposal is expected to contribute to the evolving landscape of timekeeping technologies and methods in cislunar space, and stimulate further research and discussion on this topic.","author":[{"family":"Linden","given":"Philip"},{"family":"Jardine","given":"Samuel"},{"family":"Schingler","given":"Jessy Kate"}],"citation-key":"LindenEtAl2023","DOI":"10.13140/RG.2.2.29175.70564","issued":{"date-parts":[[2023,4,1]]},"license":"Creative Commons Attribution-ShareAlike 4.0 International License (CC-BY-SA)","publisher":"Open Lunar Foundation","source":"ResearchGate","title":"Possibilities for a Local Lunar Time Standard","type":"report"},
  {"id":"MalmstromEtAl2006","abstract":"Landing sites near the South Pole of the Moon have been proposed for the upcoming\nLunar Precursor and Robotics Program (LPRP) and eventual return to the Moon. Direct\nline of sight from the lunar South Pole to Earth either does not exist at all, or exists only\nperiodically in many of the areas of interest. This paper will investigate several different\ncommunications architecture that enables lunar South Pole communication to Earth,\nincluding surface-to-lunar-relay, direct line of sight, and surface-to-Earth-relay.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Malmström","given":"Richard"},{"family":"Lo","given":"Amy"},{"family":"Brown","given":"Nathan"},{"family":"Haney","given":"George"}],"citation-key":"MalmstromEtAl2006","collection-title":"AIAA SPACE Forum","container-title":"Space 2006","DOI":"10.2514/6.2006-7453","issued":{"date-parts":[[2006,9,19]]},"publisher":"American Institute of Aeronautics and Astronautics","source":"arc.aiaa.org (Atypon)","title":"Continuous Communications to the Moon's South Pole","type":"chapter","URL":"https://arc.aiaa.org/doi/10.2514/6.2006-7453"},
  {"id":"MatsuhashiEtAl2023","accessed":{"date-parts":[[2023,8,27]]},"author":[{"family":"Matsuhashi","given":"Naoki"},{"family":"Takano","given":"Chisa"},{"family":"Aida","given":"Masaki"}],"citation-key":"MatsuhashiEtAl2023","container-title":"IEEE Access","container-title-short":"IEEE Access","DOI":"10.1109/ACCESS.2023.3288075","ISSN":"2169-3536","issued":{"date-parts":[[2023]]},"page":"62424-62435","source":"DOI.org (Crossref)","title":"Autonomous Decentralized Spectral Clustering for Hierarchical Routing of Multi-Hop Wireless Networks","type":"article-journal","URL":"https://ieeexplore.ieee.org/document/10158705/","volume":"11"},
  {"id":"Naseem2022","abstract":"There is an opportunity for actors interested in entering the lunar communications space to learn from the best practices of network infrastructure providers (ISPs/IXPs), as well as the open source community.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Naseem","given":"Mariam"}],"citation-key":"Naseem2022","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,1,26]]},"title":"Last-mile Analogies for a Lunar Communications Network - Open Lunar Foundation","type":"post-weblog","URL":"https://www.openlunar.org/library/last-mile"},
  {"id":"Obleukhov2021","abstract":"Facebook engineers built and open sourced an Open Compute Time Appliance, an important component of the modern timing infrastructure.","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Obleukhov","given":"Ahmad Byagowi","suffix":"Oleg"}],"citation-key":"Obleukhov2021","container-title":"Engineering at Meta","issued":{"date-parts":[[2021,8,11]]},"language":"en-US","title":"Open-sourcing a more precise time appliance","type":"post-weblog","URL":"https://engineering.fb.com/2021/08/11/open-source/time-appliance/"},
  {"id":"PasqualeEtAl2022","abstract":"The last decade saw a renewed interest on the Moon as a well suited training premise in preparation to manned mission to Mars, but also as an interesting target itself, for scientific investigations, technological developments and new markets opportunities. As a result, numerous and very different missions to the Moon are currently being studied and implemented, assuming to have our satellite quite crowded soon. Such a scenario motivates the settling of space infrastructures to offer recurrent services like data relays, communication links and navigation in the cislunar environment which would facilitate and enlighten the single mission’s implementation and operation. The paper presents the strategy adopted to address the design of the orbital configuration for a distributed architecture to answer the communication and navigation needs to serve at the best the diversified lunar missions scenario expected for the next decades. First, a set of parameters of merit are identified and explained in their mathematical expression and physical meaning. Then, different regions of interest for possible future missions are identified and mapped to the relevant performances wanted for that specific region. Last a Multi-Objective Optimisation framework is presented, both in the exploited genotype and the different objectives participating to the definition of the cost function, in order to provide a versatile tool. The paper critically discusses the effectiveness of the proposed approach in detecting the best suited distributed orbital architectures for the servicers according to the expected service performance in specific user regions, spread all over the Earth–Moon volume — from Earth vicinity to Lunar surface, considering also robustness aspects. The benefits in the exploitation of the multibody dynamical regime offered by the Earth–Moon system to set up the most promising orbital set with a minimum number of servicing spacecraft are underlined as well.","accessed":{"date-parts":[[2023,3,27]]},"author":[{"family":"Pasquale","given":"Andrea"},{"family":"Zanotti","given":"Giovanni"},{"family":"Prinetto","given":"Jacopo"},{"family":"Ceresoli","given":"Michele"},{"family":"Lavagna","given":"Michèle"}],"citation-key":"PasqualeEtAl2022","container-title":"Acta Astronautica","container-title-short":"Acta Astronautica","DOI":"10.1016/j.actaastro.2022.06.004","ISSN":"0094-5765","issued":{"date-parts":[[2022,10,1]]},"language":"en","page":"345-354","source":"ScienceDirect","title":"Cislunar distributed architectures for communication and navigation services of lunar assets","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0094576522002831","volume":"199"},
  {"id":"Petro2020","abstract":"One of the key capabilities needed for performing long-duration missions on the lunar surface is survival, and ultimately operational viability, through the lunar night. The fourteen Earth days of continuous darkness and extreme cold experienced at most locations on the Moon, plus the lack of a moderating atmosphere, presents one of the most demanding environmental challenge that will be faced in the exploration of the solar system. This paper will summarize the results of a NASA-sponsored workshop on this subject that was held in November 2018. The workshop discussions covered the environmental challenges of the lunar night and the implications for the range of science, exploration, and commercial activities planned for the Moon. Previous missions and their experiences with surviving the night are also described. A variety of technology solutions and operational strategies for night survival and operations will be outlined.","author":[{"family":"Petro","given":"Andrew"}],"citation-key":"Petro2020","container-title":"2020 IEEE Aerospace Conference","DOI":"10.1109/AERO47225.2020.9172730","event-title":"2020 IEEE Aerospace Conference","ISSN":"1095-323X","issued":{"date-parts":[[2020,3]]},"page":"1-6","source":"IEEE Xplore","title":"Surviving and Operating Through the Lunar Night","type":"paper-conference"},
  {"id":"Quintero2023","accessed":{"date-parts":[[2023,5,9]]},"author":[{"family":"Quintero","given":"Chuck"}],"citation-key":"Quintero2023","event-place":"LSIC Extreme Access Focus Group Monthly Meeting","issued":{"date-parts":[[2023,4,14]]},"publisher-place":"LSIC Extreme Access Focus Group Monthly Meeting","title":"Conceptual Design for Communications Network for Earth-Lunar Communications","type":"speech","URL":"https://lsic-wiki.jhuapl.edu/display/EA/14+April+2023"},
  {"id":"Rabotin2023","abstract":"Kani is a verification tool that can help you systematically test properties about your Rust code. To learn more about Kani, check out the Kani tutorial and our previous blog posts.","accessed":{"date-parts":[[2023,4,11]]},"author":[{"family":"Rabotin","given":"Christopher"}],"citation-key":"Rabotin2023","container-title":"Kani Rust Verifier Blog","issued":{"date-parts":[[2023,3,31]]},"language":"en","title":"How Kani helped find bugs in Hifitime","type":"post-weblog","URL":"https://model-checking.github.io//kani-verifier-blog/2023/03/31/how-kani-helped-find-bugs-in-hifitime.html"},
  {"id":"RazaEtAl2022","abstract":"The prospect of mankind returning to the Moon has garnered a great amount of attention in recent years. Dozens of lunar missions are planned for the coming decade which will require the development of a sustainable communication infrastructure with high data rates and minimal latency. Space communication systems thus far have relied on Radio Frequency (RF) links alone, but recent developments in laser communications have demonstrated that Free Space Optical (FSO) links can achieve much higher data rates. Upon considering the respective benefits and drawbacks of RF and FSO links, we make a case for the integration of these two technologies into a hybrid RF/FSO lunar communications architecture which leverages small satellites in a Low Earth Orbit (LEO) constellation. We include a case study for this technology designed in Analytical Graphics' Systems Tool Kit (STK) software. Results are presented in terms of chain access duration, propagation delay, transmission loss, Signal-to-Noise Ratio (SNR), and Bit Error Rate (BER). This architecture shows potential to revolutionize extraterrestrial communications and pave the way for highly ambitious future missions in space.","author":[{"family":"Raza","given":"Waseem"},{"family":"Abele","given":"Ethan"},{"family":"O'Hara","given":"John"},{"family":"Sadr","given":"Behnaz"},{"family":"LoPresti","given":"Peter"},{"family":"Imran","given":"Ali"},{"family":"Choi","given":"Wooyeol"},{"family":"Song","given":"Ickhyun"},{"family":"Altunc","given":"Serhat"},{"family":"Kegege","given":"Obadiah"},{"family":"Ekin","given":"Sabit"}],"citation-key":"RazaEtAl2022","container-title":"IEEE Network","DOI":"10.1109/MNET.103.2100419","ISSN":"1558-156X","issue":"6","issued":{"date-parts":[[2022,11]]},"page":"76-83","source":"IEEE Xplore","title":"Toward a Hybrid RF/Optical Lunar Communication System (LunarComm)","type":"article-journal","volume":"36"},
  {"id":"Reinhold1990","abstract":"Confirmation of the presence of water ice crystals at the Lunar polar regions by NASA's Lunar Prospector spacecraft has stimulated interest in colonizing the Lunar poles. While there is some controversy over the feasibility of extracting water from the low concentration of ice observed so far, there are other advantages to the poles as an initial location for a Lunar colony. Here are some ideas I had on that topic in 1990, including the feasibility of erecting a tower at the poles that would receive continuous sunlight. In a separate submission, I also proposed to deliver key light elements, thought then to be absent from lunar soil, at a much lower cost by building supply craft as much as possible out of plastic or wood.\nIn December 1989, the Bush administration directed NASA to set up an Outreach Program to solicit ideas for future space exploration. The papers received were synthesized by a group led by former astronaut Gen. Thomas P. Stafford into a report titled America at the Threshold, Report of the Synthesis Group on America's Space Exploration Initiative. The following papers were submitted to NASA on July 17, 1990 as part of that initiative, and is acknowledged, in fine print, on page A-51 of that report.","author":[{"family":"Reinhold","given":"Arnold"}],"citation-key":"Reinhold1990","issued":{"date-parts":[[1990,7,17]]},"source":"ResearchGate","title":"A Solar Powered Station at a Lunar Pole","type":"book"},
  {"id":"Sanders2010","abstract":"Talented and dedicated engineers spent countless hours designing Japan’s rail system to be one of the world’s most efficient. Could have just asked a slime mold. When presented with oat flakes arranged in the pattern of Japanese cities around Tokyo, brainless, single-celled slime molds construct networks of nutrient-channeling tubes that are strikingly similar to the […]","accessed":{"date-parts":[[2023,8,12]]},"author":[{"family":"Sanders","given":"Laura"}],"citation-key":"Sanders2010","container-title":"Wired","ISSN":"1059-1028","issued":{"date-parts":[[2010,1,22]]},"language":"en-US","section":"tags","source":"www.wired.com","title":"Slime Mold Grows Network Just Like Tokyo Rail System","type":"article-magazine","URL":"https://www.wired.com/2010/01/slime-mold-grows-network-just-like-tokyo-rail-system/"},
  {"id":"Schingler2020","abstract":"Sustained presence in outer space requires a categorical shift in thinking, going beyond “exploration” to think instead about tenure: policies rooted in experience, lessons learned from historic engagements with frontiers, and long term thinking, in order to construct strong foundations and longevity of presence.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Schingler","given":"Jessy Kate"}],"citation-key":"Schingler2020","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2020,10]]},"title":"Space Tenure: The Policies of Sustained Lunar Presence - Open Lunar Foundation","title-short":"Space Tenure","type":"post-weblog","URL":"https://www.openlunar.org/library/space-tenure-the-policies-of-sustained-lunar-presence"},
  {"id":"ShourabouraEtAl","abstract":"NASA’s Deep Space Network (DSN) is a unique facility responsible for communication and navigation support for over forty NASA and international space missions. For many years, demand on the network has been greater than its capacity, and so a collaborative negotiation process has been developed among the network’s users to resolve contention and come to agreement on the schedule. This process has become strained by increasing demand, to the point that oversubscription is routinely as high as 40% over actual capacity. As a result, DSN has started investigating the possibility of moving to some kind of prioritization scheme to allow for more automated and timely resolution of network contention. Other NASA networks have used strict static mission priorities, but if this were applied in the same way to the DSN, some missions would fall out of the schedule altogether. In this paper we report on analysis and experimentation with several approaches to DSN prioritization. Our objectives include preserving as much of each each mission’s requested contact time as possible, while allowing them to identify which of their specific scheduling requests are of greatest importance to them. We have obtained the most promising results with a variant of Squeaky Wheel Optimization combined with limiting each mission’s input based on historical negotiated reduction levels.","author":[{"family":"Shouraboura","given":"Caroline"},{"family":"Johnston","given":"Mark D"},{"family":"Tran","given":"Daniel"}],"citation-key":"ShourabouraEtAl","language":"en","source":"Zotero","title":"Prioritization and Oversubscribed Scheduling for NASA’s Deep Space Network","type":"article-journal"},
  {"id":"VelazcoEtAl","abstract":"JPL is developing a new omnidirectional optical terminal that will provide fast communications and accurate navigation for swarms of spacecraft. The omnidirectional optical communicator/navigator (OOCN) under development presents a truncated icosahedral geometry that contains arrays of miniature laser telescopes and optical detectors. The miniature optical telescopes are located at the center of each OOCN facet and allow for full sky coverage. The optical detectors, symmetrically deployed on each vertex of the OOCN body, have two purposes: to receive fast incoming communications signals and accurately determine the angle of arrival (AOA) of the incoming signal. The continuous AOA tracking performed by the OOCN mechanism makes it ideally suited for swarm navigation as well. In this paper, we provide a general description of the main OOCN features: 1) high data rate communications, 2) full sky coverage, and 3) ability to maintain multiple links simultaneously. The current OOCN prototype operates at a wavelength of 650 nm, and uses low-power single-mode laser diodes and fast silicon photodetectors. We present the latest experimental results of AOA and pointing testing obtained with this prototype in our optical laboratory. Lastly, we present examples of future missions that could be enabled by the OOCN.","author":[{"family":"Velazco","given":"Jose E"},{"family":"Aguilar","given":"Alexa C"},{"family":"Klaib","given":"Andy R"},{"family":"Escobar","given":"Uriel S"},{"family":"Cornish","given":"Sean E"},{"family":"Griffin","given":"Joseph C"}],"citation-key":"VelazcoEtAl","language":"en","source":"Zotero","title":"Development of Omnidirectional Optical Terminals for Swarm Communications and Navigation","type":"article-journal"},
  {"id":"VillelaEtAl2019","abstract":"CubeSats have become an interesting innovation in the space sector. Such platforms are being used for several space applications, such as education, Earth remote sensing, science, and defense. As of May 31st, 2018, 855 CubeSats had been launched. Remote sensing application is the main sector in which CubeSats are being used, corresponding to about 45% of all applications. This fact indicates the commercial potential of such a platform. Fifty eight countries have already been involved with developing CubeSats. The most used CubeSat configuration is 3U (about 64%), followed by 1U (18%), while 6U platforms account for about 4%. In this paper, we present an analysis of the current situation regarding CubeSats worldwide, through the use of a dataset built to encompass information about these satellites. The overall success rate of the CubeSat missions is increasing over time. Moreover, considering CubeSat missions as a Bernoulli experiment, and excluding launch failures, the current success rate was estimated, as a parameter of a binomial distribution, to be about 75%. By using a logistic model and considering that the launchings keep following the current tendency, one can expect that one thousand CubeSats will be launched in 2021, within 95% certainty.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Villela","given":"Thyrso"},{"family":"Costa","given":"Cesar A."},{"family":"Brandão","given":"Alessandra M."},{"family":"Bueno","given":"Fernando T."},{"family":"Leonardi","given":"Rodrigo"}],"citation-key":"VillelaEtAl2019","container-title":"International Journal of Aerospace Engineering","container-title-short":"International Journal of Aerospace Engineering","DOI":"10.1155/2019/5063145","ISSN":"1687-5966, 1687-5974","issued":{"date-parts":[[2019,1,10]]},"language":"en","page":"1-13","source":"DOI.org (Crossref)","title":"Towards the Thousandth CubeSat: A Statistical Overview","title-short":"Towards the Thousandth CubeSat","type":"article-journal","URL":"https://www.hindawi.com/journals/ijae/2019/5063145/","volume":"2019"},
  {"id":"WuEtAl2017","abstract":"Chang’E-IV will be the first soft-landing and rover mission on the lunar farside. The relay satellite, which is located near the Earth-Moon L2 point for relay communication, is the key to the landing mission. Based on an analysis of the characteristics of the task and the technical difficulties associated with the relay satellite system, the overall design scheme of the relay communication mission is proposed in terms of trajectory design and communication system design among other aspects. First, according to the complex dynamic environment, a mission orbit that serves as an uninterrupted communication link is presented. A short-duration and low-energy transfer trajectory with lunar flyby is discussed. Orbital correction and a low-cost control strategy for orbit maintenance in the Earth-Moon L2 point region are provided. Second, considering the existing technical constraints, the requirement of relay communication in different stages and the design schemes of frequency division and redundant relay communication system are introduced. Finally, based on the trajectory design index and the performance of the communication system, the overall design scheme of the relay communication mission is proposed. This mission will provide the technical support and reference required for the Chang’E-IV mission.","accessed":{"date-parts":[[2023,3,27]]},"author":[{"family":"Wu","given":"Weiren"},{"family":"Tang","given":"Yuhua"},{"family":"Zhang","given":"Lihua"},{"family":"Qiao","given":"Dong"}],"citation-key":"WuEtAl2017","container-title":"Science China Information Sciences","container-title-short":"Sci. China Inf. Sci.","DOI":"10.1007/s11432-017-9202-1","ISSN":"1869-1919","issue":"4","issued":{"date-parts":[[2017,12,12]]},"language":"en","page":"040305","source":"Springer Link","title":"Design of communication relay mission for supporting lunar-farside soft landing","type":"article-journal","URL":"https://doi.org/10.1007/s11432-017-9202-1","volume":"61"},
  {"id":"zotero-334","abstract":"Humanity’s relentless endeavor to push the boundaries of space exploration is well-documented. From manned missions to probes speeding their way to the farthest corners of the solar system and beyond, the thirst to discover the secrets of the Universe has never been so resolutely demonstrated as it is now.","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-334","container-title":"Nokia","language":"en","title":"Nokia aims for the Moon with LTE/4G","type":"webpage","URL":"https://www.nokia.com/about-us/newsroom/articles/nokia-aims-for-the-moon-with-lte4g/"},
  {"id":"zotero-336","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-336","title":"Radio's First Message -- Fessenden and Marconi","type":"webpage","URL":"https://ewh.ieee.org/reg/7/millennium/radio/radio_differences.html"},
  {"id":"zotero-346","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-346","container-title":"DTN7","language":"en-US","title":"DTN7","type":"webpage","URL":"https://dtn7.github.io/"},
  {"id":"zotero-350","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-350","title":"dtn7/awesome-dtn: A curated list of awesome delay- and disruption-tolerant networking","type":"webpage","URL":"https://github.com/dtn7/awesome-dtn"},
  {"id":"zotero-361","abstract":"NASA’s RPS program enables more capable future space missions by supporting the development of advanced technologies for power conversion nuclear power technologies.","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-361","container-title":"NASA RPS: Radioisotope Power Systems","language":"en","title":"Light-Weight Radioisotope Heater Unit | Thermal Systems","type":"webpage","URL":"https://rps.nasa.gov/power-and-thermal-systems/thermal-systems/light-weight-radioisotope-heater-unit"}
]
