[
  {"id":"2010","abstract":"What time is it","accessed":{"date-parts":[[2023,2,20]]},"citation-key":"2010","container-title":"NIST","issued":{"date-parts":[[2010,2,3]]},"language":"en","note":"Last Modified: 2022-11-08T15:38-05:00","source":"www.nist.gov","title":"NIST Time Frequently Asked Questions (FAQ)","type":"article-journal","URL":"https://www.nist.gov/pml/time-and-frequency-division/nist-time-frequently-asked-questions-faq"},
  {"id":"2019","abstract":"Chris Devonshire-Ellis discusses China's ambitions to create the first Earth-Moon economic zone by 2050 and its implications for other space faring countries.","accessed":{"date-parts":[[2023,2,12]]},"citation-key":"2019","container-title":"China Briefing","issued":{"date-parts":[[2019,11,8]]},"language":"en","title":"China Proposes Establishing Moon-Based Special Economic Zone","type":"post-weblog","URL":"https://www.china-briefing.com/news/china-proposes-establishing-moon-based-special-economic-zone/"},
  {"id":"2021","abstract":"NTP server misuse and abuse covers a number of practices which cause damage or degradation to a Network Time Protocol (NTP) server, ranging from flooding it with traffic (effectively a DDoS attack) or violating the server's access policy or the NTP rules of engagement. One incident was branded NTP vandalism in an open letter from Poul-Henning Kamp to the router manufacturer D-Link in 2006. This term has later been extended by others to retroactively include other incidents. There is, however, no evidence that any of these problems are deliberate vandalism. They are more usually caused by shortsighted or poorly chosen default configurations.\nA deliberate form of NTP server abuse came to note at the end of 2013, when NTP servers were used as part of amplification denial-of-service attacks. Some NTP servers would respond to a single \"monlist\" UDP request packet, with packets describing up to 600 associations. By using a  request with a spoofed IP address attackers could direct an amplified stream of packets at a network. This resulted in one of the largest distributed denial-of-service attacks known at the time.","accessed":{"date-parts":[[2023,2,19]]},"citation-key":"2021","container-title":"Wikipedia","issued":{"date-parts":[[2021,12,20]]},"language":"en","license":"Creative Commons Attribution-ShareAlike License","note":"Page Version ID: 1061191609","source":"Wikipedia","title":"NTP server misuse and abuse","type":"entry-encyclopedia","URL":"https://en.wikipedia.org/w/index.php?title=NTP_server_misuse_and_abuse&oldid=1061191609"},
  {"id":"Agrawal","abstract":"The Celestial Mapping System (CMS) is a software platform to generate virtual 3D globes for celestial bodies within our solar system. Various layers are built on top of the virtal globe to provide visualization of high resolution imagery, enable precise measurements, build analytical capabilities and a broad range of functionalities to assist planetary scientists and mission planners.","accessed":{"date-parts":[[2023,8,12]]},"author":[{"family":"Agrawal","given":"Parul"}],"citation-key":"Agrawal","contributor":[{"family":"Peterson","given":"Mark"},{"family":"Del Castillo","given":"Miguel"}],"event-place":"Mountain View, CA","publisher":"NASA Ames Research Center","publisher-place":"Mountain View, CA","title":"The Celestial Mapping System","type":"software","URL":"https://celestial.arc.nasa.gov/"},
  {"id":"Al-EkabiRobinson2021","abstract":"This paper serves as a background summary of recent lunar exploration activity in the context of relevant stakeholder interests.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Al-Ekabi","given":"Cenan"},{"family":"Robinson","given":"Chelsea"}],"citation-key":"Al-EkabiRobinson2021","issued":{"date-parts":[[2021,5,19]]},"publisher":"Open Lunar Foundation","title":"Recent Lunar Activity, Stakeholders and Incentives – A Backgrounder","type":"report","URL":"https://www.openlunar.org/library/recent-lunar-activity-stakeholders-and-incentives-a-backgrounder"},
  {"id":"Allen2013","abstract":"Systems and methods are described for coordinating clocks in a distributed computing environment. In one embodiment, a plurality of groups of nodes are formed. Nodes within a group may be time-synchronized and time differences between groups may be tracked. Clock adjustments between groups may be accumulated for tracked activities. The accumulated clock adjustments may be used to determine an ordering of the tracked activities.","author":[{"family":"Allen","given":"Nicholas Alexander"}],"citation-key":"Allen2013","issued":{"date-parts":[[2013,5,2]]},"note":"MAG ID: 2412241241","title":"Distributed clock network with time synchronization and activity tracing between nodes","type":"article-journal"},
  {"id":"Anderson2009","abstract":"A system and method for measuring clock skew in a network is disclosed. The method comprises sending an echo message at a periodic rate from a plurality of servers in the network to an anchor server. A reply message can be sent from the anchor server to each server that includes a remote timestamp based on the anchor server clock. The remote timestamp can be recorded at each of the servers. A send timestamp that designates a time the echo message was sent and a receive timestamp that designates a time the reply message was received at the server can then be recorded. An estimated clock time of each server may also be calculated relative to the anchor server using the send and receive timestamps. A clock skew value can be determined by subtracting the estimated clock time of each server from the remote timestamp time. Interpolation can then performed between the clock skew values over a selected portion of the period of time to enable clock skew values to be estimated over the selected portion of time.","author":[{"family":"Anderson","given":"Eric"}],"citation-key":"Anderson2009","issued":{"date-parts":[[2009,1,22]]},"note":"MAG ID: 2260007376","title":"System and method for measuring clock skew on a network","type":"article-journal"},
  {"id":"AnzaloneChuang2012","accessed":{"date-parts":[[2023,5,6]]},"author":[{"family":"Anzalone","given":"Evan"},{"family":"Chuang","given":"Jason"}],"citation-key":"AnzaloneChuang2012","container-title":"AIAA SPACE 2012 Conference & Exposition","DOI":"10.2514/6.2012-5186","event-place":"Pasadena, California","event-title":"AIAA SPACE 2012 Conference & Exposition","ISBN":"978-1-60086-940-2","issued":{"date-parts":[[2012,9,11]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Pasadena, California","source":"DOI.org (Crossref)","title":"Conceptual Design of a Communication-based Deep Space Navigation Network","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2012-5186"},
  {"id":"ApollonioEtAl2013","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Apollonio","given":"Pietrofrancesco"},{"family":"Caini","given":"Carlo"},{"family":"Fiore","given":"Vincenzo"}],"citation-key":"ApollonioEtAl2013","container-title":"China Communications","container-title-short":"China Commun.","DOI":"10.1109/CC.2013.6650316","ISSN":"1673-5447","issue":"10","issued":{"date-parts":[[2013,10]]},"page":"12-25","source":"DOI.org (Crossref)","title":"From the far side of the Moon: Delay/disruption-tolerant networking communications via lunar satellites","title-short":"From the far side of the Moon","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/6650316/","volume":"10"},
  {"id":"Araki2021","abstract":"A new era of manned lunar exploration is dawning. Optical communication technology is expected to become indispensable for high-speed data transmission from lunar explorers to the Earth. This paper describes the expectations for contents from the Moon and the estimated amount of information. Then, two types of Lunar-Earth optical communication systems are discussed, including a comparison between direct communication with an optical ground station (OGS) and communication through a data relay satellite in geostationary orbit (GEO) around the Earth.","accessed":{"date-parts":[[2023,3,27]]},"author":[{"family":"Araki","given":"Tomohiro"}],"citation-key":"Araki2021","container-title":"International Conference on Space Optics — ICSO 2020","DOI":"10.1117/12.2599331","event-title":"International Conference on Space Optics — ICSO 2020","issued":{"date-parts":[[2021,6,11]]},"page":"811-819","publisher":"SPIE","source":"www.spiedigitallibrary.org","title":"A trade-off study of lunar-earth optical communication links","type":"paper-conference","URL":"https://www.spiedigitallibrary.org/conference-proceedings-of-spie/11852/118521X/A-trade-off-study-of-lunar-earth-optical-communication-links/10.1117/12.2599331.full","volume":"11852"},
  {"id":"BaldoniEtAl2010","abstract":"This paper studies the problem of realizing a common software clock among a large set of nodes without an external time reference (i.e., internal clock synchronization), any centralized control, and where nodes can join and leave the distributed system at their will. The paper proposes an internal clock synchronization algorithm which combines the gossip-based paradigm with a nature-inspired approach, coming from the coupled oscillators phenomenon, to cope with scale and churn. The algorithm works on the top of an overlay network and uses a uniform peer sampling service to fulfill each node's local view. Therefore, differently from clock synchronization protocols for small scale and static distributed systems, here, each node synchronizes regularly with only the neighbors in its local view and not with the whole system. An evaluation of the convergence speed and the synchronization error of the coupled-based internal clock synchronization algorithm has been carried out, showing how convergence time and the synchronization error depends on the coupling factor and the local view size. Moreover, the variation of the synchronization error with respect to churn and the impact of a sudden variation of the number of nodes have been analyzed to show the stability of the algorithm. In all these contexts, the algorithm shows nice performance and very good self-organizing properties. Finally, we showed how the assumption on the existence of a uniform peer-sampling service is instrumental for the good behavior of the algorithm and how, in system models where network delays are unbounded, a mean-based convergence function reaches a lower synchronization error than median-based convergence functions exploiting the number of averaged clock values.","author":[{"family":"Baldoni","given":"Roberto"},{"family":"Corsaro","given":"Angelo"},{"family":"Querzoni","given":"Leonardo"},{"family":"Scipioni","given":"Sirio"},{"family":"Tucci Piergiovanni","given":"Sara"}],"citation-key":"BaldoniEtAl2010","container-title":"IEEE Transactions on Parallel and Distributed Systems","DOI":"10.1109/TPDS.2009.111","ISSN":"1558-2183","issue":"5","issued":{"date-parts":[[2010,5]]},"page":"607-619","source":"IEEE Xplore","title":"Coupling-Based Internal Clock Synchronization for Large-Scale Dynamic Distributed Systems","type":"article-journal","volume":"21"},
  {"id":"BandiEtAl2022","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Bandi","given":"Thejesh N."},{"literal":"the clock team"},{"family":"Desai","given":"N. M."},{"family":"Kaintura","given":"J."},{"family":"Attri","given":"D."},{"family":"Saiyed","given":"M. A."},{"family":"Sharma-Kesarkar","given":"R."},{"family":"Sinha","given":"P."},{"family":"Ghoshal","given":"B."},{"family":"Mandal","given":"S."},{"family":"Ghosh","given":"B."},{"family":"Jain","given":"P."},{"family":"Priya","given":"P."},{"family":"Shukla","given":"K."},{"family":"Soni","given":"A."},{"family":"Somani","given":"S."},{"family":"Patel","given":"A."},{"family":"Kuchana","given":"R."},{"family":"Karthik","given":"K."},{"family":"Rao","given":"C. V. N."},{"family":"Ram","given":"T. V. S."},{"family":"Parikh","given":"K. S."}],"citation-key":"BandiEtAl2022","container-title":"GPS Solutions","container-title-short":"GPS Solut","DOI":"10.1007/s10291-022-01239-x","ISSN":"1080-5370, 1521-1886","issue":"2","issued":{"date-parts":[[2022,4]]},"language":"en","page":"54","source":"DOI.org (Crossref)","title":"Advanced space rubidium atomic frequency standard for satellite navigation","type":"article-journal","URL":"https://link.springer.com/10.1007/s10291-022-01239-x","volume":"26"},
  {"id":"Bender2023","abstract":"In an interview with POLITICO, Bill Nelson expressed confidence the U.S. can win the moon race. But he warned there is little time to lose.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Bender","given":"Bryan"}],"citation-key":"Bender2023","container-title":"POLITICO","issued":{"date-parts":[[2023,1,1]]},"language":"en","title":"‘We better watch out’: NASA boss sounds alarm on Chinese moon ambitions","title-short":"‘We better watch out’","type":"webpage","URL":"https://www.politico.com/news/2023/01/01/we-better-watch-out-nasa-boss-sounds-alarm-on-chinese-moon-ambitions-00075803"},
  {"id":"Berthaud2000","abstract":"This paper presents a general time synchronization algorithm that analyzes the time offset between any two computers clocks in a network and its evolution, by using mathematical topology properties. It builds a conversion function that produces precise and guaranteed bounds for each time conversion, and which provides accurate time synchronization. It is able to automatically adjust the observation process so as to maintain the error bound within some specified limit. It does not require adjustments to local clocks, and it features a way of filtering observation data based on a criterion of usefulness to improve precision, thus discarding only useless information. Advantages over approaches using other tools to filter out and analyze observation data (mean and variance, linear regression, midpoint functions, etc.) are exposed. Special attention is given to assessing the uncertainties and errors made in the observation process, and to their propagation in the estimation processes. The developed technique allows one to globally achieve a better precision than what has been reached on each single observation, given some conditions of operation that are explained.","author":[{"family":"Berthaud","given":"Jean-Marc"}],"citation-key":"Berthaud2000","container-title":"IEEE ACM Transactions on Networking","DOI":"10.1109/90.842147","issue":"2","issued":{"date-parts":[[2000,4,1]]},"note":"MAG ID: 2142546333","page":"265-277","title":"Time synchronization over networks using convex closures","type":"article-journal","volume":"8"},
  {"id":"BhamidipatiEtAl2021","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Bhamidipati","given":"Sriramya"},{"family":"Mina","given":"Tara"},{"family":"Gao","given":"Grace"}],"citation-key":"BhamidipatiEtAl2021","DOI":"10.33012/2021.18021","event-place":"St. Louis, Missouri","event-title":"34th International Technical Meeting of the Satellite Division of The Institute of Navigation (ION GNSS+ 2021)","issued":{"date-parts":[[2021,10,13]]},"page":"950-965","publisher-place":"St. Louis, Missouri","source":"DOI.org (Crossref)","title":"Design Considerations of a Lunar Navigation Satellite System with Time-Transfer from Earth-GPS","type":"paper-conference","URL":"https://www.ion.org/publications/abstract.cfm?articleID=18021"},
  {"id":"BhamidipatiEtAl2022","abstract":"Reliable lunar communication infrastructure will be instrumental in building a sustainable human presence on the Moon. Recently, NASA has awarded a $14.1 million contract to Nokia for developing a 4G Long-Term Evolution (LTE) network on the Moon. In particular, there has been a great emphasis on designing a low-power and an ultra-compact LTE solution for the future Lunar Surface Communication Network (LSCN) due to its ease of transportation and potential for scalable deployment on the lunar surface. Ensuring a reliable LSCN design requires the base stations to be time-synchronized, and to maintain a precise globally referenced timing standard. We propose an LSCN design with distributed time-transfer from Earth-GPS to maintain precise timing across the network. We design a diffusion Kalman filter framework that utilizes the intermittently available Earth-GPS signals and the crosslink signals exchanged among the LSCN base stations to facilitate global time synchronization, while alleviating the timing stability and SWaP requirements for the on-site clocks. We validate our proposed technique by simulating the Earth-GPS satellites and multiple base stations near the Moon's Haworth Crater using the Systems Tool Kit (STK) software. We simulate the visibility and carrier-to-noise-density ratio of the Earth-GPS satellites at each LSCN base station, while examining the timing accuracy performance when each base station is equipped with a low-SWaP Chip Scale Atomic Clock (CSAC). We demonstrate the robustness of our distributed time-transfer technique as the error covariance of the transmission delay is varied.","author":[{"family":"Bhamidipati","given":"Sriramya"},{"family":"Iiyama","given":"Keidai"},{"family":"Mina","given":"Tara"},{"family":"Gao","given":"Grace"}],"citation-key":"BhamidipatiEtAl2022","container-title":"2022 IEEE Aerospace Conference (AERO)","DOI":"10.1109/AERO53065.2022.9843716","event-title":"2022 IEEE Aerospace Conference (AERO)","ISSN":"1095-323X","issued":{"date-parts":[[2022,3]]},"page":"1-15","source":"IEEE Xplore","title":"Time-Transfer from Terrestrial GPS for Distributed Lunar Surface Communication Networks","type":"paper-conference"},
  {"id":"BirraneMcKeever2022","abstract":"This document defines a security protocol providing data integrity and confidentiality services for the Bundle Protocol (BP).","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Birrane","given":"Edward J."},{"family":"McKeever","given":"Kenneth"}],"citation-key":"BirraneMcKeever2022","DOI":"10.17487/RFC9172","genre":"Request for Comments","issued":{"date-parts":[[2022,1]]},"number":"RFC 9172","number-of-pages":"35","publisher":"Internet Engineering Task Force","source":"IETF","title":"Bundle Protocol Security (BPSec)","type":"report","URL":"https://datatracker.ietf.org/doc/rfc9172"},
  {"id":"BiswasEtAl2021","abstract":"In the coming decade, a multitude of small, carry-on payloads in the form of miniature rovers, scientific instruments and surface deployed stand-alone systems will provide many new and exciting possibilities for lunar exploration. For these system, the survival of and operation in the extreme cold of the lunar night will be the biggest challenge, as most will be purely battery driven and unable to rely on radioisotope heaters. Maximizing battery lifetime in these conditions requires a trade-off between energy density, low-temperature performance and insulation, but comparable temperature and current dependent discharge capacities of batteries and other energy storage devices are often not reported in datasheets or literature. For this reason, a selection of energy storage devices was chosen and tested to determine their low-temperature performance in a representative environment. Based on this data, the theoretical lifetime per battery weight and optimal operational temperature for varying degrees of insulation was determined. It was shown that the selection of the optimal energy storage device and operational temperature depends on the insulation, emphasizing the need for multi-disciplinary design optimization.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Biswas","given":"János"},{"family":"Malzone","given":"Pietro Queiroga"},{"family":"Rößler","given":"Felix"}],"citation-key":"BiswasEtAl2021","container-title":"Acta Astronautica","container-title-short":"Acta Astronautica","DOI":"10.1016/j.actaastro.2021.04.042","ISSN":"0094-5765","issued":{"date-parts":[[2021,8,1]]},"language":"en","page":"308-318","source":"ScienceDirect","title":"Energy storage selection and operation for night-time survival of small lunar surface systems","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0094576521002101","volume":"185"},
  {"id":"BlochEtAl2008","abstract":"An indispensable component of any space vehicle is the onboard master oscillator. The proper operation of the entire payload is dependent on the performance of the master oscillator or the onboard clock. Frequency Electronics, Inc. (FEI) has been a key supplier of highreliability oscillators for space applications since 1963, and in this paper we will present a short history of oscillators for space applications that include quartz-based oscillators, rubidiumbased oscillators, and integrated timing/frequency generating systems. We will also present achieved performance of key parameters such as aging, short-term stability, and low power consumption. Design considerations to mitigate the effects of natural radiation in the space environment will be discussed as well as strategies to minimize frequency drift to assure mission lifetimes of 20 years or more. Furthermore, to predict long-term frequency accuracy we will present data of unpowered oscillators that were manufactured between 1968 and 1985 for longterm space missions that have been recently powered-on and tested. The presented data will provide empirical evidence that may be used to estimate the performance of quartz-based and rubidium-based oscillators in space.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Bloch","given":"M."},{"family":"Mancini","given":"O."},{"family":"McClelland","given":"T."}],"citation-key":"BlochEtAl2008","event-title":"Proceedings of the 40th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2008,12,4]]},"language":"en","page":"29-50","source":"www.ion.org","title":"History and Performance of FEI Space-Class Oscillators","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=10620"},
  {"id":"Blumberg2018","abstract":"In deep space, accurate timekeeping is vital to navigation, but not all spacecraft have precise timepieces onboard.","accessed":{"date-parts":[[2023,4,27]]},"author":[{"family":"Blumberg","given":"Sara"}],"citation-key":"Blumberg2018","container-title":"NASA","genre":"Text","issued":{"date-parts":[[2018,2,6]]},"language":"und","title":"NASA Tests Atomic Clock for Deep Space Navigation","type":"webpage","URL":"http://www.nasa.gov/feature/goddard/2018/nasa-tests-atomic-clock-for-deep-space-navigation"},
  {"id":"Borrell2021","abstract":"In debates on EU foreign policy, key concepts that people often refer to are multilateralism and multipolarity. When I met recently with the Inter-Parliamentary Conference this was again the case. It struck me that it might be good to specify how I see these concepts and how they relate to each other","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Borrell","given":"Josep"}],"citation-key":"Borrell2021","container-title":"Eurapean Union External Action (EEAS) Website","issued":{"date-parts":[[2021,3,16]]},"title":"How to revive multilateralism in a multipolar world?","type":"webpage","URL":"https://www.eeas.europa.eu/eeas/how-revive-multilateralism-multipolar-world_en"},
  {"id":"Bowen2020","abstract":"War in Space presents a theory of spacepower and considers the implications of space technology on strategy and international relations. The spectre of space warfare stalks the major powers as outer space increasingly defines geopolitical and military competition. As satellites have become essential for modern warfare, strategists are asking whether the next major war will begin or be decided in outer space. Only strategic theory can explore the decisiveness and effects of war in space on grand strategy and international relations. Bleddyn E. Bowen applies the wisdom of military strategy to outer space and presents a compelling new vision of Earth's orbit as a coastline, rather than an open ocean or an extension of airspace as many have assumed. Rooted in the classical military works of Clausewitz, Mahan and Castex, to name a few, Bowen puts forward new principles for strategic thought about space that explain the pervasive and inescapable influence of spacepower on strategy and the changing military balance of the 21st century","author":[{"family":"Bowen","given":"Bleddyn E."}],"citation-key":"Bowen2020","event-place":"Edinburgh","ISBN":"978-1-4744-5048-5","issued":{"date-parts":[[2020]]},"language":"eng","number-of-pages":"316","publisher":"Edinburgh University Press","publisher-place":"Edinburgh","source":"K10plus ISBN","title":"War in space: strategy, spacepower, geopolitics","title-short":"War in space","type":"book"},
  {"id":"BritishLibrary1926","archive_location":"IOR/L/E/8/585","author":[{"literal":"British Library"}],"citation-key":"BritishLibrary1926","event-place":"London","issued":{"date-parts":[[1926]]},"publisher":"British Library","publisher-place":"London","title":"Memorandum prepared for the Imperial Conference 1926","type":"report"},
  {"id":"BrockmannStrogatz2018","abstract":"Synchronization of Phase-Coupled Oscillators","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Brockmann","given":"Dirk"},{"family":"Strogatz","given":"Steven"}],"citation-key":"BrockmannStrogatz2018","container-title":"Complexity Explorables","issued":{"date-parts":[[2018,4,14]]},"language":"en-us","section":"explorables","title":"Ride my Kuramotocycle!","type":"webpage","URL":"https://www.complexity-explorables.org/explorables/ride-my-kuramotocycle/"},
  {"id":"Brown2020","abstract":"NASA has selected 14 American companies, including several small businesses, as partners to develop a range of technologies that will help forge a path to sustainable Artemis operations on the Moon by the end of the decade.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Brown","given":"Katherine"}],"citation-key":"Brown2020","container-title":"NASA","genre":"Text","issued":{"date-parts":[[2020,10,14]]},"language":"und","title":"NASA Announces Partners to Advance 2020 ‘Tipping Point’ Technologies","type":"webpage","URL":"http://www.nasa.gov/press-release/nasa-announces-partners-to-advance-tipping-point-technologies-for-the-moon-mars"},
  {"id":"Bujanos1998","author":[{"family":"Bujanos","given":"Norman"}],"citation-key":"Bujanos1998","container-title":"Circuit Cellar INK","issue":"91","issued":{"date-parts":[[1998]]},"language":"en","source":"Zotero","title":"Choosing the Right Crystal for Your Oscillator","type":"article-journal","URL":"http://courses.nus.edu.sg/course/eleclf/mch5104/choose_right_crystal.pdf"},
  {"id":"Burghardt1973","accessed":{"date-parts":[[2023,2,7]]},"author":[{"family":"Burghardt","given":"Andrew F."}],"citation-key":"Burghardt1973","container-title":"Geographical Review","container-title-short":"Geographical Review","DOI":"10.2307/213412","ISSN":"00167428","issue":"2","issued":{"date-parts":[[1973,4]]},"page":"225","source":"DOI.org (Crossref)","title":"The Bases of Territorial Claims","type":"article-journal","URL":"https://www.jstor.org/stable/213412?origin=crossref","volume":"63"},
  {"id":"BurleighEtAl2022","abstract":"This document presents a specification for the Bundle Protocol, adapted from the experimental Bundle Protocol specification developed by the Delay-Tolerant Networking Research Group of the Internet Research Task Force and documented in RFC 5050.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Burleigh","given":"Scott"},{"family":"Fall","given":"Kevin"},{"family":"Birrane","given":"Edward J."}],"citation-key":"BurleighEtAl2022","DOI":"10.17487/RFC9171","genre":"Request for Comments","issued":{"date-parts":[[2022,1]]},"number":"RFC 9171","number-of-pages":"53","publisher":"Internet Engineering Task Force","source":"IETF","title":"Bundle Protocol Version 7","type":"report","URL":"https://datatracker.ietf.org/doc/rfc9171"},
  {"id":"BurtEtAl2021","accessed":{"date-parts":[[2022,12,27]]},"author":[{"family":"Burt","given":"E. A."},{"family":"Prestage","given":"J. D."},{"family":"Tjoelker","given":"R. L."},{"family":"Enzer","given":"D. G."},{"family":"Kuang","given":"D."},{"family":"Murphy","given":"D. W."},{"family":"Robison","given":"D. E."},{"family":"Seubert","given":"J. M."},{"family":"Wang","given":"R. T."},{"family":"Ely","given":"T. A."}],"citation-key":"BurtEtAl2021","container-title":"Nature","container-title-short":"Nature","DOI":"10.1038/s41586-021-03571-7","ISSN":"0028-0836, 1476-4687","issue":"7865","issued":{"date-parts":[[2021,7,1]]},"language":"en","page":"43-47","source":"DOI.org (Crossref)","title":"Demonstration of a trapped-ion atomic clock in space","type":"article-journal","URL":"http://www.nature.com/articles/s41586-021-03571-7","volume":"595"},
  {"id":"Byagowi","author":[{"family":"Byagowi","given":"Ahmad"}],"citation-key":"Byagowi","language":"en","source":"Zotero","title":"Open Time Server and Time Card 2","type":"article-journal"},
  {"id":"Byagowi2022","abstract":"The journey to Precision Time Protocol (PTP) has been a long one. We're sharing a deep technical dive into our PTP migration","accessed":{"date-parts":[[2023,7,12]]},"author":[{"family":"Byagowi","given":"Oleg Obleukhov","suffix":"Ahmad"}],"citation-key":"Byagowi2022","container-title":"Engineering at Meta","issued":{"date-parts":[[2022,11,21]]},"language":"en-US","title":"How Precision Time Protocol is being deployed at Meta","type":"post-weblog","URL":"https://engineering.fb.com/2022/11/21/production-engineering/precision-time-protocol-at-meta/"},
  {"id":"Byagowi2022a","accessed":{"date-parts":[[2023,5,6]]},"author":[{"family":"Byagowi","given":"Ahmad"}],"authority":"IEEE Standards Association","citation-key":"Byagowi2022a","issued":{"date-parts":[[2022,12,3]]},"language":"en","number":"P3335","section":"IM/ST - TC9 - Sensor Technology","status":"Active PAR","title":"Standard for Architecture and Interfaces for Time Card","type":"standard","URL":"https://standards.ieee.org"},
  {"id":"ByagowiEtAl2022","abstract":"The Open Time Server has been originally conceived as a reference design by the OCP-TAP (Open-Compute-Project Time Appliance Project). It intends to provide the time synchronization service to data centers, by supporting, among others, the under-development DC PTP profile, GNSS reception, enhanced holdover capabilities, etc.Time Card is an open-source Peripheral Component Interconnect express (PCIe) card that provides time accuracy for the open time server. The Open Time Server is based on the Time Card and consists of open-source software (drivers and protocol stacks) as well as other necessary peripherals like Network Interface Controller (NIC). The entire design is open-source and available for the public. Therefore, it offers unparalleled opportunities for adapting and extending the design in a cost-effective manner. This publication explores some of the capabilities and advantages of the Time Card and the Open Time Server and concludes with the future work and the vision of the project.","author":[{"family":"Byagowi","given":"Ahmad"},{"family":"Meier","given":"Sven"},{"family":"Schaub","given":"Thomas"},{"family":"Sotiropoulos","given":"Ioannis"}],"citation-key":"ByagowiEtAl2022","container-title":"2022 IEEE International Symposium on Precision Clock Synchronization for Measurement, Control, and Communication (ISPCS)","DOI":"10.1109/ISPCS55791.2022.9918379","event-title":"2022 IEEE International Symposium on Precision Clock Synchronization for Measurement, Control, and Communication (ISPCS)","ISSN":"1949-0313","issued":{"date-parts":[[2022,10]]},"page":"1-6","source":"IEEE Xplore","title":"Time Card and Open Time Server","type":"paper-conference"},
  {"id":"ByagowiObleukhov2022","abstract":"Here’s why engineers at Meta are supporting a larger community push to stop introducing any new leap seconds.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Byagowi","given":"Ahmad"},{"family":"Obleukhov","given":"Oleg"}],"citation-key":"ByagowiObleukhov2022","container-title":"Engineering at Meta","issued":{"date-parts":[[2022,7,25]]},"language":"en-US","title":"It’s time to leave the leap second in the past","type":"post-weblog","URL":"https://engineering.fb.com/2022/07/25/production-engineering/its-time-to-leave-the-leap-second-in-the-past/"},
  {"id":"CainiFiore2012","abstract":"Although Delay-/Disruption- Tolerant Networking, which originated from research on an Interplanetary Internet, has enlarged its scope to encompass all challenged networks, space applications are still one of its most important application fields. This paper deals with DTN communication from Moon to Earth, based on the use of a lunar satellite acting as a “data-mule” to collect data from a Lander located on the far side of the Moon. To make the scenario more interesting and complex from the point of view of possible security threats, we assume that data must be transferred to a non-institutional user connected to the Space Agency Control Centre via Internet. In particular, the paper investigates the state-of-the-art ability of ION, the NASA implementation of the DTN Bundle Protocol (BP), to cope with the many challenges of the space scenario under investigation, such as intermittent links, low bandwidth, relatively high delays, network partitioning, DTN routing, interoperability between LTP and TCP BP Convergence layers and security threats. To this end, the first part of the paper contains three brief overviews of the DTN architecture, the Bundle Security Protocol and the ION implementation. These facilitate comprehension of the following sections, dedicated to a detailed description of the experiment scenario and, most essentially, to the in depth discussion of the numerical results obtained with the latest ION version (3.0).","author":[{"family":"Caini","given":"Carlo"},{"family":"Fiore","given":"Vincenzo"}],"citation-key":"CainiFiore2012","container-title":"2012 6th Advanced Satellite Multimedia Systems Conference (ASMS) and 12th Signal Processing for Space Communications Workshop (SPSC)","DOI":"10.1109/ASMS-SPSC.2012.6333112","event-title":"2012 6th Advanced Satellite Multimedia Systems Conference (ASMS) and 12th Signal Processing for Space Communications Workshop (SPSC)","ISSN":"2326-5949","issued":{"date-parts":[[2012,9]]},"page":"89-95","source":"IEEE Xplore","title":"Moon to earth DTN communications through lunar relay satellites","type":"paper-conference"},
  {"id":"Carbone2022","abstract":"NASA has called on China to be 'open and transparent' with its lunar missions following a revelation of overlap between the two nations in potential landing sites near the moon's south pole.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Carbone","given":"Christopher"}],"citation-key":"Carbone2022","container-title":"Daily Mail Online","issued":{"date-parts":[[2022,9,7]]},"section":"Science","title":"NASA calls on China to be 'open and transparent' with lunar missions","type":"webpage","URL":"https://www.dailymail.co.uk/sciencetech/article-11189291/NASA-tells-China-open-transparent-OVERLAP-lunar-landing-sites-revealed.html"},
  {"id":"CarliZampieri2010","abstract":"In this paper a distributed algorithm for clock synchronization is proposed. This algorithm is based on an extension of the consensus algorithm able to synchronize a family of double integrators. Since the various clocks may have different drifts, the algorithm needs to be designed so that it can work also in case of heterogeneous double integrators. Through a robust control analysis it is possible to determine the maximum admissible level of heterogeneity yielding synchronization. The first part of the paper is devoted to the analysis of an unrealistic synchronous implementation of the algorithm. However, in the last part of the paper we propose a realistic pseudo-synchronous implementation which is proved to be a perturbation of the synchronous one. From arguments related the center manifold theorem, the stability of the pseudo-synchronous is finally proved.","author":[{"family":"Carli","given":"Ruggero"},{"family":"Zampieri","given":"Sandro"}],"citation-key":"CarliZampieri2010","DOI":"10.1109/cdc.2010.5717128","issued":{"date-parts":[[2010,12,1]]},"note":"MAG ID: 2146108350","page":"7259-7264","title":"Networked clock synchronization based on second order linear consensus algorithms","type":"article-journal"},
  {"id":"CarruthEtAl2010","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Carruth","given":"Butch"},{"family":"Johnston","given":"Mark"},{"family":"Coffman","given":"Adam"},{"family":"Wallace","given":"Mike"},{"family":"Arroyo","given":"Belinda"},{"family":"Malhotra","given":"Shan"}],"citation-key":"CarruthEtAl2010","container-title":"SpaceOps 2010 Conference","DOI":"10.2514/6.2010-2284","event-place":"Huntsville, Alabama","event-title":"SpaceOps 2010 Conference: Delivering on the Dream (Hosted by NASA Marshall Space Flight Center and Organized by AIAA)","ISBN":"978-1-62410-164-9","issued":{"date-parts":[[2010,4,25]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Huntsville, Alabama","source":"DOI.org (Crossref)","title":"A Collaborative Scheduling Environment for NASA's Deep Space Network","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2010-2284"},
  {"id":"Case","abstract":"a small simulation of small fireflies","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Case","given":"Nicky"}],"citation-key":"Case","title":"Fireflies","type":"webpage","URL":"http://ncase.me/fireflies/"},
  {"id":"Case2023","abstract":"Fireflies: an example of emergence","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Case","given":"Nicky"}],"citation-key":"Case2023","genre":"JavaScript","issued":{"date-parts":[[2023,2,12]]},"license":"CC0-1.0","original-date":{"date-parts":[[2017,5,20]]},"source":"GitHub","title":"ncase/fireflies","type":"software","URL":"https://github.com/ncase/fireflies"},
  {"id":"CasselEtAl2022","abstract":"Recently, there has been significant interest in providing positioning, navigation, and timing (PNT) capability from low-Earth orbit (LEO) satellites. Providing PNT independently of medium-Earth orbit (MEO) global navigation satellite systems (GNSS) offers the potential to complement or back up these systems. LEO satellites offer several advantages over MEO satellites, including lower required transmit power and potentially lower cost-to-orbit. In parallel, there has been significant recent progress in the development of high-performance, low-power atomic clocks for space-based applications. Combining these two developments, we assess the impact of improved oscillator stability on positioning accuracy from a stand-alone LEO constellation using covariance analysis. Two techniques for position estimation are considered: pseudorange positioning, as is done using existing MEO-based GNSS, and Doppler positioning, which can leverage signals of opportunity from LEO communications satellites. We demonstrate that satellite and receiver oscillator frequency stability play a critical role in Doppler positioning accuracy and a lesser role in pseudorange positioning accuracy. We also show that, while pseudorange positioning is generally more accurate than Doppler positioning, Doppler measurements using LEO signals of opportunity can provide positioning accuracy on the order of tens of meters when highly stable clocks are used.","accessed":{"date-parts":[[2023,5,6]]},"author":[{"family":"Cassel","given":"Ryan S."},{"family":"Scherer","given":"David R."},{"family":"Wilburne","given":"Dane R."},{"family":"Hirschauer","given":"Jonathan E."},{"family":"Burke","given":"John H."}],"citation-key":"CasselEtAl2022","DOI":"10.33012/2022.18258","event-title":"Proceedings of the 2022 International Technical Meeting of The Institute of Navigation","ISSN":"2330-3646","issued":{"date-parts":[[2022,1,27]]},"language":"en","page":"893-905","source":"www.ion.org","title":"Impact of Improved Oscillator Stability on LEO-Based Satellite Navigation","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=18258"},
  {"id":"Cheetham2021","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Cheetham","given":"Bradley"}],"citation-key":"Cheetham2021","container-title":"ASCEND 2021","DOI":"10.2514/6.2021-4128","event-place":"Las Vegas, Nevada & Virtual","event-title":"ASCEND 2021","ISBN":"978-1-62410-612-5","issued":{"date-parts":[[2021,11,15]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Las Vegas, Nevada & Virtual","source":"DOI.org (Crossref)","title":"Cislunar Autonomous Positioning System Technology Operations and Navigation Experiment (CAPSTONE)","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2021-4128"},
  {"id":"Chen2021","abstract":"A controversy at the recent meeting of the Commission for the Conservation of Antarctic Marine Living Resources shows how multilateral fisheries management treaties operate, and their limitations.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Chen","given":"Jiliang"}],"citation-key":"Chen2021","container-title":"China Dialogue Ocean","issued":{"date-parts":[[2021,1,11]]},"language":"en-US","title":"Controversy over Russian vessel in Antarctica reveals CCAMLR shortcomings","type":"post-weblog","URL":"https://chinadialogueocean.net/en/fisheries/15935-controversy-over-russian-vessel-in-antarctica-reveals-ccamlr-shortcomings/"},
  {"id":"CheungEtAl2020","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Cheung","given":"Kar-Ming"},{"family":"Lee","given":"Charles"},{"family":"Heckman","given":"David"}],"citation-key":"CheungEtAl2020","container-title":"2020 IEEE Aerospace Conference","DOI":"10.1109/AERO47225.2020.9172327","event-place":"Big Sky, MT, USA","event-title":"2020 IEEE Aerospace Conference","ISBN":"978-1-72812-734-7","issued":{"date-parts":[[2020,3]]},"page":"1-7","publisher":"IEEE","publisher-place":"Big Sky, MT, USA","source":"DOI.org (Crossref)","title":"Feasibility of “Weak GPS” Real-Time Positioning and Timing at Lunar Distance","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/9172327/"},
  {"id":"CheungLee2018","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Cheung","given":"Kar-Ming"},{"family":"Lee","given":"Charles"}],"citation-key":"CheungLee2018","container-title":"2018 SpaceOps Conference","DOI":"10.2514/6.2018-2612","event-place":"Marseille, France","event-title":"2018 SpaceOps Conference","ISBN":"978-1-62410-562-3","issued":{"date-parts":[[2018,5,28]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Marseille, France","source":"DOI.org (Crossref)","title":"Lunar Relay Coverage Analysis for RF and Optical Links","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2018-2612"},
  {"id":"ChinEtAl2008","abstract":"The initial creation of the P-POD was driven by the need for consistency and increased frequency in both pico-satellite development and access to space. The PPOD protects the launch vehicle and the primary payload as well as the CubeSats, and is compatible with many launch vehicles, making integration repeatable and cost-efficient. The P-POD can accommodate picosatellites that meet the 1kg mass and 10 centimeter cubic dimensional CubeSat standard. Mass producing a stock deployment device creates reliability in flight heritage and decreases design, manufacturing and testing costs. The P-POD provides a framework for developers to design around, and enforces adherence to the CubeSat specification. In turn, the P-POD is designed with the capability to integrate onto multiple launch vehicles. The advantages of this system are most evident in creating flexibility for CubeSat developers to launch on multiple rockets as secondary payloads. Since most satellite manufacturers must coordinate directly with the launch vehicle provider, secondary and tertiary payloads find it difficult to acquire launches. The P-POD can group multiple CubeSats to provide a competitive basis for launch as a viable secondary payload. This has allowed CubeSat developers to develop their system without a preset launch. A review of the P-POD flights over the past 5 years, and an outline of future launches consistently show the value of a standard and the benefits of flexibility.","author":[{"family":"Chin","given":"Alexander"},{"family":"Coelho","given":"Roland"},{"family":"Brooks","given":"Lori"},{"family":"Nugent","given":"Ryan"}],"citation-key":"ChinEtAl2008","event-place":"Los Angeles, CA","event-title":"6th Responsive Space Conference","issued":{"date-parts":[[2008]]},"language":"en","publisher":"AIAA","publisher-place":"Los Angeles, CA","source":"Zotero","title":"Standardization Promotes Flexibility: A Review of CubeSats’ Success","type":"paper-conference"},
  {"id":"ChouEtAl2010","abstract":"Observers in relative motion or at different gravitational potentials measure disparate clock rates. These predictions of relativity have previously been observed with atomic clocks at high velocities and with large changes in elevation. We observed time dilation from relative speeds of less than 10 meters per second by comparing two optical atomic clocks connected by a 75-meter length of optical fiber. We can now also detect time dilation due to a change in height near Earth's surface of less than 1 meter. This technique may be extended to the field of geodesy, with applications in geophysics and hydrology as well as in space-based tests of fundamental physics.","author":[{"family":"Chou","given":"Chin-Wen"},{"family":"Hume","given":"David"},{"family":"Rosenband","given":"Till"},{"family":"Wineland","given":"David J."}],"citation-key":"ChouEtAl2010","container-title":"Science","DOI":"10.1126/science.1192720","issue":"5999","issued":{"date-parts":[[2010,9,24]]},"note":"MAG ID: 2009958141","page":"1630-1633","PMID":"20929843","title":"Optical Clocks and Relativity","type":"article-journal","volume":"329"},
  {"id":"Chuang2000","abstract":"The clock synchronization problem is to determine the time difference $\\ensuremath{\\Delta}$ between two spatially separated clocks. When message delivery times between the two clocks are uncertain, $O({2}^{2n})$ classical messages must be exchanged between the clocks to determine $n$ digits of $\\ensuremath{\\Delta}$. On the other hand, as we show, there exists a quantum algorithm to obtain $n$ digits of $\\ensuremath{\\Delta}$ while communicating only $O(n)$ quantum messages.","author":[{"family":"Chuang","given":"Isaac L."}],"citation-key":"Chuang2000","container-title":"Physical Review Letters","DOI":"10.1103/physrevlett.85.2006","issue":"9","issued":{"date-parts":[[2000,8,28]]},"note":"MAG ID: 2049718282","page":"2006-2009","PMID":"10970669","title":"Quantum algorithm for distributed clock synchronization","type":"article-journal","volume":"85"},
  {"id":"ClementJohnston","abstract":"We describe the Deep Space Network’s scheduling problem based on a user requirement language. The problem is difficult to encode by almost all existing planning and scheduling systems. We describe how it can be mapped into a system that supports metric resources, durative action, simple temporal network constraints, and task hierarchy among other language features. We also describe how we adapted a local search scheduler to generate schedules. However, we argue that the application will best serve the users if local search is combined with systematic search. We describe how an implemented systematic search can be effectively applied to rescheduling.","author":[{"family":"Clement","given":"Bradley J"},{"family":"Johnston","given":"Mark D"}],"citation-key":"ClementJohnston","language":"en","source":"Zotero","title":"The Deep Space Network Scheduling Problem","type":"article-journal"},
  {"id":"CNSpaceflight2022","accessed":{"date-parts":[[2023,2,18]]},"author":[{"literal":"China 'N Asia Spaceflight 🚀🛰️🙏 [@CNSpaceflight]"}],"citation-key":"CNSpaceflight2022","container-title":"Twitter","genre":"Tweet","issued":{"date-parts":[[2022,8,22]]},"language":"en","title":"Last week, NASA announced 13 candidate landing regions for future Artemis missions to the Moon. For comparison, I add landing sites proposed by CAST scientists for China's future lunar landing missions in this figure👇. Data from a paper published in 2020 http://jdse.bit.edu.cn/sktcxb/cn/article/doi/10.15982/j.issn.2095-7777.2020.20191003002 https://t.co/md3OSZWpgR","type":"post","URL":"https://twitter.com/CNSpaceflight/status/1561668251511185408"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2008","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2008","event-place":"Washington, DC, USA","genre":"Recommended Practice","issued":{"date-parts":[[2008]]},"language":"en","number":"CCSDS 311.0-M-1","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Reference Architecture for Space Data Systems","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2010","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2010","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2010]]},"language":"en","number":"CCSDS 301.0-B-4","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Time Code Formats","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2012","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2012","genre":"Recommended Practice","issued":{"date-parts":[[2012]]},"language":"en","number":"CCSDS 650.0-M-2","source":"Zotero","title":"Reference Model for an Open Archival Information System (OAIS)","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2014","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2014","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2014]]},"language":"en","number":"CCSDS 702.1-B-1","publisher-place":"Washington, DC, USA","source":"Zotero","title":"IP over CCSDS Space Links","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2015","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2015","event-place":"Washington, DC, USA","genre":"Informational Report","issued":{"date-parts":[[2015]]},"language":"en","number":"CCSDS 130.2-G-3","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Space Data Link Protocols—Summary of Concept and Rationale","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2015a","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2015a","event-place":"Washington, DC, USA","genre":"Recommended Practice","issued":{"date-parts":[[2015]]},"language":"en","number":"CCSDS 901.1-M-1","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Space Communications Cross Support—Architecture Requirements Document","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2020","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2020","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2020]]},"language":"en","number":"CCSDS 133.1-B-3","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Encapsulation Packet Protocol","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2020a","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2020a","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2020]]},"language":"en","number":"CCSDS 133.0-B-2","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Space Packet Protocol","type":"report"},
  {"id":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2022","author":[{"literal":"Consultative Committee for Space Data Systems (CCSDS)"}],"citation-key":"ConsultativeCommitteeforSpaceDataSystemsCCSDS2022","event-place":"Washington, DC, USA","genre":"Recommended Standard","issued":{"date-parts":[[2022]]},"language":"en","number":"CCSDS 883.0-B-1","publisher-place":"Washington, DC, USA","source":"Zotero","title":"Spacecraft Onboard Interface Services—High Data Rate 3GPP and Wi-Fi Local Area Communications","type":"report"},
  {"id":"Corp2022","abstract":"A senior official tells the BBC the Artemis missions will lead to astronauts living on the Moon.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Corp","given":"Rob"}],"citation-key":"Corp2022","container-title":"BBC News","issued":{"date-parts":[[2022,11,19]]},"language":"en-GB","section":"UK","source":"www.bbc.com","title":"Artemis: Nasa expects humans to live on Moon this decade","title-short":"Artemis","type":"article-newspaper","URL":"https://www.bbc.com/news/uk-63688229"},
  {"id":"CosbyTai2022","author":[{"family":"Cosby","given":"Matthew"},{"family":"Tai","given":"Wallace"}],"citation-key":"CosbyTai2022","container-title":"Lunar Communications Architecture Working Group","issued":{"date-parts":[[2022,1,31]]},"language":"en","source":"Zotero","title":"Report of the Interagency Operations Advisory Group Lunar Communications Architecture Working Group","type":"article-journal"},
  {"id":"CrescentSpace2023","abstract":"The next avenue for continuing human presence in space comes down to one place—the Moon.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"literal":"Crescent Space"}],"citation-key":"CrescentSpace2023","container-title":"Lockheed Martin","issued":{"date-parts":[[2023,3,28]]},"language":"en","title":"Parsec™ Service from Lockheed Martin","type":"webpage","URL":"https://www.lockheedmartin.com/en-us/news/features/2021/lunar-communication-and-navigation-network.html"},
  {"id":"Cristian1989","abstract":"A probabilistic method is proposed for reading remote clocks in distributed systems subject to unbounded random communication delays. The method can achieve clock synchronization precisions superior to those attainable by previously published clock synchronization algorithms. Its use is illustrated by presenting a time service which maintains externally (and hence, internally) synchronized clocks in the presence of process, communication and clock failures.","author":[{"family":"Cristian","given":"Flaviu"}],"citation-key":"Cristian1989","container-title":"Distributed Computing","DOI":"10.1007/bf01784024","issue":"3","issued":{"date-parts":[[1989,9,1]]},"note":"MAG ID: 2102977580","page":"146-158","title":"Probabilistic clock synchronization","type":"article-journal","volume":"3"},
  {"id":"DivsalarEtAl2019","abstract":"In this paper we design and analyze an end-to-end communication system between a lander/rover on the surface of the lunar South Pole and an Earth station. The acquisition and tracking system is discussed in detail. The communication system on the lander or rover could be used for the Earth-to-Moon communication. To communicate to and from the lander/rover on the lunar South Pole, low and/or medium directional antennas onboard the lander/rover will have to be pointed at low elevation angles between 2 to 10 degrees, thus causing multipath fading effects due to reflection of a portion of the transmitted electromagnetic waves from the surface of the Moon that are not commonly encountered in traditional deep space communications between a spacecraft and a ground station. To design and analyze such a communication system, and in particular the acquisition and tracking system, in the presence of multipath fading, first we model the fading channel based on existing and simulated data. In addition to multipath fading, the channel also introduces Doppler frequency up to 11.5 KHz, and Doppler rate up to 0.735 Hz/sec. For coherent reception the Doppler frequency, which is time varying, should be acquired and the incoming carrier phase, which includes the fading phase, should be tracked in the presence of multipath fading. For this communication system in addition to estimating the received carrier phase, the amplitude of the fading signal should also be estimated, in particular to be used in the decoder. In addition to acquisition and tracking, we consider simple modulation and coding schemes. Space diversity using two antennas on Earth to mitigate the effects of fading could also be used. We design phase-locked loops and frequency sweeping schemes robust to the attenuations due to fading. After designing various components of the communication system, we use Simulink models to obtain the end-to-end performance of the communication link under investigation. Based on the available data, the fading channel can be accurately modeled as a Rician fading channel with Rician parameter of 10 dB, and Doppler spread that depends on the Doppler frequency and the transmit/receive antenna patterns. The challenge is how to make such a communication system robust in the presence of the multipath fading where the Doppler spread changes in time and thus produces fading with time-varying durations (short and very long fades). In summary, this paper covers communication system design, performance analysis, and simulations for performance of Doppler frequency acquisition, tracking, uncoded system, and coded system under ideal interleaving assumption with hard decision over communication link between a lander/rover at the Lunar south pole and a DSN Earth station in presence of Rician fading.","author":[{"family":"Divsalar","given":"Dariush"},{"family":"Net","given":"Marc Sanchez"},{"family":"Cheung","given":"Kar-Ming"}],"citation-key":"DivsalarEtAl2019","container-title":"2019 IEEE Aerospace Conference","DOI":"10.1109/AERO.2019.8742112","event-title":"2019 IEEE Aerospace Conference","ISSN":"1095-323X","issued":{"date-parts":[[2019,3]]},"page":"1-14","source":"IEEE Xplore","title":"Acquisition and tracking for communications between Lunar South Pole and Earth","type":"paper-conference"},
  {"id":"Dodds2002","author":[{"family":"Dodds","given":"Klaus"}],"call-number":"F3030 .D63 2002","citation-key":"Dodds2002","event-place":"London ; New York : New York","ISBN":"978-1-86064-769-7 978-1-86064-770-3","issued":{"date-parts":[[2002]]},"note":"OCLC: ocm50614686","number-of-pages":"229","publisher":"I.B. Tauris ; In the U.S. and Canada distributed by Palgrave Macmillan","publisher-place":"London ; New York : New York","source":"Library of Congress ISBN","title":"Pink ice: Britain and the South Atlantic Empire","title-short":"Pink ice","type":"book"},
  {"id":"DominionsOffice","abstract":"Russian interest in Antarctic","archive":"The National Archives, Kew","archive_location":"DO 35/2897","author":[{"literal":"Dominions Office"}],"citation-key":"DominionsOffice","license":"Public Record(s)","publisher":"The National Archives (UK), 1949-1951","source":"The National Archives (UK)","title":"Russian interest in Antarctic","type":"document","URL":"https://discovery.nationalarchives.gov.uk/details/r/C4712030"},
  {"id":"DubeZhang2010","abstract":"Clock synchronization refers to techniques and protocols used to maintain mutually consistent time-of-day clocks in a coordinated network of computers. A (clock) synchronization network is an interconnection of computers to implement a particular clock synchronization solution. To prevent clock-dependency loops, most synchronization networks use a stratified approach which is essentially a tree structure with a Primary Reference Clock (at \"stratum- 0\"). A node at stratum-i+1 exchanges synchronization messages with its parent node at stratum-i and also with some other nodes at same or other level. The purpose of this redundancy is two fold: (i) to calculate smoother steering rate adjustment, (ii) to maintain connectivity in the event of a failure. We provide an analytical framework to evaluate the performance of different approaches for resilient synchronization networks. To evaluate resiliency of synchronization networks, we characterize failure recovery metrics like connectivity and failure detection delay in terms of parameters related to network topology and failure recovery solutions.","author":[{"family":"Dube","given":"Parijat"},{"family":"Zhang","given":"Li"}],"citation-key":"DubeZhang2010","DOI":"10.1145/1870178.1870197","issue":"2","issued":{"date-parts":[[2010,10,15]]},"note":"MAG ID: 2039250503","page":"54-56","title":"Resiliency of distributed clock synchronization networks","type":"article-journal","volume":"38"},
  {"id":"DurEtAl2021","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Dür","given":"Wolfgang"},{"family":"Függer","given":"Matthias"},{"family":"Steininger","given":"Andreas"}],"citation-key":"DurEtAl2021","container-title":"Microelectronics Reliability","container-title-short":"Microelectronics Reliability","DOI":"10.1016/j.microrel.2021.114088","ISSN":"00262714","issued":{"date-parts":[[2021,5]]},"language":"en","page":"114088","source":"DOI.org (Crossref)","title":"Generation of a fault-tolerant clock through redundant crystal oscillators","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S0026271421000548","volume":"120"},
  {"id":"Elburn2022","abstract":"Artemis III will be humanity’s return to the lunar surface and NASA will make history by sending the first humans to the lunar South Pole region.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Elburn","given":"Darcy"}],"citation-key":"Elburn2022","container-title":"NASA","genre":"Text","issued":{"date-parts":[[2022,11,15]]},"language":"und","title":"Artemis III: NASA’s First Human Mission to the Lunar South Pole","title-short":"Artemis III","type":"post-weblog","URL":"http://www.nasa.gov/feature/artemis-iii"},
  {"id":"ElyLieb2006","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Ely","given":"Todd A."},{"family":"Lieb","given":"Erica"}],"citation-key":"ElyLieb2006","container-title":"The Journal of the Astronautical Sciences","container-title-short":"J of Astronaut Sci","DOI":"10.1007/BF03256476","ISSN":"0021-9142","issue":"1","issued":{"date-parts":[[2006,3]]},"language":"en","page":"53-67","source":"DOI.org (Crossref)","title":"Constellations of elliptical inclined lunar orbits providing polar and global coverage","type":"article-journal","URL":"http://link.springer.com/10.1007/BF03256476","volume":"54"},
  {"id":"EnzerEtAl2017","accessed":{"date-parts":[[2022,12,27]]},"author":[{"family":"Enzer","given":"Daphna G."},{"family":"Diener","given":"William A."},{"family":"Murphy","given":"David W."},{"family":"Rao","given":"Shanti R."},{"family":"Tjoelker","given":"Robert L."}],"citation-key":"EnzerEtAl2017","container-title":"IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control","container-title-short":"IEEE Trans. Ultrason., Ferroelect., Freq. Contr.","DOI":"10.1109/TUFFC.2016.2636088","ISSN":"0885-3010","issue":"3","issued":{"date-parts":[[2017,3]]},"page":"623-633","source":"DOI.org (Crossref)","title":"Drifts and Environmental Disturbances in Atomic Clock Subsystems: Quantifying Local Oscillator, Control Loop, and Ion Resonance Interactions","title-short":"Drifts and Environmental Disturbances in Atomic Clock Subsystems","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/7790880/","volume":"64"},
  {"id":"EnzerEtAl2021","accessed":{"date-parts":[[2022,12,27]]},"author":[{"family":"Enzer","given":"Daphna G."},{"family":"Murphy","given":"David W."},{"family":"Burt","given":"Eric A."}],"citation-key":"EnzerEtAl2021","container-title":"IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control","container-title-short":"IEEE Trans. Ultrason., Ferroelect., Freq. Contr.","DOI":"10.1109/TUFFC.2021.3061005","ISSN":"0885-3010, 1525-8955","issue":"7","issued":{"date-parts":[[2021,7]]},"page":"2590-2601","source":"DOI.org (Crossref)","title":"Allan Deviation of Atomic Clock Frequency Corrections: A New Diagnostic Tool for Characterizing Clock Disturbances","title-short":"Allan Deviation of Atomic Clock Frequency Corrections","type":"article-journal","URL":"https://ieeexplore.ieee.org/document/9359763/","volume":"68"},
  {"id":"Eubanks2023","author":[{"family":"Eubanks","given":"T. Marshall"}],"citation-key":"Eubanks2023","container-title":"Journées 2023: Temps et Relativité Générale (Time and General Relativity)","issued":{"date-parts":[[2023]]},"title":"Relativistic Lunar Time, Lunar Dynamics and A Proposal for an Adjusted Lunar Time","type":"article-journal"},
  {"id":"EvenflowEtAl2021","abstract":"An analysis of investment needs and funding gaps in support of the creation of fit-for-purpose financial instruments","author":[{"literal":"Evenflow"},{"literal":"LE Europe Ltd."},{"literal":"Valdani, Vicari & Associates"}],"citation-key":"EvenflowEtAl2021","event-place":"Brussels","issued":{"date-parts":[[2021]]},"language":"en","publisher":"European Investment Bank","publisher-place":"Brussels","source":"Zotero","title":"GNSS Investment Report 2021","type":"report"},
  {"id":"FeinbergEtAl2022","accessed":{"date-parts":[[2023,1,31]]},"author":[{"family":"Feinberg","given":"Evan H."},{"family":"Gabriel","given":"Jonathon"},{"family":"Lachance","given":"Zachary"},{"family":"Akin","given":"David L."}],"citation-key":"FeinbergEtAl2022","container-title":"ASCEND 2022","DOI":"10.2514/6.2022-4396","event-place":"Las Vegas, Nevada & Online","event-title":"ASCEND 2022","ISBN":"978-1-62410-662-0","issued":{"date-parts":[[2022,10,24]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Las Vegas, Nevada & Online","source":"DOI.org (Crossref)","title":"Lunar Navigation Beacons: Technology Development and Mission Applications","title-short":"Lunar Navigation Beacons","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2022-4396"},
  {"id":"FlambaumEtAl2008","abstract":"We consider microwave hyperfine transitions in the ground state of cesium and rubidium atoms which are presently used as the primary and the secondary frequency standards. The atoms are confined in an optical lattice generated by a circularly polarized laser field. We demonstrate that applying an external magnetic field with appropriately chosen direction may cancel dynamic Stark frequency shift making the frequency of the clock transition insensitive to the strengths of both the laser and the magnetic fields. This can be attained for practically any laser frequency which is sufficiently distant from a resonance.","accessed":{"date-parts":[[2023,4,11]]},"author":[{"family":"Flambaum","given":"V. V."},{"family":"Dzuba","given":"V. A."},{"family":"Derevianko","given":"A."}],"citation-key":"FlambaumEtAl2008","container-title":"Physical Review Letters","container-title-short":"Phys. Rev. Lett.","DOI":"10.1103/PhysRevLett.101.220801","issue":"22","issued":{"date-parts":[[2008,11,26]]},"page":"220801","publisher":"American Physical Society","source":"APS","title":"Magic Frequencies for Cesium Primary-Frequency Standard","type":"article-journal","URL":"https://link.aps.org/doi/10.1103/PhysRevLett.101.220801","volume":"101"},
  {"id":"FlaneganEtAl2008","abstract":"America's Vision for Space Exploration envisions the permanent return of humans to the\nmoon and the expansion of human presence across the solar system. A major NASA effort to\ndevelop architectures for lunar exploration and science, called the Lunar Architecture Team\n(LAT), completed a multi-center, year long study in September 2007. The concepts of\noperations, analyses, requirements, and conceptual designs developed during the LAT study\nform the basis of the current effort to decide on the basic elements of the overall space\ntransportation and lunar surface systems architecture. The elements of the Lunar\nArchitecture include descent and ascent transportation, habitation, mobility, power\ngeneration and distribution, resource extraction and storage, Extra-Vehicular Activity\n(EVA), and communications and navigation. In this paper, an overview of the LAT\nCommunication and Navigation (C&N) results will be described. This includes the\narchitecture of the Lunar Network (LN), concepts of operations, spectrum utilization, traffic\nmodel, element design concepts (including lunar relay satellites, surface communication\nterminals, and user radios), and requisite technology improvements.","accessed":{"date-parts":[[2023,8,12]]},"author":[{"family":"Flanegan","given":"Mark"},{"family":"Gal-Edd","given":"Jonathon"},{"family":"Anderson","given":"Lynn"},{"family":"Warner","given":"Joseph"},{"family":"Ely","given":"Todd"},{"family":"Lee","given":"Charles"},{"family":"Shah","given":"Biren"},{"family":"Vaisnys","given":"Arvydas"},{"family":"Schier","given":"James"}],"citation-key":"FlaneganEtAl2008","collection-title":"SpaceOps Conferences","container-title":"SpaceOps 2008 Conference","DOI":"10.2514/6.2008-3589","issued":{"date-parts":[[2008,5,12]]},"publisher":"American Institute of Aeronautics and Astronautics","source":"arc.aiaa.org (Atypon)","title":"NASA Lunar Communication and Navigation Architecture","type":"chapter","URL":"https://arc.aiaa.org/doi/10.2514/6.2008-3589"},
  {"id":"FloodEtAl2022","abstract":"Scalable methods for the precise distribution of time and frequency across clusters or constellations of small satellites are sought-after in support of positioning, navigation, and timing (PNT), scientific, and communication needs. This paper builds on previous work [1,2] and explores next steps in modeling inter-satellite clock comparison using an upgraded testbed designed to represent a distributed ensemble across a small cluster of two satellites, each with a low size, weight, and power (SWaP) clock onboard. The work presented in this paper models the small satellite timing system using software defined radios (SDR), improved signal steering methods, and the combination of these concepts into a multi-platform clock ensemble. Results show a diverse ensemble capable of generating a steered signal that exhibits the short term stability of an Orolia miniaturized rubidium oscillator (mRO) [3] and the long term stability of a Microsemi SA.45s chip scale atomic clock (CSAC) [4] with a smooth transition across stability regions.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Flood","given":"Christopher"},{"family":"Pedersen","given":"Justin"},{"family":"Axelrad","given":"Penina"}],"citation-key":"FloodEtAl2022","DOI":"10.33012/2023.18683","event-title":"Proceedings of the 54th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2022,1,26]]},"language":"en","page":"223-235","source":"www.ion.org","title":"A Multi-Platform Clock Ensemble Testbed","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=18683"},
  {"id":"FontanelliEtAl2014","abstract":"Industrial networks for distributed monitoring, control, and automation purposes require high-accuracy clock synchronization in topologies including long chains of cascaded nodes. Unfortunately, accuracy typically degrades as the number of devices and the distance from the synchronization reference node (i.e., the master or grandmaster) grows, because of the accumulation of multiple uncertainty contributions. To mitigate this problem, the so-called transparent clocks are used in some synchronization protocols, such as the precision transparent clock protocol used in PROFINET IO isochronous real time networks and the precision time protocol version 2, standardized as IEEE 1588-2008. In this paper, an optimal servo-clock in the mean square sense is proposed. The controller relies on both a Kalman filter that estimates the clock state difference with respect to the master and a static-state feedback assuring mean square stability even under the effect of significant fluctuations of the synchronization period. Several multiparametric simulation results in a case study based on the features of PROFINET IO devices confirm that excellent performance can be achieved with the proposed approach.","author":[{"family":"Fontanelli","given":"Daniele"},{"family":"Macii","given":"David"},{"family":"Rinaldi","given":"Stefano"},{"family":"Ferrari","given":"Paolo"},{"family":"Flammini","given":"Alessandra"}],"citation-key":"FontanelliEtAl2014","container-title":"IEEE Transactions on Instrumentation and Measurement","DOI":"10.1109/TIM.2013.2286871","ISSN":"1557-9662","issue":"5","issued":{"date-parts":[[2014,5]]},"page":"1085-1095","source":"IEEE Xplore","title":"A Servo-Clock Model for Chains of Transparent Clocks Affected by Synchronization Period Jitter","type":"article-journal","volume":"63"},
  {"id":"Foust2022","abstract":"Quantum Space has raised $15 million to further development of the first in a constellation of satellites intended to provide services in cislunar space.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Foust","given":"Jeff"}],"citation-key":"Foust2022","container-title":"SpaceNews","issued":{"date-parts":[[2022,12,13]]},"language":"en-US","title":"Quantum Space raises $15 million for cislunar spacecraft","type":"post-weblog","URL":"https://spacenews.com/quantum-space-raises-15-million-for-cislunar-spacecraft/"},
  {"id":"FroehlichEtAl2008","abstract":"A time-keeping mechanism is proposed for providing microsecond-level consistent time across a cluster of computers. The proposed mechanism is based on a new clock steering algorithm that uses piecewise linear mapping to align a local clock to an external reference clock in a smooth manner. We present two realizations of the algorithm: one is based on pulse-per-second (PPS) and the other is based on low-latency timing message exchange. The time derived by the proposed mechanism is called CCT (coordinated cluster time). It has a well-defined interface such that it can be used by applications with little overhead. Moreover, the interface deals completely with leap second issues. We implemented CCT on IBM BladeCenters and compared it to NTP. Experimental results demonstrate that the proposed mechanism achieves one microsecond precision.","author":[{"family":"Froehlich","given":"Steven E."},{"literal":"Michel H. T. Hack"},{"family":"Hack","given":"Michel H. T."},{"family":"Meng","given":"Xiaoqiao"},{"family":"Zhang","given":"Li"}],"citation-key":"FroehlichEtAl2008","DOI":"10.1109/ispcs.2008.4659213","issued":{"date-parts":[[2008,10,24]]},"note":"MAG ID: 2163669185","page":"54-58","title":"Achieving precise coordinated cluster time in a cluster environment","type":"article-journal"},
  {"id":"GiffordEtAl2007","abstract":"This study describes an activity being undertaken by NASA. The Space Communication Architecture Working Group (SCAWG) was established to recommend the future architecture of NASA's communication, navigation, and timing systems through studies coordinated across all NASA Centers and Mission Directorates. The architecture will support both science missions and the Vision for Space Exploration (VSE), which calls for returning of humans to the Moon, expanding human presence to Mars, and exploring the solar system. Foreseeable NASA applications span a wide range of demands for time services. Four examples include: (1) event logging by human explorers; (2) networking of cooperative robots on a planetary surface (e.g., the Moon or Mars); (3) time transfer for navigation local to a planetary body; and (4) time synchronization for communication and science. Documented accuracies range from 1 s for event logging down to 10 ns for local navigation and communication. Accuracy requirements below 1 ns for science missions are anticipated. Required time corrections due to the change in relative range between a time source and user during the light-time measurement interval are described. In addition, corrections for relativistic effects on clocks in Earth orbit or the Mars and Moon environments are necessary. The time dissemination alternatives identified thus far are based on existing time dissemination technologies, including radiometric ranging, network time dissemination, and stand-alone time dissemination techniques. The paper presents concept descriptions of: (1) DSN two-way ranging utilized for time transfer; (2) scalable one-way, two-way time dissemination using relay satellites; and (3) a GPS augmentation system, consisting of pseudolites or beacons distributed on the surface of the Moon and elsewhere in the solar system.","author":[{"family":"Gifford","given":"Al"},{"family":"Nelson","given":"Robert"},{"family":"Orr","given":"Richard"},{"family":"Oria","given":"A."},{"family":"Brodsky","given":"Beryl"},{"family":"Miller","given":"James"},{"family":"Adde","given":"Barbara"}],"citation-key":"GiffordEtAl2007","issued":{"date-parts":[[2007,1,1]]},"page":"11","source":"ResearchGate","title":"Time Dissemination Alternatives for Future NASA Applications","type":"article-journal"},
  {"id":"GiordanoEtAl2022","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Giordano","given":"Pietro"},{"family":"Malman","given":"Floor"},{"family":"Swinden","given":"Richard"},{"family":"Zoccarato","given":"Paolo"},{"family":"Ventura-Traveset","given":"Javier"}],"citation-key":"GiordanoEtAl2022","DOI":"10.33012/2022.18225","event-place":"Long Beach, California","event-title":"2022 International Technical Meeting of The Institute of Navigation","ISSN":"2330-3646","issued":{"date-parts":[[2022,2,14]]},"page":"632-642","publisher-place":"Long Beach, California","source":"DOI.org (Crossref)","title":"The Lunar Pathfinder PNT Experiment and Moonlight Navigation Service: The Future of Lunar Position, Navigation and Timing","title-short":"The Lunar Pathfinder PNT Experiment and Moonlight Navigation Service","type":"paper-conference","URL":"https://www.ion.org/publications/abstract.cfm?articleID=18225"},
  {"id":"Girela-LopezEtAl2020","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Girela-Lopez","given":"Francisco"},{"family":"Lopez-Jimenez","given":"Jose"},{"family":"Jimenez-Lopez","given":"Miguel"},{"family":"Rodriguez","given":"Rafael"},{"family":"Ros","given":"Eduardo"},{"family":"Diaz","given":"Javier"}],"citation-key":"Girela-LopezEtAl2020","container-title":"IEEE Access","container-title-short":"IEEE Access","DOI":"10.1109/ACCESS.2020.2978337","ISSN":"2169-3536","issued":{"date-parts":[[2020]]},"page":"45211-45220","source":"DOI.org (Crossref)","title":"IEEE 1588 High Accuracy Default Profile: Applications and Challenges","title-short":"IEEE 1588 High Accuracy Default Profile","type":"article-journal","URL":"https://ieeexplore.ieee.org/document/9023998/","volume":"8"},
  {"id":"GlennieThrift2009","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Glennie","given":"Paul"},{"family":"Thrift","given":"Nigel"}],"citation-key":"GlennieThrift2009","DOI":"10.1093/acprof:oso/9780199278206.001.0001","ISBN":"978-0-19-927820-6","issued":{"date-parts":[[2009,2,12]]},"publisher":"Oxford University Press","source":"DOI.org (Crossref)","title":"Shaping the Day","type":"book","URL":"http://www.oxfordscholarship.com/view/10.1093/acprof:oso/9780199278206.001.0001/acprof-9780199278206"},
  {"id":"GlennieThrift2009a","accessed":{"date-parts":[[2023,2,4]]},"citation-key":"GlennieThrift2009a","container-author":[{"family":"Glennie","given":"Paul"},{"family":"Thrift","given":"Nigel"}],"container-title":"Shaping the Day","DOI":"10.1093/acprof:oso/9780199278206.001.0001","ISBN":"978-0-19-927820-6","issued":{"date-parts":[[2009,2,12]]},"page":"65-99","publisher":"Oxford University Press","source":"DOI.org (Crossref)","title":"‘Not Everyone Occupies the Same Now’: Reconceptualizing Clock Time","type":"chapter","URL":"http://www.oxfordscholarship.com/view/10.1093/acprof:oso/9780199278206.001.0001/acprof-9780199278206"},
  {"id":"GongEtAl2010","abstract":"Systems and methods of synchronizing devices may include detecting a movement of a first mobile device and conducting a time synchronization procedure with respect to a second mobile device in response to the movement of the two mobile devices. The time synchronization can be conducted without network infrastructure support at the mobile devices.","author":[{"family":"Gong","given":"Michelle X."},{"family":"Want","given":"Roy"},{"family":"Haussecker","given":"Horst W."}],"citation-key":"GongEtAl2010","issued":{"date-parts":[[2010,9,23]]},"note":"MAG ID: 109877989","title":"Motion initiated time synchronization","type":"article-journal"},
  {"id":"HaiboEtAl2009","abstract":"Hydrogen masers and cesium clocks are two important kinds of precision frequency standard, and each of them has its own advantages in time keeping. It is important to investigate the way for effectively combining these two kinds of cocks in order to form a better atomic time scale. There are four hydrogen masers and eighteen Hp5071A cesium clocks at NTSC (National Time Service Center, the Chinese Academy of Sciences). Two of the hydrogen masers are MHM-2010 which is manufactured by symmetricom, and the other two are made in Shanghai Astronomy Observatory (SHAO), the Chinese Academy of Sciences. It is well known that the advantage of a Hydrogen maser is concentrated on its short term stability; however its frequency could drift when it runs for long term. The advantage of a cesium clock is its long term stability; however its short term stability is worse than that of a hydrogen maser. In addition, clocks, even though are of the same kind, their performance could be very different because of their noise and other factors. In this paper, the performance of atomic clocks at NTSC is studied through the analysis of their noises. In atomic time scale algorithm, the short term stability and the long term stability of each clock are considered separately, which makes the frequency of time scale more stable for both long and short terms. For calculating the weight of a group of clocks the difference between Allan deviation and standard deviation is discussed in detail.","author":[{"family":"Haibo","given":"Yuan"},{"family":"Lili","given":"Qu"},{"family":"Shaowu","given":"Dong"},{"family":"Wei","given":"Li"},{"family":"Hong","given":"Zhang"}],"citation-key":"HaiboEtAl2009","container-title":"2009 IEEE International Frequency Control Symposium Joint with the 22nd European Frequency and Time forum","DOI":"10.1109/FREQ.2009.5168261","event-title":"2009 IEEE International Frequency Control Symposium Joint with the 22nd European Frequency and Time forum","ISSN":"2327-1949","issued":{"date-parts":[[2009,4]]},"page":"639-642","source":"IEEE Xplore","title":"The hydrogen maser and cesium clocks in time keeping at NTSC","type":"paper-conference"},
  {"id":"HanJeong2010","abstract":"This paper addresses issues with time synchronization using the IEEE 1588-2008 for distributed measurement and control systems. A practical implementation of the transparent clock is presented with the overall system architecture and detailed operation of each building block. To verify the submicrosecond accuracy using the implemented devices, an experimental setup that was analogous to a practical distributed system has been built. Measured results from the experiment show that the time error is limited below 30 ns for nodes that were connected by three switches. It is remarkable that the results are observed in spite of large packet queuing delays that were introduced by a traffic generator. The discussion on sources of time error that was outlined here provides technical considerations to designing IEEE 1588 systems.","author":[{"family":"Han","given":"Jiho"},{"family":"Jeong","given":"Deog-Kyoon"}],"citation-key":"HanJeong2010","container-title":"IEEE Transactions on Instrumentation and Measurement","DOI":"10.1109/TIM.2009.2024371","ISSN":"1557-9662","issue":"2","issued":{"date-parts":[[2010,2]]},"page":"433-439","source":"IEEE Xplore","title":"A Practical Implementation of IEEE 1588-2008 Transparent Clock for Distributed Measurement and Control Systems","type":"article-journal","volume":"59"},
  {"id":"HarleEtAl","abstract":"View Video Presentation: https://doi.org/10.2514/6.2021-4132.vidLunar comms and nav infrastructure – first data relay orbiter Lunar Pathfinder, operational in 2024, paves the way for full constellation by 2030s A key to sustainable lunar exploration is access to permanent, low-cost and high performance service infrastructure. Easy access to support services such as communication and navigation will rapidly become essential for lunar missions, for technical and economic reasons. A similar trend has already been observed in the transportation domain in the USA, where 14 CLPS (Commercial Lunar Payload Services) compete regularly to provide transportation to the Moon as a service. To an emerging space nation with a low-budget science mission on the far-side, this infrastructure will be an enabler by removing the need for a relay spacecraft. To a commercial endeavour looking to invest in ISRU (In-Situ Resource Utilization), it will help close the business case for investment and grow the demand. Early 2021, in partnership with the European Space Agency (ESA), Surrey Satellite Technology Ltd (SSTL) started the clock on the development of Lunar Pathfinder, the first data-relay lunar orbiter to commercially offer communication services to missions on the surface and in orbit around the Moon. From 2024 onwards, lunar missions of all types (orbiters, rovers, landers, stationary instruments) will be able to access the service and dramatically enhance the value of their mission by lifting the multiple constraints of transferring data back to Earth. Transmitting Direct to Earth (DTE) presents several limitations that can be lifted by the use of a comms relay infrastructure. DTE relies on direct line of sight, which makes it impossible for far-side missions, and a risk for mobile missions likely to encounter obstructing terrain. It also limits the achievable data-rate and contact time with the often oversubscribed deep space ground stations, therefore constraining the overall volume of data that can be retrieved by the end user. With a store and forward capability, a proximity link, two simultaneous channels in S-band and UHF, Lunar Pathfinder data-relay spacecraft is designed to lift these constraints, allowing longer upload durations at higher data-rates with each of the lunar assets, and bulk-sending data, at high speed, back to an Earth Ground Station, ready for distribution to the end users. In addition to its main mission, Lunar Pathfinder will also carry a hosted payload, an ESA GNSS receiver, with the objective of running a GNSS weak signal detection experiment from lunar orbit, a significant step towards navigation service provision for lunar assets. The decision to proceed with building the Lunar Pathfinder infrastructure and services, in the frame of a commercial partnership between SSTL and ESA, was the result of a successful study phase realized for ESA in collaboration with Goonhilly Earth Station (GES). It was also enabled by NASA’s interest in using the communication services for their own robotic assets. Several customer missions are now actively working with SSTL Lunar (a new brand of SSTL, dedicated to the provision of lunar services) to prepare their communication service package. And we are not stopping there… As lunar missions evolve and move from mainly science and exploration towards in-situ resource utilization and purely commercial endeavours, such as tourism, they will increasingly rely on a lunar infrastructure that can provide permanent, low-cost and high performance key support services. Building upon the Lunar Pathfinder experience and the commercialisation of its services, an SSTL-led consortium, including established telecom operators, as well as space and ground segment integrators, is already working on the next generation infrastructure. With a space segment based on a constellation of data-relay orbiters and strong interoperability requirements with other infrastructure elements such as Gateway, the overall system will integrate into the backbone infrastructure.","accessed":{"date-parts":[[2023,3,27]]},"author":[{"family":"Harle","given":"Nelly Offord"},{"family":"Oates","given":"Clive"},{"family":"Bywater","given":"Sophie"},{"family":"Cranstoun","given":"Charles"},{"family":"Friend","given":"Jonathan"},{"family":"Lay","given":"Gary"},{"family":"Schwarz","given":"Ben"},{"family":"Stevens","given":"Paul"},{"family":"Hufenbach","given":"Bernhard"},{"family":"Liuicci","given":"Francesco"},{"family":"Cosby","given":"Matthew"},{"family":"Saunders","given":"Chris"}],"citation-key":"HarleEtAl","container-title":"ASCEND 2021","DOI":"10.2514/6.2021-4132","publisher":"American Institute of Aeronautics and Astronautics","source":"American Institute of Aeronautics and Astronautics","title":"Lunar comms and nav infrastructure – first data relay orbiter Lunar Pathfinder, operational in 2024, paves the way for full constellation by 2030s","type":"chapter","URL":"https://arc.aiaa.org/doi/abs/10.2514/6.2021-4132"},
  {"id":"HisamotoSheikh2015","accessed":{"date-parts":[[2023,2,19]]},"author":[{"family":"Hisamoto","given":"Chuck S."},{"family":"Sheikh","given":"Suneel I."}],"citation-key":"HisamotoSheikh2015","container-title":"Journal of Guidance, Control, and Dynamics","container-title-short":"Journal of Guidance, Control, and Dynamics","DOI":"10.2514/1.G001008","ISSN":"0731-5090, 1533-3884","issue":"9","issued":{"date-parts":[[2015,9]]},"language":"en","page":"1765-1774","source":"DOI.org (Crossref)","title":"Spacecraft Navigation Using Celestial Gamma-Ray Sources","type":"article-journal","URL":"https://arc.aiaa.org/doi/10.2514/1.G001008","volume":"38"},
  {"id":"Hofacker2021","abstract":"NASA remains determined to catalyze a competitive market with seed money","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Hofacker","given":"Cat"}],"citation-key":"Hofacker2021","container-title":"Aerospace America","issued":{"date-parts":[[2021,11,17]]},"language":"en-US","title":"For post-ISS era, consensus remains elusive over whether market can support multiple private stations","type":"post-weblog","URL":"https://aerospaceamerica.aiaa.org/for-post-iss-era-consensus-remains-elusive-over-whether-market-can-support-multiple-private-stations/"},
  {"id":"Howkins2017","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Howkins","given":"Adrian"}],"citation-key":"Howkins2017","DOI":"10.1093/acprof:oso/9780190249144.001.0001","ISBN":"978-0-19-024914-4","issued":{"date-parts":[[2017,2,2]]},"publisher":"Oxford University Press","source":"DOI.org (Crossref)","title":"Frozen Empires: An Environmental History of the Antarctic Peninsula","title-short":"Frozen Empires","type":"book","URL":"https://academic.oup.com/book/4539"},
  {"id":"Howse1980","abstract":"xviii, 254 pages : 22 cm; Traces the astronomical, navigational, and timekeeping advances that led to the development of Greenwich time, the concept of longitude, and the designation of Greenwich as the prime meridian; Includes bibliographical references (pages 232-234) and index; Seeking the longitude: 300 BC -- AD 1675 -- Greenwich time for astronomers: 1675-1720 -- Greenwich time for navigators: 1700-1840 -- Greenwich time for Great Britain: 1825-1880 -- A prime meridian 1790-1884 -- Greenwich time for the world: 1884-1939 -- A clock more accurate than the earth -- Appendices: I. Finding the longitude -- II. Time-finding by astronomy -- III. Mechanical and electrical clocks by Roger Stevenson -- IV. Modern precision clocks by John Pilkington -- V. Time-balls in operation, 1861 -- VI. International Meridian Conference, Washington, 1884","accessed":{"date-parts":[[2023,2,7]]},"author":[{"family":"Howse","given":"Derek"}],"citation-key":"Howse1980","contributor":[{"literal":"Internet Archive"}],"ISBN":"978-0-19-215948-9","issued":{"date-parts":[[1980]]},"language":"eng","number-of-pages":"282","publisher":"Oxford ; New York : Oxford University Press","source":"Internet Archive","title":"Greenwich time and the discovery of the longitude","type":"book","URL":"http://archive.org/details/greenwichtimedis0000hows"},
  {"id":"HuangEtAl2018","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Huang","given":"Shanshan"},{"family":"Wang","given":"Zhen"},{"family":"Zhang","given":"Chi"},{"family":"Fang","given":"Yuguang"}],"citation-key":"HuangEtAl2018","container-title":"Wireless Algorithms, Systems, and Applications","DOI":"10.1007/978-3-319-94268-1_16","editor":[{"family":"Chellappan","given":"Sriram"},{"family":"Cheng","given":"Wei"},{"family":"Li","given":"Wei"}],"event-place":"Cham","ISBN":"978-3-319-94267-4 978-3-319-94268-1","issued":{"date-parts":[[2018]]},"page":"189-200","publisher":"Springer International Publishing","publisher-place":"Cham","source":"DOI.org (Crossref)","title":"Exploiting Aerial Heterogeneous Network for Implementing Wireless Flight Recorder","type":"chapter","URL":"http://link.springer.com/10.1007/978-3-319-94268-1_16","volume":"10874"},
  {"id":"HuntEtAl2010","abstract":"We study the effects of nonzero time delays in stochastic synchronization problems with linear couplings in an arbitrary network. Using the known exact threshold value from the theory of differential equations with delays, we provide the synchronizability threshold for an arbitrary network. Further, by constructing the scaling theory of the underlying fluctuations, we establish the absolute limit of synchronization efficiency in a noisy environment with uniform time delays, i.e., the minimum attainable value of the width of the synchronization landscape. Our results also have strong implications for optimization and trade-offs in network synchronization with delays.","author":[{"family":"Hunt","given":"David"},{"literal":"D. Hunt"},{"family":"Korniss","given":"Gyorgy"},{"family":"Szymanski","given":"Boleslaw K."}],"citation-key":"HuntEtAl2010","container-title":"Physical Review Letters","DOI":"10.1103/physrevlett.105.068701","issue":"6","issued":{"date-parts":[[2010,8,4]]},"note":"MAG ID: 1619246527","page":"068701-068701","PMID":"20868019","title":"Network synchronization in a noisy environment with time delays: fundamental limits and trade-offs.","type":"article-journal","volume":"105"},
  {"id":"HurdGoldstein1975","abstract":"Quasars can be employed to synchronize global data communications, geophysical measurements, and atomic clocks. It is potentially two to three orders of magnitude better than presently-used Moon-bounce system. Comparisons between quasar and clock pulses are used to develop correction or synchronization factors for station clocks.","accessed":{"date-parts":[[2023,2,19]]},"author":[{"family":"Hurd","given":"W. J."},{"family":"Goldstein","given":"R. M."}],"citation-key":"HurdGoldstein1975","issued":{"date-parts":[[1975,6,1]]},"note":"NTRS Author Affiliations: \nNTRS Document ID: 19750000114\nNTRS Research Center: Legacy CDMS (CDMS)","number":"NPO-13276","source":"NASA NTRS","title":"Quasars as very-accurate clock synchronizers","type":"report","URL":"https://ntrs.nasa.gov/citations/19750000114"},
  {"id":"InternationalBureauofWeightsandMeasuresBIPM2017","abstract":"Technical requirements for the time laboratories for the participation in UTC","accessed":{"date-parts":[[2023,4,11]]},"author":[{"literal":"International Bureau of Weights and Measures (BIPM)"}],"citation-key":"InternationalBureauofWeightsandMeasuresBIPM2017","issued":{"date-parts":[[2017,6]]},"title":"CCTF-WGMRA Guideline 8: Technical requirements for the time laboratories for the participation in UTC","title-short":"CCTF-WGMRA Guideline 8","type":"document","URL":"https://www.bipm.org/documents/20126/30132530/cc-publication-ID-441-/52f1232f-eff0-29d4-3314-29c6e669aab1"},
  {"id":"InternationalCourtofJustice1955","accessed":{"date-parts":[[2023,2,12]]},"author":[{"literal":"International Court of Justice"}],"authority":"International Court of Justice","citation-key":"InternationalCourtofJustice1955","issued":{"date-parts":[[1955,5,4]]},"title":"Antarctica (United Kingdom v. Chile)","type":"legal_case","URL":"https://www.icj-cij.org/en/case/27"},
  {"id":"IsraelEtAl2020","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Israel","given":"David J."},{"family":"Mauldin","given":"Kendall D."},{"family":"Roberts","given":"Christopher J."},{"family":"Mitchell","given":"Jason W."},{"family":"Pulkkinen","given":"Antti A."},{"family":"Cooper","given":"La Vida D."},{"family":"Johnson","given":"Michael A."},{"family":"Christe","given":"Steven D."},{"family":"Gramling","given":"Cheryl J."}],"citation-key":"IsraelEtAl2020","container-title":"2020 IEEE Aerospace Conference","DOI":"10.1109/AERO47225.2020.9172509","event-place":"Big Sky, MT, USA","event-title":"2020 IEEE Aerospace Conference","ISBN":"978-1-72812-734-7","issued":{"date-parts":[[2020,3]]},"page":"1-14","publisher":"IEEE","publisher-place":"Big Sky, MT, USA","source":"DOI.org (Crossref)","title":"LunaNet: a Flexible and Extensible Lunar Exploration Communications and Navigation Infrastructure","title-short":"LunaNet","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/9172509/"},
  {"id":"Jardine2022","abstract":"Normative behaviours are integral to fostering a coherent community of actors and promoting peace and stability for existing treaties and aspirational goals. The author aims to explain why normative behaviours are needed for Lunar activity.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Jardine","given":"Samuel"}],"citation-key":"Jardine2022","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,12,14]]},"title":"Building Lunar Security and Cooperation Through an Astropolitical Lens- Why Normative Behaviours are Needed for Lunar Activity","type":"post-weblog","URL":"https://www.openlunar.org/library/open-lunar-registry-blog-post-series-blog-3"},
  {"id":"Jardine2022a","abstract":"This blog posts series will analyse the political backdrop for an independent multi-stakeholder Lunar activity registry, highlighting why it’s needed and how it might help. These are the precursors to a more comprehensive White Paper which we’ll be working on over the coming months.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Jardine","given":"Samuel"}],"citation-key":"Jardine2022a","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,11,10]]},"title":"Building Lunar Security and Cooperation Through an Astropolitical Lens- the role of normative behaviours in creating stability","type":"post-weblog","URL":"https://www.openlunar.org/library/open-lunar-registry-project-blog-post-series-blog-1"},
  {"id":"Jardine2022b","abstract":"Norms, particularly transparency, are needed to stabilise competition and promote cooperation on the Moon. However, these are not created in a vacuum but require their own tools and frameworks to develop, champion, and facilitate the adoption of the norm among the intended community of actors.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Jardine","given":"Samuel"}],"citation-key":"Jardine2022b","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,12,16]]},"title":"Building Lunar Security and Cooperation Through an Astropolitcal Lens- how to construct normative behaviours on the moon- enter the registry","type":"post-weblog","URL":"https://www.openlunar.org/library/open-lunar-registry-project-blog-post-series-blog-4"},
  {"id":"JardineEtAl2022","abstract":"Pressing or emerging political and geopolitical risks that have flown under the radar","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Jardine","given":"Samuel"},{"family":"Buddell","given":"Billy"},{"family":"Bryant","given":"Connor"},{"family":"Leprince","given":"Manon"},{"family":"Chang","given":"Ivory"},{"family":"Sagar","given":"Sahil"},{"family":"Sairam","given":"Vikram"},{"family":"Ronald","given":"Issy"},{"family":"Elliot","given":"Matt"},{"family":"Bather","given":"Lucy"},{"family":"Vasiljeva","given":"Keita"},{"family":"Stengs","given":"Frank"},{"family":"Singh","given":"Arshdip"},{"family":"Minor","given":"Olivia"}],"citation-key":"JardineEtAl2022","issued":{"date-parts":[[2022,1,30]]},"publisher":"London Politica","title":"Overlooked Political Risks for 2022: The Politicization of “Everything”","type":"report","URL":"https://static1.squarespace.com/static/5efb88803e2328745c7b3c39/t/6251c8d54aa61f20270da177/1649526999305/London+Politica+Overlooked+Political+Risks+for+2022.pdf"},
  {"id":"Jones2000","author":[{"family":"Jones","given":"Tony"}],"citation-key":"Jones2000","event-place":"Bristol","ISBN":"978-1-4200-3349-6","issued":{"date-parts":[[2000]]},"language":"eng","note":"OCLC: 82251796","publisher":"Institute of Physics","publisher-place":"Bristol","source":"Open WorldCat","title":"Splitting the second: the story of atomic time","title-short":"Splitting the second","type":"book"},
  {"id":"Keesey2019","abstract":"GPS, a satellite-based navigation system used by an estimated four billion people worldwide to figure out where they are on Earth at any moment, could be used to pilot in and around lunar orbit during future Artemis missions.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Keesey","given":"Lori"}],"citation-key":"Keesey2019","container-title":"NASA","genre":"Text","issued":{"date-parts":[[2019,6,28]]},"language":"und","title":"NASA Eyes GPS at the Moon for Artemis Missions","type":"post-weblog","URL":"http://www.nasa.gov/feature/goddard/2019/nasa-eyes-gps-at-the-moon-for-artemis-missions"},
  {"id":"KellerEtAl2016","abstract":"Since entering lunar orbit on June 23, 2009 the Lunar Reconnaissance Orbiter (LRO) has made comprehensive measurements of the Moon and its environment. The seven LRO instruments use a variety of primarily remote sensing techniques to obtain a unique set of observations. These measurements provide new information regarding the physical properties of the lunar surface, the lunar environment, and the location of volatiles and other resources. Scientific interpretation of these observations improves our understanding of the geologic history of the Moon, its current state, and what its history can tell us about the evolution of the Solar System. Scientific results from LRO observations overturned existing paradigms and deepened our appreciation of the complex nature of our nearest neighbor. This paper summarizes the capabilities, measurements, and some of the science and exploration results of the first six years of the LRO mission.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Keller","given":"J. W."},{"family":"Petro","given":"N. E."},{"family":"Vondrak","given":"R. R."}],"citation-key":"KellerEtAl2016","container-title":"Icarus","container-title-short":"Icarus","DOI":"10.1016/j.icarus.2015.11.024","ISSN":"0019-1035","issued":{"date-parts":[[2016,7,15]]},"language":"en","page":"2-24","source":"ScienceDirect","title":"The Lunar Reconnaissance Orbiter Mission – Six years of science and exploration at the Moon","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0019103515005412","volume":"273"},
  {"id":"KhatriEtAl2020","author":[{"family":"Khatri","given":"Yashica"},{"family":"Aboaf","given":"Aaron"},{"family":"Dowd","given":"Daniel"},{"family":"Flood","given":"Christopher"},{"family":"Dixon","given":"Henry"},{"family":"Axelrad","given":"Penina"}],"citation-key":"KhatriEtAl2020","container-title":"Small Satellite Conference","issued":{"date-parts":[[2020,8,1]]},"title":"CSAC Flight Experiment to Characterize On-Orbit Performance","type":"article-journal","URL":"https://digitalcommons.usu.edu/smallsat/2020/all2020/46"},
  {"id":"Kirchner1991","abstract":"The history of two-way satellite time transfer is provided and developments in satellite communications technology conducive to this time transfer technique are briefly reviewed. The difference between one-way and two-way satellite time transfer is explained, and the advantages and disadvantages of the two-way method are pointed out. The theory of the two-way technique using geostationary communication satellites is presented showing the high accuracy potential of the method. The advantages of the use of spread spectrum techniques are outlined. The implementation of the two-way method using communication satellites and small Earth stations using pseudonoise (PN) modems is described. Methods for signal delay calibration are dealt with. Existing links are listed and their performances are given. The future use of the two-way technique using communication satellites is discussed. >","author":[{"family":"Kirchner","given":"D."}],"citation-key":"Kirchner1991","DOI":"10.1109/5.84975","issue":"7","issued":{"date-parts":[[1991,7,1]]},"note":"MAG ID: 2107625371","page":"983-990","title":"Two-way time transfer via communication satellites","type":"article-journal","volume":"79"},
  {"id":"KongsbergSatelliteServices","abstract":"To meet the rapidly increasing demand for lunar comms, KSAT will invest in a purpose- built lunar ground network. The Lunar Team at KSAT has been preparing the service and is currently engaging with antenna providers and selecting optimal locations for the antennas.","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Kongsberg Satellite Services","given":""}],"citation-key":"KongsbergSatelliteServices","title":"KSAT to invest in a dedicated antenna network for lunar missions","type":"post-weblog","URL":"https://www.ksat.no/news/news-archive/2022/ksat-to-invest-in-antenna-network-for-lunar-missions/"},
  {"id":"KonstantinSurkov2010","abstract":"Systems and computer-implemented methods of electing a new leader node in distributed systems of simple topologies connecting a plurality of nodes on at least one computer system. The computer-implemented method comprises several steps including at least one node, which detected the absence of a leader, starting a first round for its approval as an Approved Election Initiator. If a quorum accepts the StartElection request during the first round, then the Election Initiator starts a second round to set the leader. If a quorum of all nodes has not been reached during the first round, then the first round fails. The method repeats until a leader is set and is repeated each time a node discovers that the network does not have an active leader. Also provided herein is a computer readable medium having computer executable instructions stored thereon for performing the computer-implemented method.","author":[{"literal":"Konstantin Surkov"}],"citation-key":"KonstantinSurkov2010","issued":{"date-parts":[[2010,11,15]]},"note":"MAG ID: 1537415191","title":"Systems and methods of providing fast leader elections in distributed systems of simple topologies","type":"article-journal"},
  {"id":"KopetzOchsenreiter1987","abstract":"The generation of a fault-tolerant global time base with known accuracy of synchronization is one of the important operating system functions in a distributed real-time system. Depending on the types and number of tolerated faults, this paper presents upper bounds on the achievable synchronization accuracy for external and internal synchronization in a distributed real-time system. The concept of continuous versus instantaneous synchronization is introduced in order to generate a uniform common time base for local, global, and external time measurements. In the last section, the functions of a VLSI clock synchronization unit, which improves the synchronization accuracy and reduces the CPU load, are described. With this unit, the CPU overhead and the network traffic for clock synchronization in state-of-the-art distributed real-time systems can be reduced to less than 1 percent.","author":[{"family":"Kopetz","given":"Hermann"},{"family":"Ochsenreiter","given":"Wilhelm"}],"citation-key":"KopetzOchsenreiter1987","container-title":"IEEE Transactions on Computers","DOI":"10.1109/tc.1987.5009516","issue":"8","issued":{"date-parts":[[1987,8,1]]},"note":"MAG ID: 2024481357","page":"933-940","title":"Clock Synchronization in Distributed Real-Time Systems","type":"article-journal","volume":"36"},
  {"id":"KosEtAl2004","abstract":"Location-based service (LBS) development is firmly based on the reliable and accurate position reporting system. In addition to rover-based positioning performance requirements, the position reporting system has to provide secure means of transferring position-related data between rover and location server. Here we describe the realisation of the position reporting system, based on GPS, HTTPS and GPRS technologies. Our approach allows secure position-related data transfer, with solution simplicity maintained. The automatic position reporting system (APRS) architecture is in compliance with current trends in telecommunications, promising successful integration with emerging mobile communications technologies.","call-number":"VK560 .I593 2004","citation-key":"KosEtAl2004","editor":[{"family":"Kos","given":"Tomislav"},{"family":"Grgić","given":"Mislav"},{"family":"Institute of Electrical and Electronics Engineers","given":""},{"family":"Institute of Electrical and Electronics Engineers","given":""}],"event-place":"Zadar, Croatia","ISBN":"978-953-7044-02-2","issued":{"date-parts":[[2004]]},"note":"OCLC: ocm57071296","number-of-pages":"602","publisher":"Croatian Society Electronics in Marine--ELMAR","publisher-place":"Zadar, Croatia","source":"Library of Congress ISBN","title":"Proceedings Elmar-2004: 46th International Symposium Electronics in Marine: 16-18 June 2004, Zadar, Croatia","title-short":"Proceedings Elmar-2004","type":"book"},
  {"id":"LaufEtAl2005","accessed":{"date-parts":[[2023,1,31]]},"author":[{"family":"Lauf","given":"J."},{"family":"Calhoun","given":"M."},{"family":"Diener","given":"W."},{"family":"Gonzalez","given":"J."},{"family":"Kirk","given":"A."},{"family":"Kuhnle","given":"P."},{"family":"Tucker","given":"B."},{"family":"Kirby","given":"C."},{"family":"Tjoelker","given":"R."}],"citation-key":"LaufEtAl2005","container-title":"Proceedings of the 2005 IEEE International Frequency Control Symposium and Exposition, 2005.","DOI":"10.1109/FREQ.2005.1574041","event-place":"Vancouver, BC","event-title":"2005 IEEE International Frequency Control Symposium and Exhibition","ISBN":"978-0-7803-9053-9","issued":{"date-parts":[[2005]]},"page":"830-835","publisher":"IEEE","publisher-place":"Vancouver, BC","source":"DOI.org (Crossref)","title":"Clocks and timing in the NASA deep space network","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/1574041/"},
  {"id":"LawEtAl2021","abstract":"The Line of Sight (LoS) is one of the latest tools to join the analytics suite of tools for the Solar System Treks (https://trek.nasa.gov) portals.  The LoS tool provides a way to compute visibility between the entities in our solar system. More concretely, this utility searches for windows of communication or a “line of sight” between any two entities. Entities include orbiters, rovers, planetary bodies, ground stations, and other topographical locations. In addition to establishing communications between the two entities, the tool also takes into account local terrains of the entities in question.\n\nThe software seeks to answer questions about establishing communications between a rover and an orbiter, or an orbiter to a ground station. In mission planning, LoS can be used to determine possible traverses for a rover that must maintain communications with a lander, or find time intervals of communication to an orbiter when a rover or lander are near an obstructing surface feature such as a crater rim or mound. Computations can be even more granular and lines of sight can be computed between mission instruments, thus allowing to ask questions such as “Is the High Gain Antenna on a rover visible from an orbiter?”\n\nThe initial release of the software focuses on the lunar surface and the LRO spacecraft. Users can ask whether a topographical location on the moon is visible from the orbiter or a discrete set of ground stations on Earth. The tool uses NAIF SPICE and various mission kernels for computing planetary geometries. LoS also uses high resolution Digital Elevation Model (DEM) to model the terrain surrounding the points of interest. In-house software is used to convert high resolution DEMs into a format compatible with the tool. Users can provide their own DEMs to model the terrain on different topographical locations to use for their own computations.","accessed":{"date-parts":[[2023,8,12]]},"author":[{"family":"Law","given":"Emily"},{"family":"Gallegos","given":"Natalie"},{"family":"Malhotra","given":"Shan"}],"citation-key":"LawEtAl2021","DOI":"10.5194/epsc2021-150","issued":{"date-parts":[[2021,6,28]]},"language":"en","number":"EPSC2021-150","publisher":"Copernicus Meetings","source":"meetingorganizer.copernicus.org","title":"Line of Sight Analysis","type":"report","URL":"https://meetingorganizer.copernicus.org/EPSC2021/EPSC2021-150.html"},
  {"id":"Levine1997","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Levine","given":"Judah"}],"citation-key":"Levine1997","container-title":"NIST","issued":{"date-parts":[[1997,1,1]]},"language":"en","note":"Last Modified: 2017-02-17T12:37-05:00","page":"399-402","publisher":"Judah Levine","source":"www.nist.gov","title":"Panel Discussion on Time Rollover Events and Leap Seconds","type":"article-journal","URL":"https://www.nist.gov/publications/panel-discussion-time-rollover-events-and-leap-seconds"},
  {"id":"Levine2008","abstract":"A time scale is a procedure for combining the data from an ensemble of clocks or frequency standards. The input data to the ensemble algorithm are generally the time (or frequency) differences between each of the members and the reference device for the system. Therefore, the overall time and frequency of the ensemble are free parameters and must be continuously adjusted using external data and a steering algorithm. In addition, the outputs of the procedure are the average time and frequency of the group and the characteristics of each device (time, frequency, frequency aging, prediction error, etc.) with respect to this average, and a second job of the steering algorithm is to realize this computed average time and frequency in a physical device. I will discuss the considerations that govern the design of steering algorithms in general. I will illustrate these considerations using the algorithms that realize UTC (NIST) from the ensemble average of the time differences of the cesium standards and hydrogen masers that are located at the NIST laboratory in Boulder. I will also discuss the design of the steering of the backup for UTC (NIST), which is based on an ensemble of cesium standards located at the NIST radio station in Fort Collins. The backup time scale is intended to support the NIST services should the primary time scale become unavailable, so that it must track UTC (NIST) as closely as possible, which implies a tight coupling between the two scales. At the same time, it must remain independent of UTC (NIST) so that it does not fail if its external reference becomes unavailable, which implies a loose coupling. I will discuss the actual design, which is a compromise between these two incompatible requirements.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Levine","given":"Judah"}],"citation-key":"Levine2008","event-title":"Proceedings of the 40th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2008,12,4]]},"language":"en","page":"205-218","source":"www.ion.org","title":"Steering a Time Scale","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=10635"},
  {"id":"Levine2011","abstract":"The National Institute of Standards and Technology (NIST) currently operates 35 public network time servers that are located at many different sites in the United States. The servers provide time messages over the public Internet in a number of different formats. The times are derived from the NIST atomic clock ensemble in Boulder, Colorado, and are directly traceable to UTC(NIST). The time servers currently receive about 7×10^9 requests per day, and the number of requests is increasing by a compounded rate of about 5% per month. I have continued to work on methods of improving the performance of the ensemble of servers so as to be able to support this increasing demand without a corresponding increase in the number of servers. My current efforts involve studies of replacing the phase lock and frequency lock synchronization algorithms with methods based on Kalman filters, and I will report on my latest results. A method based on Kalman filters has an advantage in principle, since these kinds of algorithms support more sophisticated noise models than can be used by the existing synchronization procedures. However, it is not easy to realize this advantage, because the real noise is generally not stationary and is not well characterized in statistical terms. I have experimented with addressing this problem by adding periodic or quasi-periodic terms to the covariance matrix of the process, and I will show the improvement that I have realized using these methods. The algorithms have two advantages over many other implementations. The more sophisticated noise models mean that the same performance can be realized by the use of a longer interval between requests. This is a significant advantage, since it directly improves the level of service that can be provided with a given number of systems. The ensemble is independent of the GPS satellites and requires no outside antennas. It is therefore more robust and more difficult to jam.","accessed":{"date-parts":[[2023,4,11]]},"author":[{"family":"Levine","given":"Judah"}],"citation-key":"Levine2011","event-title":"Proceedings of the 43rd Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2011,11,17]]},"language":"en","page":"71-80","source":"www.ion.org","title":"Synchronizing Computer Clocks by the Use of Kalman Filters","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=10775"},
  {"id":"Levine2016","accessed":{"date-parts":[[2022,12,27]]},"author":[{"family":"Levine","given":"Judah"}],"citation-key":"Levine2016","container-title":"IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control","container-title-short":"IEEE Trans. Ultrason., Ferroelect., Freq. Contr.","DOI":"10.1109/TUFFC.2015.2495014","ISSN":"0885-3010","issue":"4","issued":{"date-parts":[[2016,4]]},"page":"561-570","source":"DOI.org (Crossref)","title":"An Algorithm for Synchronizing a Clock When the Data Are Received Over a Network With an Unstable Delay","type":"article-journal","URL":"http://ieeexplore.ieee.org/document/7307699/","volume":"63"},
  {"id":"LewandowskiEtAl1999","abstract":"The Global Positioning System (GPS) is not only a navigation system, it is also a time-transfer system. As a time-transfer system it provides stability very close to one part in ten to the fourteenth over one day (1 ns/day). After a brief introduction to timekeeping terms, this paper reviews the role of GPS in time distribution and clock synchronization. The GPS coarse acquisition (C/A)-code single-frequency single-channel (one satellite) common-view (CV) time transfer is then discussed. Special consideration is given to progress in GPS C/A-code CV time and frequency transfer through the use of \"all-in-view\" multichannel receivers. This technique increases the number of daily observations by a factor of ten relative to conventional single-channel receivers and results in an improvement in time and frequency transfer stability by a factor of about three. Other important improvements discussed are the use of GPS carrier phase measurements and temperature-stabilized antennas. The latter reduce the daily and seasonal delay variations of GPS time-receiving equipment. The use of GLONASS as a complementary tool to GPS time transfer is also be reported. These improvements indicate that GPS, as a time-transfer system, should provide the capability to reach a stability of one part in ten to the sixteenth over one day (10 ps/day).","author":[{"family":"Lewandowski","given":"W."},{"family":"Lewandowski","given":"W."},{"family":"Azoubib","given":"J."},{"family":"Klepczynski","given":"W.J."},{"family":"Klepczynski","given":"W. J."}],"citation-key":"LewandowskiEtAl1999","DOI":"10.1109/5.736348","issue":"1","issued":{"date-parts":[[1999,1,1]]},"note":"MAG ID: 2135048896","page":"163-172","title":"GPS: primary tool for time transfer","type":"article-journal","volume":"87"},
  {"id":"LindenEtAl2023","abstract":"The establishment of a local lunar time standard or a shared and openly accessible reference timing signal can greatly enhance the positioning, navigation, and timing (PNT) capabilities of lunar missions without the need for direct links to Earth or precision instruments to be a requirement for every mission to the Moon. This paper proposes the concept of a local lunar time standard that can be accessed using technology that is likely to be included in most lunar missions for nominal activities. Even if the local lunar time standard exhibits drift or variations from terrestrial time, its existence would be a significant step towards lunar coordination. Unlike terrestrial synchronized time, a fully usable lunar reference time can be implemented proactively before the activity that necessitates it occurs. This paper discusses the potential benefits and challenges of establishing a local lunar time standard and its implications for lunar missions, including its compatibility with existing lunar initiatives such as LunaNet, Moonlight, and upcoming lunar missions. The proposal highlights the opportunities and considerations for stakeholders in the cislunar ecosystem, including options for missions to ignore, participate in seeding, or consume the proposed timekeeping protocol. The proposal is expected to contribute to the evolving landscape of timekeeping technologies and methods in cislunar space, and stimulate further research and discussion on this topic.","author":[{"family":"Linden","given":"Philip"},{"family":"Jardine","given":"Samuel"},{"family":"Schingler","given":"Jessy Kate"}],"citation-key":"LindenEtAl2023","DOI":"10.13140/RG.2.2.29175.70564","issued":{"date-parts":[[2023,4,1]]},"publisher":"Open Lunar Foundation","source":"ResearchGate","title":"Possibilities for a Local Lunar Time Standard","type":"report"},
  {"id":"M.D.LemmonEtAl2000","abstract":"This paper examines a clock synchronization algorithm in which processors identify dynamic models of neighboring processor clocks. These models are then used as signature functions to develop a clock synchronization algorithm that functions in the presence of drifting clocks.","author":[{"literal":"M.D. Lemmon"},{"family":"Lemmon","given":"Michael D."},{"literal":"M.D. Lemmon"},{"family":"Ganguly","given":"J."},{"family":"Xia","given":"L."}],"citation-key":"M.D.LemmonEtAl2000","DOI":"10.1109/prdc.2000.897300","issued":{"date-parts":[[2000,12,18]]},"note":"MAG ID: 2164889758","page":"177-184","title":"Model-based clock synchronization in networks with drifting clocks","type":"article-journal"},
  {"id":"MalladaEtAl2012","abstract":"This paper examines synchronization of computer clocks connected via a data network and proposes a skewless algorithm to synchronize them. Unlike existing solutions, which either estimate and compensate the frequency difference (skew) among clocks or introduce offset corrections that can generate jitter and possibly even backward jumps, our algorithm achieves synchronization without these problems. We first analyze the convergence property of the algorithm and provide necessary and sufficient conditions on the parameters to guarantee synchronization. We then implement our solution on a cluster of IBM BladeCenter servers running Linux and study its performance. In particular, both analytically and experimentally, we show that our algorithm can converge in the presence of timing loops. This marks a clear contrast with current standards such as NTP and PTP, where timing loops are specifically avoided. Furthermore, timing loops can even be beneficial in our scheme. For example, it is demonstrated that highly connected subnetworks can collectively outperform individual clients when the time source has large jitter. It is also experimentally demonstrated that our algorithm outperforms other well-established software-based solutions such as the NTPv4 and IBM Coordinated Cluster Time (IBM CCT).","author":[{"family":"Mallada","given":"Enrique"},{"family":"Meng","given":"Xiaoqiao"},{"family":"Hack","given":"Michel H. T."},{"literal":"Li Zhang"},{"family":"Zhang","given":"Li"},{"family":"Tang","given":"Ao"}],"citation-key":"MalladaEtAl2012","container-title":"arXiv: Optimization and Control","issued":{"date-parts":[[2012,8,28]]},"note":"MAG ID: 2066965328","title":"Skewless Network Clock Synchronization","type":"article-journal"},
  {"id":"MalladaTang2011","abstract":"Distributed synchronization has gradually gained importance over the last two decades. The ad-hoc nature of new applications has increased the need for robust and scalable distributed algorithms that are capable of generating high precision timing information. However, current solutions usually produce phase errors when the frequencies are heterogeneous. This paper proposes a distributed synchronization procedure that can achieve consensus in both frequency and phase. The algorithm uses only local information and is robust to frequency heterogeneity and network topology. A sufficient condition for global convergence is shown by leveraging recent results on coupled oscillators. We further characterize an invariant constant of the algorithm that relates the limiting frequency ω* with the harmonic mean of the clocks' natural frequencies. Simulations are provided to illustrate and verify these properties.","author":[{"family":"Mallada","given":"Enrique"},{"family":"Tang","given":"Ao"}],"citation-key":"MalladaTang2011","DOI":"10.1109/cdc.2011.6161231","issued":{"date-parts":[[2011,12,1]]},"note":"MAG ID: 2049662047","page":"6742-6747","title":"Distributed clock synchronization: Joint frequency and phase consensus","type":"article-journal"},
  {"id":"MalmstromEtAl2006","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Malmström","given":"Richard"},{"family":"Lo","given":"Amy"},{"family":"Brown","given":"Nathan"},{"family":"Haney","given":"George"}],"citation-key":"MalmstromEtAl2006","collection-title":"AIAA SPACE Forum","container-title":"Space 2006","DOI":"10.2514/6.2006-7453","issued":{"date-parts":[[2006,9,19]]},"publisher":"American Institute of Aeronautics and Astronautics","source":"arc.aiaa.org (Atypon)","title":"Continuous Communications to the Moon's South Pole","type":"chapter","URL":"https://arc.aiaa.org/doi/10.2514/6.2006-7453"},
  {"id":"Martin2022","abstract":"Félix E. Martín spoke to CEBRI-Journal editors","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Martín","given":"Félix E."}],"citation-key":"Martin2022","issued":{"date-parts":[[2022,6,6]]},"language":"en","medium":"CEBRI","title":"The world is in a new phase of multipolar competition with strong overtones from the U.S.-China bilateral rivalry","type":"interview","URL":"https://cebri.org/revista/en/artigo/38/the-world-is-in-a-new-phase-of-multipolar-competition-with-strong-overtones-from-the-us-china-bilateral-rivalry"},
  {"id":"McPheeEtAl2022","abstract":"This paper introduces a new statistical model for clock phases assuming a multivariate Gaussian distribution for the clock phase deviations from a common time scale. This model allows us to derive a maximum likelihood estimator for the clock phases, which is consistent with the current methods of computing a common time scale for a collection of clocks. Detailing a statistical model of the clock phases, which assumes a Gaussian distribution allows us to find the MLE for each clock’s phase deviation from a common time scale. For verification, the MLE for the clock phases is shown to be consistent with the result of the existing basic time scale equation. The statistical distribution of the frequency states resulting from this statistical model is Gaussian over a window of past time instants. This property can be used to design a new time scale based on the maximum likelihood estimator of frequency and frequency variances that are alternatives to the exponential filters designed for AT1. With the appropriate number of past frequency samples, this MLE has identical performance to the optimal AT1 algorithm in a nominal context. The statistical distribution of the frequency when the clock suffers a phase jump anomaly is then identified as a Student’s t-distribution. The Student’s t-distribution models the statistics of datasets contaminated by outliers, leading to the derivation of a different MLE that is robust to those outliers. The time scale using the robust MLE provides estimates of each clock’s frequency and frequency variance that are unaffected by phase jump anomalies and improves the long-term frequency stability when each clock in the ensemble experiences phase jump anomalies within some window of time.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"McPhee","given":"Hamish"},{"family":"Tourneret","given":"Jean-Yves"},{"family":"Valat","given":"David"},{"family":"Paimblanc","given":"Philippe"},{"family":"Delporte","given":"Jérome"},{"family":"Grégoire","given":"Yoan"}],"citation-key":"McPheeEtAl2022","DOI":"10.33012/2023.18701","event-title":"Proceedings of the 54th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2022,1,26]]},"language":"en","page":"61-75","source":"www.ion.org","title":"A Robust Time Scale Based on Maximum Likelihood Estimation","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=18701"},
  {"id":"MelleJ1995","abstract":"This paper is an update of the on-orbit operational performance of the frequency standards on the last Block I NAVSTAR satellite (GPS-10), the complete Bloc II NAVSTAR satellites (GPS-13 to 21) and the Block IIA NAVSTAR (GPS-22 to 40) satellites. Since the status of the GPS constellation is now at Full Operational Capability (FOC), a minimum of twenty-four satellites are in position with all the necessary tests successfully completed. The evolution of frequency standards on board the GPS vehicles will be presented with corresponding results. Various methods and techniques will be presented to show on-orbit life time, down time, state of health telemetry, on-orbit trending and characterization of all the frequency standards. Other topics such as reliability, stability, clock quirks and idiosyncrasies of each vehicle will be covered.","accessed":{"date-parts":[[2023,4,11]]},"author":[{"family":"Melle","given":"Van"},{"family":"J","given":"M."}],"citation-key":"MelleJ1995","event-title":"Proceedings of the 27th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[1995,12,1]]},"language":"en","page":"167-180","source":"www.ion.org","title":"Cesium and Rubidium Frequency Standards Status and Performance on the GPS Program","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=14262"},
  {"id":"MillerEtAl2007","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Miller","given":"James J."},{"literal":"Al Gifford"},{"family":"Brodsky","given":"Beryl"},{"family":"Oria","given":"A. J."},{"family":"Nelson","given":"Robert A."},{"family":"Orr","given":"Richard S."},{"family":"Felton","given":"Larry"},{"literal":"Lee Pitts"},{"family":"VanLandingham","given":"Frank"},{"family":"Welch","given":"Bryan"}],"citation-key":"MillerEtAl2007","container-title":"2007 IEEE International Frequency Control Symposium Joint with the 21st European Frequency and Time Forum","DOI":"10.2514/6.2008-3229","event-place":"Geneva, Switzerland","event-title":"2007 IEEE International Frequency Control Symposium Joint with the 21st European Frequency and Time Forum","ISBN":"978-1-4244-0646-3 978-1-4244-0647-0","ISSN":"1075-6787","issued":{"date-parts":[[2007,5]]},"page":"1299-1303","publisher":"IEEE","publisher-place":"Geneva, Switzerland","source":"DOI.org (Crossref)","title":"NASA Architecture for Solar System Time Distribution","type":"paper-conference","URL":"http://ieeexplore.ieee.org/document/4319286/"},
  {"id":"Mills1991","abstract":"The network time protocol (NTP), which is designed to distribute time information in a large, diverse system, is described. It uses a symmetric architecture in which a distributed subnet of time servers operating in a self-organizing, hierarchical configuration synchronizes local clocks within the subnet and to national time standards via wire, radio, or calibrated atomic clock. The servers can also redistribute time information within a network via local routing algorithms and time daemons. The NTP synchronization system, which has been in regular operation in the Internet for the last several years, is described, along with performance data which show that timekeeping accuracy throughout most portions of the Internet can be ordinarily maintained to within a few milliseconds, even in cases of failure or disruption of clocks, time servers, or networks. >","author":[{"family":"Mills","given":"David L."}],"citation-key":"Mills1991","container-title":"IEEE Transactions on Communications","DOI":"10.1109/26.103043","issue":"10","issued":{"date-parts":[[1991,10,1]]},"note":"MAG ID: 2170715240","page":"1482-1493","title":"Internet time synchronization: the network time protocol","type":"article-journal","volume":"39"},
  {"id":"Moondao2022","accessed":{"date-parts":[[2023,2,4]]},"citation-key":"Moondao2022","title":"The MoonDAO Constitution | MoonDAO Docs","type":"webpage","URL":"https://docs.moondao.com/constitution/"},
  {"id":"NASA2020","abstract":"PRINCIPLES FOR COOPERATION IN THE CIVIL EXPLORATION AND USE OF THE MOON, MARS, COMETS, AND ASTEROIDS FOR PEACEFUL PURPOSES","accessed":{"date-parts":[[2023,2,12]]},"author":[{"literal":"NASA"}],"citation-key":"NASA2020","issued":{"date-parts":[[2020,10,13]]},"title":"Artemis Accords","type":"document","URL":"https://www.nasa.gov/specials/artemis-accords/img/Artemis-Accords-signed-13Oct2020.pdf"},
  {"id":"Naseem2022","abstract":"There is an opportunity for actors interested in entering the lunar communications space to learn from the best practices of network infrastructure providers (ISPs/IXPs), as well as the open source community.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Naseem","given":"Mariam"}],"citation-key":"Naseem2022","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,1,26]]},"title":"Last-mile Analogies for a Lunar Communications Network - Open Lunar Foundation","type":"post-weblog","URL":"https://www.openlunar.org/library/last-mile"},
  {"id":"NelsonEly2006","abstract":"The measurement of time is an essential aspect of navigation. The Global Positioning System (GPS) is comprised of a constellation of satellites that transmit one-way pseudorandom noise (PRN) coded signals used for range and time measurements. The signals are referenced to onboard atomic clocks. The GPS provides a model for position determination with a precision of a few meters and time dissemination with a precision of about 10 nanoseconds. The mathematical algorithms used in the GPS receiver require the application of the principles of general relativity. Similar models will be needed for high-precision navigation in the solar system. The adoption of an appropriate coordinate system and time scale is required. This paper outlines the fundamental concepts of relativistic time transfer and describes the details of the mathematical model. The approximate magnitudes of various relativistic effects for clocks onboard the GPS satellites, other satellites in Earth orbit, and a clock on the surface of Mars or on the Moon are derived.","author":[{"family":"Nelson","given":"Robert"},{"family":"Ely","given":"Todd"}],"citation-key":"NelsonEly2006","issued":{"date-parts":[[2006,12,7]]},"source":"ResearchGate","title":"Relativistic transformations for time synchronization and dissemination in the solar system","type":"book"},
  {"id":"NewmanEtAl2019","accessed":{"date-parts":[[2022,12,27]]},"author":[{"family":"Newman","given":"Zachary L."},{"family":"Maurice","given":"Vincent"},{"family":"Drake","given":"Tara"},{"family":"Stone","given":"Jordan R."},{"family":"Briles","given":"Travis C."},{"family":"Spencer","given":"Daryl T."},{"family":"Fredrick","given":"Connor"},{"family":"Li","given":"Qing"},{"family":"Westly","given":"Daron"},{"family":"Ilic","given":"B. R."},{"family":"Shen","given":"Boqiang"},{"family":"Suh","given":"Myoung-Gyun"},{"family":"Yang","given":"Ki Youl"},{"family":"Johnson","given":"Cort"},{"family":"Johnson","given":"David M. S."},{"family":"Hollberg","given":"Leo"},{"family":"Vahala","given":"Kerry J."},{"family":"Srinivasan","given":"Kartik"},{"family":"Diddams","given":"Scott A."},{"family":"Kitching","given":"John"},{"family":"Papp","given":"Scott B."},{"family":"Hummon","given":"Matthew T."}],"citation-key":"NewmanEtAl2019","container-title":"Optica","container-title-short":"Optica","DOI":"10.1364/OPTICA.6.000680","ISSN":"2334-2536","issue":"5","issued":{"date-parts":[[2019,5,20]]},"language":"en","page":"680","source":"DOI.org (Crossref)","title":"Architecture for the photonic integration of an optical atomic clock","type":"article-journal","URL":"https://opg.optica.org/abstract.cfm?URI=optica-6-5-680","volume":"6"},
  {"id":"NiranjayanMolisch2013","abstract":"A single wireless slave node may be in a timing virtual network (TVN) with neighboring wireless slave nodes. The single wireless slave node may store information indicative of the identity, link propagation delay, and channel signature of each of its neighboring wireless slave nodes. The single wireless slave node may repeatedly update a timing estimate based on the stored information and by performing a physical layer fast reference signal broadcast transmission and reception.","author":[{"family":"Niranjayan","given":"S."},{"family":"Molisch","given":"Andreas F."}],"citation-key":"NiranjayanMolisch2013","issued":{"date-parts":[[2013,5,30]]},"note":"MAG ID: 224403929","title":"Timing synchronization of wireless networks","type":"article-journal"},
  {"id":"NovakHastings2023","abstract":"Proliferated low Earth orbit constellations are becoming more common both in reality and in planning. The resilience of these constellations to the radiation effects of adverse solar weather is of interest given that some of them pass over polar regions. This paper stochastically simulates solar weather events over the course of solar cycle 25 in order to quantify radiation effects on a model of Planet Lab’s Flock constellation under various design and programmatic decisions. The Flock constellation is a highly proliferated, commercial, and polar low Earth orbit earth observation architecture. Lifecycle and radiation failures are simulated along with a reconstitution system in order to quantify architectural performance as a function of constellation population. This time-based measure of performance is then used to quantify the constellation resilience and allow for programmatic and design variables to be altered in order to observe the effects on the resilience of proliferated constellations against adverse solar weather radiation effects. A sensitivity analysis is performed in order to assess which decisions most improve or degrade resilience. Broadly, the results show that commercial off the shelf components and programmatic decisions such as launch and manufacturing schedules may improve constellation resilience against adverse solar weather effects. More specifically, the results also show that commercial off the shelf components with even basic shielding levels provide high resilience to cumulative total ionizing dose effects and single event upset radiation effects. However, any further reductions to shielding would have significant impacts on single event upset rates whereas total ionizing dose would remain negligible. Furthermore, manufacturing time for Flock satellites is sufficient to maintain a resilient reconstitution strategy. Finally, results show that in order to improve the resilience afforded by a reconstitution strategy, improvements to manufacturing and launch times should be made in parallel, rather than one or the other in isolation.","accessed":{"date-parts":[[2023,2,19]]},"author":[{"family":"Novak","given":"Jonathan"},{"family":"Hastings","given":"Daniel"}],"citation-key":"NovakHastings2023","container-title":"Acta Astronautica","container-title-short":"Acta Astronautica","DOI":"10.1016/j.actaastro.2022.10.031","ISSN":"0094-5765","issued":{"date-parts":[[2023,1,1]]},"language":"en","page":"292-302","source":"ScienceDirect","title":"Analysis of proliferated low Earth orbit constellation resilience against solar weather radiation effects","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0094576522005823","volume":"202"},
  {"id":"NovickEtAl2022","abstract":"GPS-disciplined clocks (GPSDCs) are designed to optimize the accuracy and stability of their pulse-per-second (PPS) and frequency outputs by steering an internal oscillator to the timing solution from a GPS receiver based on the received satellite signals. The steering function uses either a frequency-lock or phase-locked loop (PLL), typically implemented with a proportional integral derivative (PID) controller. Ideally, a GPSDC will exploit the stability of its local oscillator for short intervals but derive its long-term accuracy and stability from the GPS system's delivered prediction of UTC(USNO), the Coordinated Universal Time (UTC) scale maintained by the United States Naval Observatory (USNO). The output frequency of both quartz and rubidium oscillators is affected by changes in external environmental conditions, primarily temperature. Therefore, it would not be expected that the optimal steering function in the steady state would also be optimal during rapid variations of environmental conditions surrounding the device. We report the observed behavior of several commercially available GPSDCs while they are subjected to rapid temperature variations and discuss potential modifications that might make them less sensitive to these variations.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Novick","given":"Andrew"},{"family":"Lombardi","given":"Michael A."},{"family":"Matsakis","given":"Demetrios"},{"family":"Clark","given":"John"}],"citation-key":"NovickEtAl2022","DOI":"10.33012/2023.18695","event-title":"Proceedings of the 54th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2022,1,26]]},"language":"en","page":"10-14","source":"www.ion.org","title":"Measurement of Transient Environmental Effects in GPS-Disciplined Clocks","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=18695"},
  {"id":"OaksEtAl2003","abstract":"The Naval Research Laboratory (NRL) conducts comprehensive analyses of the Global Positioning System (GPS) atomic frequency standards under the sponsorship of the GPS Joint Program Office (JPO) and in cooperation with the 2nd Space Operations Squadron (2SOPS) at the Master Control Station (MCS) in Colorado Springs, Colorado. The purpose of the analyses is to determine the performance of the timing signals originating with the atomic frequency standards carried aboard the space vehicles. Metrics used in the analyses and presented in this paper include frequency, drift, and stability histories and stability profiles based on the Allan and Hadamard variances. Also presented in this paper are comparisons of performance based on the broadcast as well as the precise post-fit ephemerides.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Oaks","given":"Jay"},{"family":"Senior","given":"Ken"},{"family":"Largay","given":"Marie M."},{"family":"Reid","given":"Wilson G."},{"family":"Warren","given":"Hugh"},{"family":"Buisson","given":"James A."}],"citation-key":"OaksEtAl2003","event-title":"Proceedings of the 35th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2003,12,4]]},"language":"en","page":"173-184","source":"www.ion.org","title":"Global Positioning System Constellation Clock Performance","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=13891"},
  {"id":"Obleukhov2021","abstract":"Facebook engineers built and open sourced an Open Compute Time Appliance, an important component of the modern timing infrastructure.","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Obleukhov","given":"Ahmad Byagowi","suffix":"Oleg"}],"citation-key":"Obleukhov2021","container-title":"Engineering at Meta","issued":{"date-parts":[[2021,8,11]]},"language":"en-US","title":"Open-sourcing a more precise time appliance","type":"post-weblog","URL":"https://engineering.fb.com/2021/08/11/open-source/time-appliance/"},
  {"id":"OgbeFerguson2023","author":[{"family":"Ogbe","given":"Dennis"},{"family":"Ferguson","given":"Michael I"}],"citation-key":"OgbeFerguson2023","event-place":"Big Sky, MT, USA","event-title":"2023 IEEE Aerospace Conference","issued":{"date-parts":[[2023,3]]},"publisher":"IEEE","publisher-place":"Big Sky, MT, USA","title":"Passive positioning, navigation, and timing (PPNT) in cislunar space using earth-based transmitters","type":"paper-conference"},
  {"id":"ONeill2021","abstract":"Geared toward improving spacecraft navigation, the technology demonstration operated far longer than planned and broke the stability record for atomic clocks in space.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"O’Neill","given":"Ian J."}],"citation-key":"ONeill2021","container-title":"NASA Jet Propulsion Laboratory (JPL)","issued":{"date-parts":[[2021,7,21]]},"language":"en-US","title":"Working Overtime: NASA’s Deep Space Atomic Clock Completes Mission","title-short":"Working Overtime","type":"post-weblog","URL":"https://www.jpl.nasa.gov/news/working-overtime-nasas-deep-space-atomic-clock-completes-mission"},
  {"id":"OngaroOusterhout2014","abstract":"Raft is a consensus algorithm for managing a replicated log. It produces a result equivalent to (multi-)Paxos, and it is as efﬁcient as Paxos, but its structure is different from Paxos; this makes Raft more understandable than Paxos and also provides a better foundation for building practical systems. In order to enhance understandability, Raft separates the key elements of consensus, such as leader election, log replication, and safety, and it enforces a stronger degree of coherency to reduce the number of states that must be considered. Results from a user study demonstrate that Raft is easier for students to learn than Paxos. Raft also includes a new mechanism for changing the cluster membership, which uses overlapping majorities to guarantee safety.","author":[{"family":"Ongaro","given":"Diego"},{"family":"Ousterhout","given":"John"}],"citation-key":"OngaroOusterhout2014","issued":{"date-parts":[[2014,5,20]]},"language":"en","source":"Zotero","title":"In Search of an Understandable Consensus Algorithm","type":"article-journal"},
  {"id":"PallecMichelLeEtAl2009","abstract":"A method is intended for synchronizing a client clock (CC) of a client communication node (N2) with a master clock (MC) in a data packet network. This method comprises the steps of: i) transmitting first data representative of timing information of the master clock (MC) from a source communication node (N1 ) to the client communication node (N2) via a time distribution protocol, ii) transmitting second data representative of a frequency reference correlated to the timing information from a chosen communication node (N3) to the client communication node (N2) via a time distribution protocol, and iii) differentiating the transmitted first and/or second data into the client communication node (N2) to synchronize the client clock (CC) with the master clock (MC) by means of the timing information and/or frequency reference represented by the differentiated first and second data.","author":[{"literal":"Pallec Michel Le"},{"family":"Le Pallec","given":"Michel"},{"literal":"Jean-Loup Ferrant"}],"citation-key":"PallecMichelLeEtAl2009","issued":{"date-parts":[[2009,3,12]]},"note":"MAG ID: 1009828510","title":"Method for synchronizing clocks by seperated transmissions of first and second data via at least one timing distribution protocol, and associated system and module","type":"article-journal"},
  {"id":"ParkerEtAl2022","abstract":"The Lunar GNSS Receiver Experiment (LuGRE) is a joint NASA-Italian Space Agency (ASI) payload on the Firefly Blue Ghost Mission 1 (BGM1) with the goal to demonstrate GNSS-based positioning, navigation, and timing at the Moon. LuGRE was chosen by the NASA Commercial Lunar Payload Services (CLPS) program as one of ten payloads on its “19D” task order for delivery to the lunar surface in 2023.","accessed":{"date-parts":[[2023,4,27]]},"author":[{"family":"Parker","given":"Joel J.K."},{"family":"Dovis","given":"Fabio"},{"family":"Anderson","given":"Benjamin"},{"family":"Ansalone","given":"Luigi"},{"family":"Ashman","given":"Benjamin"},{"family":"Bauer","given":"Frank H."},{"family":"D’Amore","given":"Giuseppe"},{"family":"Facchinetti","given":"Claudia"},{"family":"Fantinato","given":"Samuele"},{"family":"Impresario","given":"Gabriele"},{"family":"McKim","given":"Stephen A."},{"family":"Miotti","given":"Efer"},{"family":"Miller","given":"James J."},{"family":"Musmeci","given":"Mario"},{"family":"Pozzobon","given":"Oscar"},{"family":"Schlenker","given":"Lauren"},{"family":"Tuozzi","given":"Alberto"},{"family":"Valencia","given":"Lisa"}],"citation-key":"ParkerEtAl2022","DOI":"10.33012/2022.18199","event-place":"Long Beach, California","event-title":"2022 International Technical Meeting of The Institute of Navigation","issued":{"date-parts":[[2022,2,14]]},"language":"en","page":"420-437","publisher-place":"Long Beach, California","source":"DOI.org (Crossref)","title":"The Lunar GNSS Receiver Experiment (LuGRE)","type":"paper-conference","URL":"https://www.ion.org/publications/abstract.cfm?articleID=18199"},
  {"id":"PasqualeEtAl2022","abstract":"The last decade saw a renewed interest on the Moon as a well suited training premise in preparation to manned mission to Mars, but also as an interesting target itself, for scientific investigations, technological developments and new markets opportunities. As a result, numerous and very different missions to the Moon are currently being studied and implemented, assuming to have our satellite quite crowded soon. Such a scenario motivates the settling of space infrastructures to offer recurrent services like data relays, communication links and navigation in the cislunar environment which would facilitate and enlighten the single mission’s implementation and operation. The paper presents the strategy adopted to address the design of the orbital configuration for a distributed architecture to answer the communication and navigation needs to serve at the best the diversified lunar missions scenario expected for the next decades. First, a set of parameters of merit are identified and explained in their mathematical expression and physical meaning. Then, different regions of interest for possible future missions are identified and mapped to the relevant performances wanted for that specific region. Last a Multi-Objective Optimisation framework is presented, both in the exploited genotype and the different objectives participating to the definition of the cost function, in order to provide a versatile tool. The paper critically discusses the effectiveness of the proposed approach in detecting the best suited distributed orbital architectures for the servicers according to the expected service performance in specific user regions, spread all over the Earth–Moon volume — from Earth vicinity to Lunar surface, considering also robustness aspects. The benefits in the exploitation of the multibody dynamical regime offered by the Earth–Moon system to set up the most promising orbital set with a minimum number of servicing spacecraft are underlined as well.","accessed":{"date-parts":[[2023,3,27]]},"author":[{"family":"Pasquale","given":"Andrea"},{"family":"Zanotti","given":"Giovanni"},{"family":"Prinetto","given":"Jacopo"},{"family":"Ceresoli","given":"Michele"},{"family":"Lavagna","given":"Michèle"}],"citation-key":"PasqualeEtAl2022","container-title":"Acta Astronautica","container-title-short":"Acta Astronautica","DOI":"10.1016/j.actaastro.2022.06.004","ISSN":"0094-5765","issued":{"date-parts":[[2022,10,1]]},"language":"en","page":"345-354","source":"ScienceDirect","title":"Cislunar distributed architectures for communication and navigation services of lunar assets","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0094576522002831","volume":"199"},
  {"id":"PatmasariEtAl2018","abstract":"To communicate with the ground station, nano satellite requires a communication system that serves in real time to regulate the procedure with ground station. One of the missions of nano satellites is the retrieval of telemetry data from sensors that transmitted using APRS technology (Automatic Packet Reporting System). We designed a prototype to monitor sensor by utilizing the APRS. Real-time sensor data was transmitted to monitor through radio using AX.25 protocol. On the transmitter side, an APRS Tracker integrated with a microprocessor ATMEGA 1284P to modulate the AFSK signal. The existence of this AFSK signal is used to transmit and receive telemetry data using handy talky. We use a computer with AGWPE software to demodulate the AFSK signal and UI-View32 to show the telemetry data. The results showed that the telemetry data can be displayed on the receiver side and acquired in real time. The accuracy of temperature sensor received by the receiver is 92.97%, and humidity sensor is 90.57%. There was a delay of 1 second for the reception of telemetry data directly.","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Patmasari","given":"Raditiana"},{"family":"Wijayanto","given":"Inung"},{"family":"Deanto","given":"R. S."},{"family":"Gautama","given":"Y. P."},{"family":"Vidyaningtyas","given":"Hurianti"}],"citation-key":"PatmasariEtAl2018","container-title":"Journal of Measurements, Electronics, Communications, and Systems","container-title-short":"JMECS","DOI":"10.25124/jmecs.v4i1.1692","ISSN":"2477-7986, 2477-7994","issue":"1","issued":{"date-parts":[[2018,6,30]]},"page":"1","source":"DOI.org (Crossref)","title":"Design and Realization of Automatic Packet Reporting System (APRS) for Sending Telemetry Data in Nano Satellite Communication System","type":"article-journal","URL":"http://journals.telkomuniversity.ac.id/jmecs/article/view/1692","volume":"4"},
  {"id":"Pedersen2011","accessed":{"date-parts":[[2023,2,12]]},"author":[{"literal":"Pedersen"}],"citation-key":"Pedersen2011","container-title":"Victorian Studies","container-title-short":"Victorian Studies","DOI":"10.2979/victorianstudies.53.2.321","ISSN":"00425222","issue":"2","issued":{"date-parts":[[2011]]},"page":"321","source":"DOI.org (Crossref)","title":"The Empire Project: The Rise and Fall of the British World-System, 1830––1970, by John Darwin","title-short":"The Empire Project","type":"article-journal","URL":"https://www.jstor.org/stable/10.2979/victorianstudies.53.2.321","volume":"53"},
  {"id":"PetitEtAl2015","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Petit","given":"Gérard"},{"family":"Arias","given":"Felicitas"},{"family":"Panfilo","given":"Gianna"}],"citation-key":"PetitEtAl2015","container-title":"Comptes Rendus Physique","container-title-short":"Comptes Rendus Physique","DOI":"10.1016/j.crhy.2015.03.002","ISSN":"16310705","issue":"5","issued":{"date-parts":[[2015,6]]},"language":"en","page":"480-488","source":"DOI.org (Crossref)","title":"International atomic time: Status and future challenges","title-short":"International atomic time","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S1631070515000535","volume":"16"},
  {"id":"Petro2020","abstract":"One of the key capabilities needed for performing long-duration missions on the lunar surface is survival, and ultimately operational viability, through the lunar night. The fourteen Earth days of continuous darkness and extreme cold experienced at most locations on the Moon, plus the lack of a moderating atmosphere, presents one of the most demanding environmental challenge that will be faced in the exploration of the solar system. This paper will summarize the results of a NASA-sponsored workshop on this subject that was held in November 2018. The workshop discussions covered the environmental challenges of the lunar night and the implications for the range of science, exploration, and commercial activities planned for the Moon. Previous missions and their experiences with surviving the night are also described. A variety of technology solutions and operational strategies for night survival and operations will be outlined.","author":[{"family":"Petro","given":"Andrew"}],"citation-key":"Petro2020","container-title":"2020 IEEE Aerospace Conference","DOI":"10.1109/AERO47225.2020.9172730","event-title":"2020 IEEE Aerospace Conference","ISSN":"1095-323X","issued":{"date-parts":[[2020,3]]},"page":"1-6","source":"IEEE Xplore","title":"Surviving and Operating Through the Lunar Night","type":"paper-conference"},
  {"id":"Prados2013","abstract":"White Rabbit (WR) is a fully deterministic Ethernet-based network for general data transfer and synchronization, which is based on Synchronous Ethernet, clock loopback phase measurement and PTP. Currently the synchronization of the clocks throughout the network is achieved using WR Switches, two-step Boundary Clocks (BC). This paper describes a White Rabbit Transparent Clock (TC) and shows the performance of a prototype implementation.","author":[{"family":"Prados","given":"Cesar"}],"citation-key":"Prados2013","container-title":"2013 IEEE International Symposium on Precision Clock Synchronization for Measurement, Control and Communication (ISPCS) Proceedings","DOI":"10.1109/ISPCS.2013.6644756","event-title":"2013 IEEE International Symposium on Precision Clock Synchronization for Measurement, Control and Communication (ISPCS) Proceedings","ISSN":"1949-0313","issued":{"date-parts":[[2013,9]]},"page":"13-17","source":"IEEE Xplore","title":"White Rabbit Transparent Clock","type":"paper-conference"},
  {"id":"Puig-SuariEtAl2001","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Puig-Suari","given":"J."},{"family":"Turner","given":"C."},{"family":"Ahlgren","given":"W."}],"citation-key":"Puig-SuariEtAl2001","container-title":"2001 IEEE Aerospace Conference Proceedings (Cat. No.01TH8542)","DOI":"10.1109/AERO.2001.931726","event-place":"Big Sky, MT, USA","event-title":"2001 IEEE Aerospace Conference Proceedings","ISBN":"978-0-7803-6599-5","issued":{"date-parts":[[2001]]},"page":"1/347-1/353","publisher":"IEEE","publisher-place":"Big Sky, MT, USA","source":"DOI.org (Crossref)","title":"Development of the standard CubeSat deployer and a CubeSat class PicoSatellite","type":"paper-conference","URL":"http://ieeexplore.ieee.org/document/931726/","volume":"1"},
  {"id":"QuEtAl2021","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Qu","given":"Zhi"},{"family":"Wu","given":"Ningjing"},{"family":"Chen","given":"Jianyun"}],"citation-key":"QuEtAl2021","container-title":"2021 2nd International Conference on Electronics, Communications and Information Technology (CECIT)","DOI":"10.1109/CECIT53797.2021.00029","event-place":"Sanya, China","event-title":"2021 2nd International Conference on Electronics, Communications and Information Technology (CECIT)","ISBN":"978-1-66543-757-8","issued":{"date-parts":[[2021,12]]},"page":"122-127","publisher":"IEEE","publisher-place":"Sanya, China","source":"DOI.org (Crossref)","title":"A Precision Clock Synchronization Method of Satellite Constellation Network Based on IEEE 1588 Protocol","type":"paper-conference","URL":"https://ieeexplore.ieee.org/document/9741972/"},
  {"id":"Quintero2023","accessed":{"date-parts":[[2023,5,9]]},"author":[{"family":"Quintero","given":"Chuck"}],"citation-key":"Quintero2023","event-place":"LSIC Extreme Access Focus Group Monthly Meeting","issued":{"date-parts":[[2023,4,14]]},"publisher-place":"LSIC Extreme Access Focus Group Monthly Meeting","title":"Conceptual Design for Communications Network for Earth-Lunar Communications","type":"speech","URL":"https://lsic-wiki.jhuapl.edu/display/EA/14+April+2023"},
  {"id":"Rabotin2023","abstract":"Kani is a verification tool that can help you systematically test properties about your Rust code. To learn more about Kani, check out the Kani tutorial and our previous blog posts.","accessed":{"date-parts":[[2023,4,11]]},"author":[{"family":"Rabotin","given":"Christopher"}],"citation-key":"Rabotin2023","container-title":"Kani Rust Verifier Blog","issued":{"date-parts":[[2023,3,31]]},"language":"en","title":"How Kani helped find bugs in Hifitime","type":"post-weblog","URL":"https://model-checking.github.io//kani-verifier-blog/2023/03/31/how-kani-helped-find-bugs-in-hifitime.html"},
  {"id":"RazaEtAl2022","abstract":"The prospect of mankind returning to the Moon has garnered a great amount of attention in recent years. Dozens of lunar missions are planned for the coming decade which will require the development of a sustainable communication infrastructure with high data rates and minimal latency. Space communication systems thus far have relied on Radio Frequency (RF) links alone, but recent developments in laser communications have demonstrated that Free Space Optical (FSO) links can achieve much higher data rates. Upon considering the respective benefits and drawbacks of RF and FSO links, we make a case for the integration of these two technologies into a hybrid RF/FSO lunar communications architecture which leverages small satellites in a Low Earth Orbit (LEO) constellation. We include a case study for this technology designed in Analytical Graphics' Systems Tool Kit (STK) software. Results are presented in terms of chain access duration, propagation delay, transmission loss, Signal-to-Noise Ratio (SNR), and Bit Error Rate (BER). This architecture shows potential to revolutionize extraterrestrial communications and pave the way for highly ambitious future missions in space.","author":[{"family":"Raza","given":"Waseem"},{"family":"Abele","given":"Ethan"},{"family":"O'Hara","given":"John"},{"family":"Sadr","given":"Behnaz"},{"family":"LoPresti","given":"Peter"},{"family":"Imran","given":"Ali"},{"family":"Choi","given":"Wooyeol"},{"family":"Song","given":"Ickhyun"},{"family":"Altunc","given":"Serhat"},{"family":"Kegege","given":"Obadiah"},{"family":"Ekin","given":"Sabit"}],"citation-key":"RazaEtAl2022","container-title":"IEEE Network","DOI":"10.1109/MNET.103.2100419","ISSN":"1558-156X","issue":"6","issued":{"date-parts":[[2022,11]]},"page":"76-83","source":"IEEE Xplore","title":"Toward a Hybrid RF/Optical Lunar Communication System (LunarComm)","type":"article-journal","volume":"36"},
  {"id":"Reed1982","abstract":"Reprint. Originally published: 1st ed. Seattle : Superior Pub. Co., 1968; Bibliography: p. [181]","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Reed","given":"Robert Carroll"}],"citation-key":"Reed1982","contributor":[{"literal":"Internet Archive"}],"ISBN":"978-0-517-32897-2","issued":{"date-parts":[[1982]]},"language":"eng","number-of-pages":"204","publisher":"New York : Bonanza Books : Distributed by Crown Publishers","source":"Internet Archive","title":"Train wrecks : a pictorial history of accidents on the main line","title-short":"Train wrecks","type":"book","URL":"http://archive.org/details/trainwreckspicto00reed"},
  {"id":"Reinhold1990","abstract":"Confirmation of the presence of water ice crystals at the Lunar polar regions by NASA's Lunar Prospector spacecraft has stimulated interest in colonizing the Lunar poles. While there is some controversy over the feasibility of extracting water from the low concentration of ice observed so far, there are other advantages to the poles as an initial location for a Lunar colony. Here are some ideas I had on that topic in 1990, including the feasibility of erecting a tower at the poles that would receive continuous sunlight. In a separate submission, I also proposed to deliver key light elements, thought then to be absent from lunar soil, at a much lower cost by building supply craft as much as possible out of plastic or wood.\nIn December 1989, the Bush administration directed NASA to set up an Outreach Program to solicit ideas for future space exploration. The papers received were synthesized by a group led by former astronaut Gen. Thomas P. Stafford into a report titled America at the Threshold, Report of the Synthesis Group on America's Space Exploration Initiative. The following papers were submitted to NASA on July 17, 1990 as part of that initiative, and is acknowledged, in fine print, on page A-51 of that report.","author":[{"family":"Reinhold","given":"Arnold"}],"citation-key":"Reinhold1990","issued":{"date-parts":[[1990,7,17]]},"source":"ResearchGate","title":"A Solar Powered Station at a Lunar Pole","type":"book"},
  {"id":"RenBeard2007","abstract":"The coordinated use of autonomous vehicles has an abundance of potential applications from the domestic to the hazardously toxic. Frequently the communications necessary for the productive interplay of such vehicles may be subject to limitations in range, bandwidth, noise and other causes of unreliability. Information consensus guarantees that vehicles sharing information over a network topology have a consistent view of information critical to the coordination task. Assuming only neighbor-neighbor interaction between vehicles, Distributed Consensus in Multi-vehicle Cooperative Control develops distributed consensus strategies designed to ensure that the information states of all vehicles in a network converge to a common value. This approach strengthens the team, minimizing power consumption and the deleterious effects of range and other restrictions. The monograph is divided into six parts covering introductory, theoretical and experimental material and featuring: an overview of the use of consensus algorithms in cooperative control; consensus algorithms in single- and double-integrator dynamical systems; consensus algorithms for rigid-body attitude dynamics; rendezvous and axial alignment, formation control, deep-space formation flying, fire monitoring and surveillance. Notation drawn from graph and matrix theory and background material on linear and nonlinear system theory are enumerated in six appendices. The authors maintain a website at which can be found a sample simulation and experimental video material associated with experiments in several chapters of this book. Academic control systems researchers and their counterparts in government laboratories and robotics- and aerospace-related industries will find the ideas presented in Distributed Consensus in Multi-vehicle Cooperative Control of great interest. This text will also serve as a valuable support and reference for graduate courses in robotics, and linear and nonlinear control systems.","author":[{"family":"Ren","given":"Wei"},{"family":"Beard","given":"Randal W."}],"citation-key":"RenBeard2007","issued":{"date-parts":[[2007,10,26]]},"note":"MAG ID: 1509185796","title":"Distributed Consensus in Multi-vehicle Cooperative Control: Theory and Applications","type":"article-journal"},
  {"id":"RieckEtAl2003","abstract":"A client-server based data communication scheme was developed in order to establish a permanent and dynamic real-time GPS network for relative time and frequency transfer. The Kalman-filter-based real-time processor uses station pairwise common-view phase observations for estimating the receiver clock and tropospheric parameters. Orbit determination is based on real-time broadcast ephemerides and station coordinates are fixed and known. Real-time estimates were compared with clock solutions from postprocessed data resulting in standard deviation values in the order of 50 ps for short baselines.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Rieck","given":"Carsten"},{"family":"Jarlemark","given":"Per"},{"family":"Jaldehag","given":"Kenneth"},{"family":"Johansson","given":"Jan"}],"citation-key":"RieckEtAl2003","event-title":"Proceedings of the 35th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2003,12,4]]},"language":"en","page":"157-172","source":"www.ion.org","title":"Real-Time Time and Frequency Transfer Using GPS Carrier Phase Observations","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=13890"},
  {"id":"Riley20","abstract":"This paper covers the criteria for selecting a rubidium frequency standard (RFS) or closely-related CPT and CSAC gas cell atomic clock devices that use either Rb or Cs as their working element. There are several classes of RFS designed for commercial, military and space applications, each with corresponding performance features and limitations, and the specifications for an RFS mainly cover the latter. The primary function of any RFS is to supply a stable frequency regardless of its operating conditions, which include a number of common and application-specific considerations. The paper provides a comprehensive list of those items and describes how they relate to a particular RFS usage. It includes examples of specifications for current commercial, military, and space RFS products from several leading manufacturers.","author":[{"family":"Riley","given":"William"}],"citation-key":"Riley20","issued":{"date-parts":[[20,1,23]]},"language":"en","publisher":"Hamilton Technical Services","source":"Zotero","title":"Selection Criteria for Rubidium Frequency Standards","title-short":"RFS Specification","type":"document","URL":"http://www.wriley.com/Selection%20Criteria%20for%20Rubidium%20Frequency%20Standards.pdf"},
  {"id":"Rochat2019","author":[{"family":"Rochat","given":"Pascal"}],"citation-key":"Rochat2019","event-place":"Stanford Center for Position, Navigation and Time","event-title":"13th Annual PNT Symposium","issued":{"date-parts":[[2019,10,30]]},"language":"en","publisher-place":"Stanford Center for Position, Navigation and Time","title":"ATOMIC CLOCKS TECHNOLOGIES FOR GALILEO & RELATED APPLICATIONS","type":"speech","URL":"http://web.stanford.edu/group/scpnt/pnt/PNT19/presentation_files/I11-Rochat-Atomic_Clocks-Galileo.pdf"},
  {"id":"RodrigoMaialleBomfimEtAl2013","abstract":"A fault tolerant video streaming distribution service utilizes multiple distribution servers to receive and process a video stream simultaneously. Each distribution server performs a mapping of each encoded timestamp associated with a transport stream having time discontinuities to a continuous time sequence. The distribution servers coordinate the timestamp mapping through a distributed leader election protocol that elects a leader to coordinate the timestamp mapping in an environment where failures are anticipated and the number of distribution servers dynamically changes without notice.","author":[{"literal":"Rodrigo Maialle Bomfim"},{"literal":"Prakash Duggaraju"},{"literal":"Anton Kucer"},{"literal":"Thomas L. Marquardt"},{"literal":"Marquardt Thomas Leo"}],"citation-key":"RodrigoMaialleBomfimEtAl2013","issued":{"date-parts":[[2013,3,14]]},"note":"MAG ID: 1622934736","title":"Distributed fragment timestamp synchronization","type":"article-journal"},
  {"id":"RoncoliFujii2010","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Roncoli","given":"Ralph"},{"family":"Fujii","given":"Kenneth"}],"citation-key":"RoncoliFujii2010","container-title":"AIAA/AAS Astrodynamics Specialist Conference","DOI":"10.2514/6.2010-8383","event-place":"Toronto, Ontario, Canada","event-title":"AIAA/AAS Astrodynamics Specialist Conference","ISBN":"978-1-62410-150-2","issued":{"date-parts":[[2010,8,2]]},"language":"en","publisher":"American Institute of Aeronautics and Astronautics","publisher-place":"Toronto, Ontario, Canada","source":"DOI.org (Crossref)","title":"Mission Design Overview for the Gravity Recovery and Interior Laboratory (GRAIL) Mission","type":"paper-conference","URL":"https://arc.aiaa.org/doi/10.2514/6.2010-8383"},
  {"id":"Sanders2010","abstract":"Talented and dedicated engineers spent countless hours designing Japan’s rail system to be one of the world’s most efficient. Could have just asked a slime mold. When presented with oat flakes arranged in the pattern of Japanese cities around Tokyo, brainless, single-celled slime molds construct networks of nutrient-channeling tubes that are strikingly similar to the […]","accessed":{"date-parts":[[2023,8,12]]},"author":[{"family":"Sanders","given":"Laura"}],"citation-key":"Sanders2010","container-title":"Wired","ISSN":"1059-1028","issued":{"date-parts":[[2010,1,22]]},"language":"en-US","section":"tags","source":"www.wired.com","title":"Slime Mold Grows Network Just Like Tokyo Rail System","type":"article-magazine","URL":"https://www.wired.com/2010/01/slime-mold-grows-network-just-like-tokyo-rail-system/"},
  {"id":"SantamariaDuthonEtAl2023","abstract":"Pressing or emerging political risks that have flown under the radar","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Santamaria Duthon","given":"Adriana"},{"family":"Singh","given":"Arshdip"},{"family":"Fenwick","given":"Cameron"},{"family":"Roberts","given":"Elin"},{"family":"Dinçer","given":"Ethan"},{"family":"Morsy","given":"Mariam"},{"family":"Johnson","given":"Matthew"},{"family":"Louis","given":"Natasha"},{"family":"Jardine","given":"Samuel"},{"family":"Woodlock","given":"Thomas"}],"citation-key":"SantamariaDuthonEtAl2023","issued":{"date-parts":[[2023,1,23]]},"publisher":"London Politica","title":"Overlooked Political Risks for 2023","type":"report","URL":"https://static1.squarespace.com/static/5efb88803e2328745c7b3c39/t/63ce9092c7f2942dbc6c0dc0/1674481812821/London+Politica-+Overlooked+Political+Risks+for+2023.pdf"},
  {"id":"SchenatoFiorentin2011","abstract":"This paper describes a new consensus-based protocol, referred to as Average TimeSync (ATS), for synchronizing the clocks of a wireless sensor network. This algorithm is based on a cascade of two consensus algorithms, whose main task is to average local information. The proposed algorithm has the advantage of being totally distributed, asynchronous, robust to packet drop and sensor node failure, and it is adaptive to time-varying clock drifts and changes of the communication topology. In particular, a rigorous proof of convergence to global synchronization is provided in the absence of process and measurement noise and of communication delay. Moreover, its effectiveness is shown through a number of experiments performed on a real wireless sensor network.","accessed":{"date-parts":[[2023,2,19]]},"author":[{"family":"Schenato","given":"Luca"},{"family":"Fiorentin","given":"Federico"}],"citation-key":"SchenatoFiorentin2011","container-title":"Automatica","container-title-short":"Automatica","DOI":"10.1016/j.automatica.2011.06.012","ISSN":"0005-1098","issue":"9","issued":{"date-parts":[[2011,9,1]]},"language":"en","page":"1878-1886","source":"ScienceDirect","title":"Average TimeSynch: A consensus-based protocol for clock synchronization in wireless sensor networks","title-short":"Average TimeSynch","type":"article-journal","URL":"https://www.sciencedirect.com/science/article/pii/S0005109811003116","volume":"47"},
  {"id":"Schiavenza2013","abstract":"The Communist Party&#39;s decision to use Beijing time across the country, done to enhance &ldquo;national unity,&rdquo; has backfired in Xinjiang.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Schiavenza","given":"Matt"}],"citation-key":"Schiavenza2013","container-title":"The Atlantic","issued":{"date-parts":[[2013,11,5]]},"language":"en","section":"China","title":"China Only Has One Time Zone—and That's a Problem","type":"webpage","URL":"https://www.theatlantic.com/china/archive/2013/11/china-only-has-one-time-zone-and-thats-a-problem/281136/"},
  {"id":"Schingler","abstract":"Sustained presence in outer space requires a categorical shift in thinking, going beyond “exploration” to think instead about tenure: policies rooted in experience, lessons learned from historic engagements with frontiers, and long term thinking, in order to construct strong foundations and longevity of presence.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Schingler","given":"Jessy Kate"}],"citation-key":"Schingler","container-title":"Open Lunar Foundation","title":"Space Tenure: The Policies of Sustained Lunar Presence - Open Lunar Foundation","title-short":"Space Tenure","type":"post-weblog","URL":"https://www.openlunar.org/library/space-tenure-the-policies-of-sustained-lunar-presence"},
  {"id":"SchmidtEtAl2019","accessed":{"date-parts":[[2023,1,31]]},"author":[{"family":"Schmidt","given":"Tobias D."},{"family":"Trainotti","given":"Christian"},{"family":"Furthner","given":"Johann"}],"citation-key":"SchmidtEtAl2019","DOI":"10.33012/2019.16758","event-place":"Reston, Virginia","event-title":"50th Annual Precise Time and Time Interval Systems and Applications Meeting","issued":{"date-parts":[[2019,2,19]]},"page":"290-298","publisher-place":"Reston, Virginia","source":"DOI.org (Crossref)","title":"Comparing Clock Steering Technique Performances in Simulations and Measurements","type":"paper-conference","URL":"https://www.ion.org/publications/abstract.cfm?articleID=16758"},
  {"id":"SeubertEtAl2022","accessed":{"date-parts":[[2022,12,27]]},"author":[{"family":"Seubert","given":"Jill"},{"family":"Ely","given":"Todd A."},{"family":"Stuart","given":"Jeffrey"}],"citation-key":"SeubertEtAl2022","container-title":"Journal of Spacecraft and Rockets","container-title-short":"Journal of Spacecraft and Rockets","DOI":"10.2514/1.A35334","ISSN":"0022-4650, 1533-6794","issue":"6","issued":{"date-parts":[[2022,11]]},"language":"en","page":"1914-1925","source":"DOI.org (Crossref)","title":"Results of the Deep Space Atomic Clock Deep Space Navigation Analog Experiment","type":"article-journal","URL":"https://arc.aiaa.org/doi/10.2514/1.A35334","volume":"59"},
  {"id":"Sharma2012","abstract":"Clock synchronization between different entities in a system has been approached using two main methods, decentralized and centralized synchronization. Examples of centralized synchronization include Network Time Protocol (NTP) and the use of Global Positioning System (GPS) as a central clock. The synchronization of clocks in distributed systems is a well-studied and difficult problem. Current solutions possess a significant convergence delay and a non-perfect synchronization window. This thesis approaches the problem of clock synchronization in decentralized systems by analysing and using pulse-coupled oscillator models, like the Kuramoto model and the Mirollo-Strogatz firefly model, while leveraging the knowledge of internode latencies to form a biased gradient overlay topology, and creating a custom firefly synchronization model. The system node coordinates are indicative of internode latencies if they are assigned statically using a latency data set or through a dynamic coordinate protocol, which assigns coordinates according to current internode latencies. The coordinates are then used to create an overlay over the physical topology by having larger number of links with lower internode latency. Neighbours are selected based on an information need basis. Logical time on the nodes is set in sync along with the phase synchronization using fine tuned algorithms to set a common timestamp on each cycle, and to optimize the synchronization window and the convergence time. The results show that the gradient firefly synchronization is efficient in convergence time as well as synchronization window. The protocol works better with a single cluster of nodes as compared to multiple clusters. It is concluded in the thesis that latency aware gradient firefly synchronization protocols can be used per cluster and the performance can be improved further with the incorporation of dynamic coordinate protocols.","accessed":{"date-parts":[[2023,2,19]]},"author":[{"family":"Sharma","given":"Siddharth"}],"citation-key":"Sharma2012","event-place":"Stockholm","issued":{"date-parts":[[2012,2]]},"language":"eng","publisher":"KTH Royal Institute of Technology","publisher-place":"Stockholm","source":"www.diva-portal.org","title":"Clock Synchronization in Decentralized Systems","type":"thesis","URL":"http://urn.kb.se/resolve?urn=urn:nbn:se:kth:diva-94141"},
  {"id":"ShemarEtAl2016","accessed":{"date-parts":[[2023,2,3]]},"author":[{"family":"Shemar","given":"Setnam"},{"family":"Fraser","given":"George"},{"family":"Heil","given":"Lucy"},{"family":"Hindley","given":"David"},{"family":"Martindale","given":"Adrian"},{"family":"Molyneux","given":"Philippa"},{"family":"Pye","given":"John"},{"family":"Warwick","given":"Robert"},{"family":"Lamb","given":"Andrew"}],"citation-key":"ShemarEtAl2016","container-title":"Experimental Astronomy","container-title-short":"Exp Astron","DOI":"10.1007/s10686-016-9496-z","ISSN":"0922-6435, 1572-9508","issue":"2","issued":{"date-parts":[[2016,10]]},"language":"en","page":"101-138","source":"DOI.org (Crossref)","title":"Towards practical autonomous deep-space navigation using X-Ray pulsar timing","type":"article-journal","URL":"http://link.springer.com/10.1007/s10686-016-9496-z","volume":"42"},
  {"id":"ShourabouraEtAl","abstract":"NASA’s Deep Space Network (DSN) is a unique facility responsible for communication and navigation support for over forty NASA and international space missions. For many years, demand on the network has been greater than its capacity, and so a collaborative negotiation process has been developed among the network’s users to resolve contention and come to agreement on the schedule. This process has become strained by increasing demand, to the point that oversubscription is routinely as high as 40% over actual capacity. As a result, DSN has started investigating the possibility of moving to some kind of prioritization scheme to allow for more automated and timely resolution of network contention. Other NASA networks have used strict static mission priorities, but if this were applied in the same way to the DSN, some missions would fall out of the schedule altogether. In this paper we report on analysis and experimentation with several approaches to DSN prioritization. Our objectives include preserving as much of each each mission’s requested contact time as possible, while allowing them to identify which of their specific scheduling requests are of greatest importance to them. We have obtained the most promising results with a variant of Squeaky Wheel Optimization combined with limiting each mission’s input based on historical negotiated reduction levels.","author":[{"family":"Shouraboura","given":"Caroline"},{"family":"Johnston","given":"Mark D"},{"family":"Tran","given":"Daniel"}],"citation-key":"ShourabouraEtAl","language":"en","source":"Zotero","title":"Prioritization and Oversubscribed Scheduling for NASA’s Deep Space Network","type":"article-journal"},
  {"id":"SmrekarEtAl2022","abstract":"Deep understanding of planetary habitability requires identifying key factors that govern the surface environment over time. Venus is the ultimate control case for understanding how Earth developed and maintained conditions suited to life. Venus very likely had elements essential to habitability such as past surface water and a dynamo. Tectonism and volcanism, which create chemical disequilibrium, very likely persist today. What caused Earth and Venus to diverge down different evolutionary paths? VERITAS would create foundational, co-registered data sets of high-resolution topography, imaging, spectroscopy, and gravity, on par with those available for Mercury, Mars, and the Moon. VERITAS would answer outstanding fundamental questions about the evolution of Earth's twin. The VERITAS payload consists of the Venus Interferometric Synthetic Aperture Radar (VISAR) and the Venus Emissivity Mapper (VEM), plus a gravity science investigation. VISAR is an X-band radar that provides: 1) a global digital elevation model (DEM) with 250-m postings and 6-m height accuracy, 2) Synthetic aperture radar (SAR) imaging at 30-m horizontal resolution globally, 3) SAR imaging at 15-m resolution for $> \\boldsymbol25%$ of the surface, and 4) surface deformation from repeat pass interferometry (RPI) with 2-cm vertical precision for $> \\boldsymbol12 \\boldsymbol(\\sim 200\\ \\mathrmx\\ 200\\ \\textkm)$ targeted areas. VEM covers $\\boldsymbol > 70%$ of the surface in six near-infrared (NIR) bands sensitive to iron composition located within five atmospheric windows, plus eight atmospheric bands for calibration and water vapor measurements. VEM would provide near-global maps of mafic to felsic rock type and will search for active and recent volcanism. VERITAS would use two-way Ka-band uplink and downlink from a low circular orbit $\\boldsymbol(< 250\\ \\textkm)$ to create a global gravity field with 3-mGal accuracy of 155-km resolution (degree and order 123). An onboard technology demonstration, the Deep Space Atomic Clock (DSAC-2), may support radio science and navigation with one-way tracking. VERITAS data would enable estimation of elastic thickness (a proxy for thermal gradient) and density differences due to subsurface structures, as well as constraining interior structure, including core size and state. Lockheed Martin builds the spacecraft. VISAR is built by JPL, with the Italian Space Agency (ASI) providing the low power electronics. ASI also provides transponders and a high gain antenna for the telecom system. CNES provides the Ka-band traveling wave tube amplifiers (TWTA). The German Space Agency (DLR) provides VEM and contributes algorithms for VISAR ground and onboard data processing.","author":[{"family":"Smrekar","given":"Sue"},{"family":"Hensley","given":"Scott"},{"family":"Nybakken","given":"Rick"},{"family":"Wallace","given":"Mark S."},{"family":"Perkovic-Martin","given":"Dragana"},{"family":"You","given":"Tung-Han"},{"family":"Nunes","given":"Daniel"},{"family":"Brophy","given":"John"},{"family":"Ely","given":"Todd"},{"family":"Burt","given":"Eric"},{"family":"Dyar","given":"M. Darby"},{"family":"Helbert","given":"Joern"},{"family":"Miller","given":"Barry"},{"family":"Hartley","given":"Jonathan"},{"family":"Kallemeyn","given":"Piet"},{"family":"Whitten","given":"Jennifer"},{"family":"Iess","given":"Luciano"},{"family":"Mastrogiuseppe","given":"Marco"},{"family":"Younis","given":"Marwan"},{"family":"Prats","given":"Pau"},{"family":"Rodriguez","given":"Marc"},{"family":"Mazarico","given":"Erwan"}],"citation-key":"SmrekarEtAl2022","container-title":"2022 IEEE Aerospace Conference (AERO)","DOI":"10.1109/AERO53065.2022.9843269","event-title":"2022 IEEE Aerospace Conference (AERO)","ISSN":"1095-323X","issued":{"date-parts":[[2022,3]]},"page":"1-20","source":"IEEE Xplore","title":"VERITAS (Venus Emissivity, Radio Science, InSAR, Topography, and Spectroscopy): A Discovery Mission","title-short":"VERITAS (Venus Emissivity, Radio Science, InSAR, Topography, and Spectroscopy)","type":"paper-conference"},
  {"id":"SobeihEtAl2007","accessed":{"date-parts":[[2022,12,27]]},"author":[{"family":"Sobeih","given":"Ahmed"},{"family":"Hack","given":"Michel"},{"family":"Liu","given":"Zhen"},{"literal":"Li Zhang"}],"citation-key":"SobeihEtAl2007","container-title":"2007 IEEE International Parallel and Distributed Processing Symposium","DOI":"10.1109/IPDPS.2007.370211","event-place":"Long Beach, CA, USA","event-title":"2007 IEEE International Parallel and Distributed Processing Symposium","ISBN":"978-1-4244-0909-9","issued":{"date-parts":[[2007]]},"page":"1-10","publisher":"IEEE","publisher-place":"Long Beach, CA, USA","source":"DOI.org (Crossref)","title":"Almost Peer-to-Peer Clock Synchronization","type":"paper-conference","URL":"http://ieeexplore.ieee.org/document/4227939/"},
  {"id":"Suess2022","abstract":"Are space regulations doomed to lag behind the newest emerging technology in the sector?","accessed":{"date-parts":[[2023,4,12]]},"citation-key":"Suess2022","container-title":"War in Space","issued":{"date-parts":[[2022,10,3]]},"language":"en","medium":"Podcast","number":"21","producer":[{"family":"Suess","given":"Juliana"}],"publisher":"RUSI","title":"Space Tech Innovation and Regulations – A Game of Catch-Up?","type":"broadcast","URL":"https://www.rusi.orghttps://www.rusi.org"},
  {"id":"SundararamanEtAl2005","abstract":"Abstract   Recent advances in micro-electromechanical (MEMS) technology have led to the development of small, low-cost, and low-power sensors. Wireless sensor networks (WSNs) are large-scale networks of such sensors, dedicated to observing and monitoring various aspects of the physical world. In such networks, data from each sensor is agglomerated using data fusion to form a single meaningful result, which makes time synchronization between sensors highly desirable. This paper surveys and evaluates existing clock synchronization protocols based on a palette of factors like precision, accuracy, cost, and complexity. The design considerations presented here can help developers either in choosing an existing synchronization protocol or in defining a new protocol that is best suited to the specific needs of a sensor-network application. Finally, the survey provides a valuable framework by which designers can compare new and existing synchronization protocols.","author":[{"family":"Sundararaman","given":"Bharath"},{"family":"Buy","given":"Ugo"},{"family":"Kshemkalyani","given":"Ajay D."}],"citation-key":"SundararamanEtAl2005","DOI":"10.1016/j.adhoc.2005.01.002","issue":"3","issued":{"date-parts":[[2005,5,1]]},"note":"MAG ID: 2018093989","page":"281-323","title":"Clock synchronization for wireless sensor networks: a survey","type":"article-journal","volume":"3"},
  {"id":"SunEtAl2012","abstract":"The firefly algorithm has become a hot issue in the research of wireless sensor networks (WSN) synchronization recently. In this paper, a clustering scheme is introduced to Reachback Firefly Algorithm (RFA), and this newly proposed algorithm is clustering firefly synchronization algorithm (CFSA). At the beginning of CFSA, the initial phases of all nodes in the network are sequenced for the purpose of calculating the number of clusters required. Then the entire network is divided into several clusters. Thus the original synchronization process can be decomposed into the following two steps: Cluster-intra synchronization and Cluster-inter synchronization. The simulation results show that CFSA improves the convergence rate of the system. Meanwhile, it effectively reduces the number of flashes, which leads to the mitigation in the overall network load.","author":[{"family":"Sun","given":"Yi"},{"family":"Jiang","given":"Qing"},{"family":"Zhang","given":"Kai"}],"citation-key":"SunEtAl2012","container-title":"2012 3rd IEEE International Conference on Network Infrastructure and Digital Content","DOI":"10.1109/ICNIDC.2012.6418705","event-title":"2012 3rd IEEE International Conference on Network Infrastructure and Digital Content","ISSN":"2374-0272","issued":{"date-parts":[[2012,9]]},"page":"27-31","source":"IEEE Xplore","title":"A clustering scheme for Reachback Firefly Synchronicity in wireless sensor networks","type":"paper-conference"},
  {"id":"Suplee1994","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Suplee","given":"Curt"}],"citation-key":"Suplee1994","container-title":"Washington Post","ISSN":"0190-8286","issued":{"date-parts":[[1994,11,16]]},"language":"en-US","source":"www.washingtonpost.com","title":"A BRIEF HISTORY OF TIME-KEEPING:","title-short":"A BRIEF HISTORY OF TIME-KEEPING","type":"article-newspaper","URL":"https://www.washingtonpost.com/archive/politics/1994/11/16/a-brief-history-of-time-keeping/1735193f-0c41-4657-af73-16e7b54a9665/"},
  {"id":"SwineyHernandez2022","author":[{"family":"Swiney","given":"Gabriel"},{"family":"Hernandez","given":"Amanda"}],"citation-key":"SwineyHernandez2022","event-place":"NASA Headquarters","issued":{"date-parts":[[2022,9,30]]},"language":"en","number":"Report ID 20220015973","publisher":"NASA Office of Technology, Policy, and Strategy","publisher-place":"NASA Headquarters","source":"Zotero","title":"Lunar Landing and Operations Policy Analysis","type":"report"},
  {"id":"TaiEtAl2017","abstract":"During October 2014–April 2015, the Korea Aerospace Research Institute (KARI) and the National Aeronautics and Space Administration (NASA) conducted a feasibility study for the purpose of identifying potential areas of cooperation in lunar robotic exploration activities. A key objective of the joint study was to define a space communications architecture that will serve as a framework for accommodating the communications and navigation capabilities and services provided by NASA’s Deep Space Network (DSN); the Korea DSN (KDSN), a potential lunar relay; the Korea Pathfinder Lunar Orbiter (KPLO); and the KPLO Mission Operations System (MOS). This lunar communications architecture is intended to support, in addition to the KPLO mission (to be launched in 2018), other lunar potential missions, i.e., NASA or KARI lunar CubeSat missions and a NASA Resource Prospector mission, to be operational in the 2018–2021 time frame. A salient feature of this architecture is the service paradigm propagated from that of the DSN. Both DSN and KDSN will operate on a multi-mission basis, serving multiple flight missions concurrently. They execute a set of standard services through Consultative Committee on Space Data Standard (CCSDS)-compliant standard protocols to communicate with the spacecraft of the user missions over the space-ground communications link and CCSDS-compliant standard interfaces with the MOS over the ground-to-ground link. In other words, they are interoperable to each other, and from the viewpoint of the user missions of KARI and NASA, they can obtain “cross support” by the network assets of the two agencies. The second feature of the lunar space communications architecture is the existence of a prototypical lunar network, enabled by the lunar relay asset. This is a new type of communications asset in the lunar region. Three different relay configurations, i.e., the integrated relay payload, the hosted relay payload, and the independent relay satellite, were assessed for their feasibility, functionality, and performance. Another feature is the multiplicity of the communications links, i.e., trunk link, in situ link, and direct to/from Earth (DTE/DFE) links, and their associated complexity due to the diversity of user missions, e.g., multiple frequency bands (X-, S-, and UHF-bands) to be supported by the radios in the system architecture.","accessed":{"date-parts":[[2023,5,6]]},"author":[{"family":"Tai","given":"Wallace"},{"family":"Kim","given":"InKyu"},{"family":"Moon","given":"SangMan"},{"family":"Kim","given":"Day Young"},{"family":"Cheung","given":"Kar-Ming"},{"family":"Koo","given":"Cheol Hea"},{"family":"Schier","given":"James"},{"family":"Rew","given":"Dong Young"}],"citation-key":"TaiEtAl2017","container-title":"Space Operations: Contributions from the Global Community","DOI":"10.1007/978-3-319-51941-8_7","editor":[{"family":"Cruzen","given":"Craig"},{"family":"Schmidhuber","given":"Michael"},{"family":"Lee","given":"Young H."},{"family":"Kim","given":"Bangyeop"}],"event-place":"Cham","ISBN":"978-3-319-51941-8","issued":{"date-parts":[[2017]]},"language":"en","page":"149-174","publisher":"Springer International Publishing","publisher-place":"Cham","source":"Springer Link","title":"The Lunar Space Communications Architecture: Beyond the NASA–KARI Study","title-short":"The Lunar Space Communications Architecture","type":"chapter","URL":"https://doi.org/10.1007/978-3-319-51941-8_7"},
  {"id":"Travagnin2021","abstract":"We report on a cycle of four presentations on Chip-Scale Atomic Clocks (CSACs) organized and chaired by DG DEFIS Unit B.2 and given by the author in April/May 2021 to an audience composed by policy officers from DG JRC, DG DEFIS, DG CNECT, DG DIGIT, DG MOVE, REA, EISMEA, HaDEA, COUNCIL, EUSPA, EDA, and ESA. The presentations provide an overview of the place of CSACs in the clock landscape, their underlying working principles and enabling technologies, the available commercial devices, and the research and development initiatives going on worldwide. Applications are also covered, from which it becomes apparent the importance of CSACs for several military uses, and in some civilian domains. The aim of the report is to provide scientific and technical background for policy initiatives in an area of potential interest for strategic autonomy. Indeed, this Technical Report shows that although the EU has a first-class research capability on CSACs and has developed advanced prototypes, the transition towards a market product with characteristics similar to those presently produced in the USA and in China needs attentive policy support. To be successful, a commercial CSAC needs to overcome the market uncertainties facing a product characterized by high manufacturing costs and an application domain falling mostly in the military and defence sector. Since in the EU accreditation and procurement of military equipment is determined by national regulations, there is a clear case for policy initiatives aimed at the institution of an EU-wide market space for CSACs, the only which can guarantee a demand large enough to enable the cost reductions associated with large-scale manufacturing. This point clearly emerged during the discussions which followed the presentations. Indeed, policy officer from both the European Commission and the European Defence Agency hinted at the necessity of establishing a mechanism for information exchange between relevant European institutions, national governments, and manufacturers of military equipment as a precondition to raise the interest of atomic clock producers towards a device which could contribute to EU strategic autonomy. It was agreed that the JRC will continue to provide the Commission the necessary assistance, in terms of technical know-how","author":[{"family":"Travagnin","given":"M."}],"citation-key":"Travagnin2021","event-place":"Luxembourg","ISBN":"978-92-76-40666-2","issued":{"date-parts":[[2021]]},"language":"eng","note":"OCLC: 1268125654","publisher":"Publications Office of the European Union","publisher-place":"Luxembourg","source":"Open WorldCat","title":"Chip-scale atomic clocks: physics, technologies, and applications","title-short":"Chip-scale atomic clocks","type":"book"},
  {"id":"Tribunewire2015","accessed":{"date-parts":[[2023,2,12]]},"author":[{"literal":"Tribune wire"}],"citation-key":"Tribunewire2015","container-title":"Chicago Tribune","issued":{"date-parts":[[2015,8,7]]},"language":"English (United States), en-US","title":"The politics of time: why countries switch time zones","title-short":"The politics of time","type":"post-weblog","URL":"https://www.chicagotribune.com/suburbs/naperville-sun/opinion/ct-north-korea-time-zone-20150807-story.html"},
  {"id":"VanBurenEtAl2019","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Van Buren","given":"Damon"},{"family":"Palo","given":"Scott"},{"family":"Axelrad","given":"Penina"}],"citation-key":"VanBurenEtAl2019","DOI":"10.33012/2019.16750","event-place":"Reston, Virginia","event-title":"50th Annual Precise Time and Time Interval Systems and Applications Meeting","issued":{"date-parts":[[2019,2,19]]},"page":"149-167","publisher-place":"Reston, Virginia","source":"DOI.org (Crossref)","title":"High Stability Reference Clock for Small Satellites","type":"paper-conference","URL":"https://www.ion.org/publications/abstract.cfm?articleID=16750"},
  {"id":"VanBurenEtAl2021","abstract":"Abstract\n            We describe our investigation into the performance of low-power heterogeneous timing systems for small satellites, using real GPS observables from the GRACE Follow-On mission. Small satellites have become capable platforms for a wide range of commercial, scientific and defense missions, but they are still unable to meet the needs of missions that require precise timing, on the order of a few nanoseconds. Improved low-power onboard clocks would make small satellites a viable option for even more missions, enabling radio aperture interferometry, improved radio occultation measurements, high altitude GPS navigation, and GPS augmentation missions, among others. One approach for providing improved small satellite timekeeping is to combine a heterogeneous group of oscillators, each of which provides the best stability over a different time frame. A hardware architecture that uses a single-crystal oscillator, one or more Chip Scale Atomic Clocks (CSACs) and the reference time from a GPS receiver is presented. The clocks each contribute stability over a subset of timeframes, resulting in excellent overall system stability for timeframes ranging from less than a second to several days. A Kalman filter is used to estimate the long-term errors of the CSACs based on the CSAC-GPS time difference, and the improved CSAC time is used to discipline the crystal oscillator, which provides the high-stability reference clock for the small satellite. Simulations using GRACE-FO observations show time error standard deviations for the system range from 2.3 ns down to 1.3 ns for the clock system, depending on how many CSACs are used. The results provide insight into the timing performance which could be achieved on small LEO spacecraft by a low power timing system.","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Van Buren","given":"Damon"},{"family":"Axelrad","given":"Penina"},{"family":"Palo","given":"Scott"}],"citation-key":"VanBurenEtAl2021","container-title":"GPS Solutions","container-title-short":"GPS Solut","DOI":"10.1007/s10291-021-01134-x","ISSN":"1080-5370, 1521-1886","issue":"3","issued":{"date-parts":[[2021,7]]},"language":"en","page":"105","source":"DOI.org (Crossref)","title":"Design of a high-stability heterogeneous clock system for small satellites in LEO","type":"article-journal","URL":"https://link.springer.com/10.1007/s10291-021-01134-x","volume":"25"},
  {"id":"vanDeusenKoff2016","accessed":{"date-parts":[[2023,2,7]]},"author":[{"family":"Deusen","given":"Nancy","non-dropping-particle":"van"},{"family":"Koff","given":"Leonard Michael"}],"citation-key":"vanDeusenKoff2016","DOI":"10.1163/9789004312319","ISBN":"978-90-04-31002-5 978-90-04-31231-9","issued":{"date-parts":[[2016,5,9]]},"publisher":"BRILL","source":"DOI.org (Crossref)","title":"Time: Sense, Space, Structure","title-short":"Time","type":"book","URL":"https://brill.com/view/title/32698"},
  {"id":"Various1884","accessed":{"date-parts":[[2023,2,7]]},"archive":"www.gutenberg.org","author":[{"literal":"Various"}],"citation-key":"Various1884","issued":{"date-parts":[[1884,10]]},"publisher":"www.gutenberg.org","title":"International Conference Held at Washington for the Purpose of Fixing a Prime Meridian and a Universal Day","type":"document","URL":"https://www.gutenberg.org/files/17759/17759-h/17759-h.htm"},
  {"id":"VaruoloEtAl2022","abstract":"As increasing reliance on space-borne atomic clocks for position, navigation, and timing manifests, emphasis on pursuing higher performance clocks with robustness and longevity is tantamount. In this vein, key aspects for any space-borne atomic clock not only include excellent frequency stability, but must also be robust enough to survive the harsh environment of space. In this presentation, Frequency Electronics, Inc. (FEI) will present its innovative Digital Rubidium Atomic Frequency Standard (DRAFS) which has recently passed qualification testing. One engineering qualification unit has been fabricated thus far as well as two engineering design units which are reserved for additional testing. The focus in the presentation will be on the development of DRAFS as well as clock frequency stability while subjected to the environmental conditions the unit will experience in a space environment. Topics to be discussed include size, weight, power consumption, environmental sensitivity testing, frequency retrace, radiation hardening, and guaranteed lifetime of the unit over a projected twenty year period.","accessed":{"date-parts":[[2023,2,20]]},"author":[{"family":"Varuolo","given":"Christopher"},{"family":"Shtaerman","given":"Igor"},{"family":"Clark","given":"Daniel J."},{"family":"Napodano","given":"Jason"},{"family":"Skibiel","given":"Paul"},{"family":"Aji","given":"Nicholas"},{"family":"McClelland","given":"Thomas"}],"citation-key":"VaruoloEtAl2022","DOI":"10.33012/2023.18687","event-title":"Proceedings of the 54th Annual Precise Time and Time Interval Systems and Applications Meeting","ISSN":"2333-2069","issued":{"date-parts":[[2022,1,26]]},"language":"en","page":"165-178","source":"www.ion.org","title":"Development and Performance of a Digital Rubidium Atomic Frequency Standard (DRAFS) as a Next-Generation Space Clock","type":"paper-conference","URL":"http://www.ion.org/publications/abstract.cfm?jp=p&articleID=18687"},
  {"id":"Vaughan2018","abstract":"Lunar night survival, while being a technical design challenge, also has an impact on mis-sion planning and execution during the flight system development phases (Phases A-D). Depending on mis-sion objectives, different locations on the lunar surface result in different challenges to technical formulation of a comprehensive mission design and implementa-tion. Equatorial regions have temperature extremes between day and night (<100K to >380K) but are somewhat cyclical and predictable. Polar regions can have milder thermal environments in terms of overall surface temperature swing and opportunities for ex-tended durations for solar power but pose unique chal-lenges in temporal and spatial availability of both sun-light and direct-to-Earth communications. Options for surviving the night will depend heavily on mission objectives, lunar location and program cost and schedule constraints.","accessed":{"date-parts":[[2023,4,5]]},"author":[{"family":"Vaughan","given":"R."}],"citation-key":"Vaughan2018","issued":{"date-parts":[[2018,11,13]]},"note":"NTRS Author Affiliations: NASA Ames Research Center\nNTRS Report/Patent Number: ARC-E-DAA-TN63028\nNTRS Document ID: 20190000997\nNTRS Research Center: Ames Research Center (ARC)","title":"Mission Design and Implementation Considerations for Lunar Night Survival","type":"speech","URL":"https://ntrs.nasa.gov/citations/20190000997"},
  {"id":"VelazcoEtAl","abstract":"JPL is developing a new omnidirectional optical terminal that will provide fast communications and accurate navigation for swarms of spacecraft. The omnidirectional optical communicator/navigator (OOCN) under development presents a truncated icosahedral geometry that contains arrays of miniature laser telescopes and optical detectors. The miniature optical telescopes are located at the center of each OOCN facet and allow for full sky coverage. The optical detectors, symmetrically deployed on each vertex of the OOCN body, have two purposes: to receive fast incoming communications signals and accurately determine the angle of arrival (AOA) of the incoming signal. The continuous AOA tracking performed by the OOCN mechanism makes it ideally suited for swarm navigation as well. In this paper, we provide a general description of the main OOCN features: 1) high data rate communications, 2) full sky coverage, and 3) ability to maintain multiple links simultaneously. The current OOCN prototype operates at a wavelength of 650 nm, and uses low-power single-mode laser diodes and fast silicon photodetectors. We present the latest experimental results of AOA and pointing testing obtained with this prototype in our optical laboratory. Lastly, we present examples of future missions that could be enabled by the OOCN.","author":[{"family":"Velazco","given":"Jose E"},{"family":"Aguilar","given":"Alexa C"},{"family":"Klaib","given":"Andy R"},{"family":"Escobar","given":"Uriel S"},{"family":"Cornish","given":"Sean E"},{"family":"Griffin","given":"Joseph C"}],"citation-key":"VelazcoEtAl","language":"en","source":"Zotero","title":"Development of Omnidirectional Optical Terminals for Swarm Communications and Navigation","type":"article-journal"},
  {"id":"VillelaEtAl2019","abstract":"CubeSats have become an interesting innovation in the space sector. Such platforms are being used for several space applications, such as education, Earth remote sensing, science, and defense. As of May 31st, 2018, 855 CubeSats had been launched. Remote sensing application is the main sector in which CubeSats are being used, corresponding to about 45% of all applications. This fact indicates the commercial potential of such a platform. Fifty eight countries have already been involved with developing CubeSats. The most used CubeSat configuration is 3U (about 64%), followed by 1U (18%), while 6U platforms account for about 4%. In this paper, we present an analysis of the current situation regarding CubeSats worldwide, through the use of a dataset built to encompass information about these satellites. The overall success rate of the CubeSat missions is increasing over time. Moreover, considering CubeSat missions as a Bernoulli experiment, and excluding launch failures, the current success rate was estimated, as a parameter of a binomial distribution, to be about 75%. By using a logistic model and considering that the launchings keep following the current tendency, one can expect that one thousand CubeSats will be launched in 2021, within 95% certainty.","accessed":{"date-parts":[[2023,2,12]]},"author":[{"family":"Villela","given":"Thyrso"},{"family":"Costa","given":"Cesar A."},{"family":"Brandão","given":"Alessandra M."},{"family":"Bueno","given":"Fernando T."},{"family":"Leonardi","given":"Rodrigo"}],"citation-key":"VillelaEtAl2019","container-title":"International Journal of Aerospace Engineering","container-title-short":"International Journal of Aerospace Engineering","DOI":"10.1155/2019/5063145","ISSN":"1687-5966, 1687-5974","issued":{"date-parts":[[2019,1,10]]},"language":"en","page":"1-13","source":"DOI.org (Crossref)","title":"Towards the Thousandth CubeSat: A Statistical Overview","title-short":"Towards the Thousandth CubeSat","type":"article-journal","URL":"https://www.hindawi.com/journals/ijae/2019/5063145/","volume":"2019"},
  {"id":"WangEtAl2019","accessed":{"date-parts":[[2023,2,4]]},"author":[{"family":"Wang","given":"Shuai"},{"family":"Ding","given":"Wenwen"},{"family":"Li","given":"Juanjuan"},{"family":"Yuan","given":"Yong"},{"family":"Ouyang","given":"Liwei"},{"family":"Wang","given":"Fei-Yue"}],"citation-key":"WangEtAl2019","container-title":"IEEE Transactions on Computational Social Systems","container-title-short":"IEEE Trans. Comput. Soc. Syst.","DOI":"10.1109/TCSS.2019.2938190","ISSN":"2329-924X, 2373-7476","issue":"5","issued":{"date-parts":[[2019,10]]},"page":"870-878","source":"DOI.org (Crossref)","title":"Decentralized Autonomous Organizations: Concept, Model, and Applications","title-short":"Decentralized Autonomous Organizations","type":"article-journal","URL":"https://ieeexplore.ieee.org/document/8836488/","volume":"6"},
  {"id":"Williams2022","abstract":"The author is exploring the incentive structures that would enable commercial participation in a Lunar Registry through a series of related posts.","accessed":{"date-parts":[[2023,4,11]]},"author":[{"family":"Williams","given":"Rachel"}],"citation-key":"Williams2022","container-title":"Open Lunar Foundation","issued":{"date-parts":[[2022,11,10]]},"title":"Incentives and Barriers to Corporate Engagement with the Lunar Registry","type":"post-weblog","URL":"https://www.openlunar.org/library/open-lunar-registry-project-blog-post-series-blog-2"},
  {"id":"WindlEtAl2006","abstract":"Understanding and using the Network Time Protocol (A first try on a non-technical Mini-HOWTO and FAQ on NTP)","accessed":{"date-parts":[[2023,2,18]]},"citation-key":"WindlEtAl2006","container-title":"The NTP FAQ and HOWTO","contributor":[{"family":"Windl","given":"Ulrich"},{"family":"Dalton","given":"David"},{"family":"Martinec","given":"Marc"},{"family":"Worley","given":"Dale R."}],"issued":{"date-parts":[[2006,11,21]]},"license":"GNU General Public License","title":"How does it work?","type":"webpage","URL":"http://www.ntp.org/ntpfaq/NTP-s-algo.htm"},
  {"id":"WindlEtAl2006a","abstract":"Understanding and using the Network Time Protocol (A first try on a non-technical Mini-HOWTO and FAQ on NTP)","accessed":{"date-parts":[[2023,2,19]]},"citation-key":"WindlEtAl2006a","container-title":"The NTP FAQ and HOWTO","contributor":[{"family":"Windl","given":"Ulrich"},{"family":"Dalton","given":"David"},{"family":"Martinec","given":"Marc"},{"family":"Worley","given":"Dale R."}],"issued":{"date-parts":[[2006,11,21]]},"title":"Clock Quality","type":"webpage","URL":"http://www.ntp.org/ntpfaq/NTP-s-sw-clocks-quality.htm"},
  {"id":"WuEtAl2017","abstract":"Chang’E-IV will be the first soft-landing and rover mission on the lunar farside. The relay satellite, which is located near the Earth-Moon L2 point for relay communication, is the key to the landing mission. Based on an analysis of the characteristics of the task and the technical difficulties associated with the relay satellite system, the overall design scheme of the relay communication mission is proposed in terms of trajectory design and communication system design among other aspects. First, according to the complex dynamic environment, a mission orbit that serves as an uninterrupted communication link is presented. A short-duration and low-energy transfer trajectory with lunar flyby is discussed. Orbital correction and a low-cost control strategy for orbit maintenance in the Earth-Moon L2 point region are provided. Second, considering the existing technical constraints, the requirement of relay communication in different stages and the design schemes of frequency division and redundant relay communication system are introduced. Finally, based on the trajectory design index and the performance of the communication system, the overall design scheme of the relay communication mission is proposed. This mission will provide the technical support and reference required for the Chang’E-IV mission.","accessed":{"date-parts":[[2023,3,27]]},"author":[{"family":"Wu","given":"Weiren"},{"family":"Tang","given":"Yuhua"},{"family":"Zhang","given":"Lihua"},{"family":"Qiao","given":"Dong"}],"citation-key":"WuEtAl2017","container-title":"Science China Information Sciences","container-title-short":"Sci. China Inf. Sci.","DOI":"10.1007/s11432-017-9202-1","ISSN":"1869-1919","issue":"4","issued":{"date-parts":[[2017,12,12]]},"language":"en","page":"040305","source":"Springer Link","title":"Design of communication relay mission for supporting lunar-farside soft landing","type":"article-journal","URL":"https://doi.org/10.1007/s11432-017-9202-1","volume":"61"},
  {"id":"Yamashita2010","abstract":"We propose an optimal time adjustment method from the viewpoint of frequency stability, which is defined as the Allan deviation. When time adjustment is needed for a clock in a networked computer, it is made over a period called a time adjustment period. The proposed method optimizes frequency stability for a given time adjustment period. This method has been evaluated and compared with the adjtime() system call in UNIX systems in terms of frequency stability and duration of time adjustment period needed for achieving particular values of frequency stability. For time intervals from 1 to 1,000 s, the frequency stability achieved by the proposed method was about 0.01-0.5 of that achieved by the adjtime() system call. The evaluation also showed that the duration of a time adjustment period needed for achieving the frequency stability of 1.0 × 10-10 in the proposed method was less than 1/12 (1/6) that of the period in the adjtime() system call when we optimized frequency stability for a 60 (3,600) s time interval under the condition that the duration of the time-adjustment period was 12 h.","author":[{"family":"Yamashita","given":"T"}],"citation-key":"Yamashita2010","container-title":"IEEE Transactions on Computers","DOI":"10.1109/tc.2010.106","issue":"10","issued":{"date-parts":[[2010,10,1]]},"note":"MAG ID: 2100236458","page":"1320-1336","title":"Stability-Optimized Time Adjustment for a Networked Computer Clock","type":"article-journal","volume":"59"},
  {"id":"ZhangLombardi2008","abstract":"Abstract : The National Institute of Standards and Technology (NIST) maintains one of the world's most accurate and stable time scales, and also developed and maintains the primary frequency standard for the United States. Various techniques are used to compare the NIST time scale, UTC (NIST), and the NIST primary frequency standard to other standards located around the world. These techniques include two-way satellite time and frequency transfer (TWSTFT), code-based GPS common-view, and GPS carrier-phase comparisons. NIST provides remote time and frequency calibration services to industries and research institutes using GPS time transfer technologies. We disseminate UTC (NIST) through signals broadcast by our radio stations WWV/WWVH and WWVB, the Internet Time Service (ITS), and the Automated Computer Time Service (ACTS). NIST also conducts research intended to develop new time transfer techniques and to improve the performance of existing methods.","author":[{"family":"Zhang","given":"Victor S."},{"family":"Lombardi","given":"Michael A."}],"citation-key":"ZhangLombardi2008","issued":{"date-parts":[[2008,12,4]]},"note":"MAG ID: 28795382","page":"623-640","title":"Time and Frequency Transfer Activities at NIST","type":"article-journal"},
  {"id":"zotero-144","accessed":{"date-parts":[[2023,2,12]]},"citation-key":"zotero-144","container-title":"Engineering Matters","language":"en-US","title":"Japan approves first ever commercial activity on Moon","type":"post-weblog","URL":"https://engineeringmatters.reby.media/2022/11/10/japan-approves-first-ever-commercial-activity-on-moon/"},
  {"id":"zotero-208","accessed":{"date-parts":[[2023,2,12]]},"citation-key":"zotero-208","title":"pool.ntp.org: the internet cluster of ntp servers","type":"webpage","URL":"https://www.ntppool.org/en/"},
  {"id":"zotero-216","accessed":{"date-parts":[[2023,2,12]]},"citation-key":"zotero-216","container-title":"Microsemi.com","title":"Rad-Tolerant Ruggedized Oscillators","type":"webpage","URL":"https://www.microsemi.com/product-directory/radiation-tolerant-devices/3801-rad-tolerant-ruggedized-oscillators"},
  {"id":"zotero-218","accessed":{"date-parts":[[2023,2,12]]},"citation-key":"zotero-218","container-title":"Microchip.com","title":"CSAC-SA45S","type":"webpage","URL":"https://www.microchip.com/en-us/product/CSAC-SA45S#document-table"},
  {"id":"zotero-220","abstract":"The RAFS is a cost-effective, ultra-high-performance, space-qualified rubidium frequency standard.","accessed":{"date-parts":[[2023,2,12]]},"citation-key":"zotero-220","container-title":"Orolia","language":"en-US","title":"RAFS","type":"webpage","URL":"https://www.orolia.com/product/rafs/"},
  {"id":"zotero-222","accessed":{"date-parts":[[2023,2,12]]},"citation-key":"zotero-222","container-title":"Excelitas Technologies","title":"Space-Qualified Rubidium Atomic Frequency Standard Clocks","type":"webpage","URL":"https://www.excelitas.com/product/space-qualified-rubidium-atomic-frequency-standard-clocks"},
  {"id":"zotero-246","abstract":"The mRO-50 Ruggedized is a low SWaP-C Rubidium Oscillator - providing a one-day holdover below 1µs - designed for time-critical applications.","accessed":{"date-parts":[[2023,2,19]]},"citation-key":"zotero-246","container-title":"Orolia","language":"en-US","title":"mRO-50 Ruggedized","type":"webpage","URL":"https://www.orolia.com/product/mro-50-ruggedized/"},
  {"id":"zotero-295","abstract":"What is the difference between NTP (Network Time Protocol) and PTP (Precision Time Protocol)? Why is PTP so accurate? Hardware-based timestamping is the basis of PTP, which can achieve higher accuracies than NTP by factoring in network latency.","accessed":{"date-parts":[[2023,2,20]]},"citation-key":"zotero-295","container-title":"Masterclock, Inc.","language":"en-US","title":"Network Timing Technology: NTP vs PTP","title-short":"Network Timing Technology","type":"webpage","URL":"https://www.masterclock.com/support/library/network-timing-ntp-vs-ptp"},
  {"id":"zotero-334","abstract":"Humanity’s relentless endeavor to push the boundaries of space exploration is well-documented. From manned missions to probes speeding their way to the farthest corners of the solar system and beyond, the thirst to discover the secrets of the Universe has never been so resolutely demonstrated as it is now.","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-334","container-title":"Nokia","language":"en","title":"Nokia aims for the Moon with LTE/4G","type":"webpage","URL":"https://www.nokia.com/about-us/newsroom/articles/nokia-aims-for-the-moon-with-lte4g/"},
  {"id":"zotero-336","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-336","title":"Radio's First Message -- Fessenden and Marconi","type":"webpage","URL":"https://ewh.ieee.org/reg/7/millennium/radio/radio_differences.html"},
  {"id":"zotero-346","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-346","container-title":"DTN7","language":"en-US","title":"DTN7","type":"webpage","URL":"https://dtn7.github.io/"},
  {"id":"zotero-350","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-350","title":"dtn7/awesome-dtn: A curated list of awesome delay- and disruption-tolerant networking","type":"webpage","URL":"https://github.com/dtn7/awesome-dtn"},
  {"id":"zotero-361","abstract":"NASA’s RPS program enables more capable future space missions by supporting the development of advanced technologies for power conversion nuclear power technologies.","accessed":{"date-parts":[[2023,4,5]]},"citation-key":"zotero-361","container-title":"NASA RPS: Radioisotope Power Systems","language":"en","title":"Light-Weight Radioisotope Heater Unit | Thermal Systems","type":"webpage","URL":"https://rps.nasa.gov/power-and-thermal-systems/thermal-systems/light-weight-radioisotope-heater-unit"},
  {"id":"zotero-379","accessed":{"date-parts":[[2023,4,11]]},"citation-key":"zotero-379","title":"Time metrology - BIPM","type":"webpage","URL":"https://www.bipm.org/en/time-metrology"},
  {"id":"zotero-387","accessed":{"date-parts":[[2023,4,11]]},"citation-key":"zotero-387","title":"BIPM Time Dept database","type":"webpage","URL":"https://webtai.bipm.org/database/clock.html"},
  {"id":"zotero-403","abstract":"The test version of a unique satellite navigation receiver has been delivered for integration testing on the Lunar Pathfinder spacecraft.&nbsp;The NaviMoon satnav receiver is designed to perform the farthest ever positioning fix from Earth, employing signals that will be millions of times fainter than those used by our smartphones or cars.","accessed":{"date-parts":[[2023,4,27]]},"citation-key":"zotero-403","language":"en","title":"The Moon – where no satnav has gone before","type":"webpage","URL":"https://www.esa.int/Applications/Navigation/The_Moon_where_no_satnav_has_gone_before"},
  {"id":"zotero-409","accessed":{"date-parts":[[2023,4,27]]},"citation-key":"zotero-409","title":"Time Scales: UT1, UTC, TAI, ET, TT, GPS time","type":"webpage","URL":"https://stjarnhimlen.se/comp/time.html"},
  {"id":"zotero-420","abstract":"Explore millions of resources from scholarly journals, books, newspapers, videos and more, on the ProQuest Platform.","accessed":{"date-parts":[[2023,5,6]]},"citation-key":"zotero-420","language":"en","title":"Autonomous Navigation in Deep Space Using Optical Measurements of Unresolved Planets and Stars - ProQuest","type":"webpage","URL":"https://www.proquest.com/openview/fc98ce9fd007de9fc787eb1b921d1d88/1?pq-origsite=gscholar&cbl=18750&diss=y"},
  {"id":"zotero-427","abstract":"Overview of the Timecard PCIe device.","accessed":{"date-parts":[[2023,5,6]]},"citation-key":"zotero-427","language":"en","title":"Timecard | Time Appliances Project (TAP)","type":"webpage","URL":"http://www.timingcard.com//Time-Appliance-Project/docs/category/timecard"},
  {"id":"zotero-684","abstract":"Introducing the OCP-TAP TimeCard, the ultimate timekeeping solution for precise synchronization. This innovative product offers a range of options, including Rubidium, Cesium, and Quartz OCXO, catering to diverse timekeeping needs. Experience unparalleled accuracy and stability with the CSAC option. Powered by advanced","accessed":{"date-parts":[[2023,7,12]]},"citation-key":"zotero-684","container-title":"timebeat.app","language":"en","title":"OCP-TAP Timecard - CSAC","type":"webpage","URL":"https://store.timebeat.app/products/ocp-tap-timecard-csac"}
]
